{
  "post_path": "inspections",
  "response": [200,201],
  "values": [
    {
      "inspection_id": "2370285",
      "name": "SULTAN'S MARKET",
      "aka_name": "SULTAN'S MARKET",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "2657 W NORTH AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60647",
      "date": "08/16/2010",
      "inspection_type": "Short Form Complaint",
      "results": "Out of Business",
      "violations": "",
      "latitude": "41.910332930128",
      "longitude": "-87.67971585452",
      "location": "(-87.67971585451996, 41.91033293012805)"
    },
    {
      "inspection_id": "2370287",
      "name": "BRIKS",
      "aka_name": "BRICKS",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "1909 N LINCOLN AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60614",
      "date": "03/23/2016",
      "inspection_type": "Canvass Re-Inspection",
      "results": "Pass",
      "violations": "30. FOOD IN ORIGINAL CONTAINER, PROPERLY LABELED: CUSTOMER ADVISORY POSTED AS NEEDED - Comments: Inspector Comments: MUST LABEL BULK FOOD STORAGE CONTAINERS   | 32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: Inspector Comments: MUST REPAIR OR REPLACE WORN DOOR GASKETS ON 2- DOOR REACH IN COOLER & PIZZA PREP COOLER,MISSING DOOR HANDLE ON REACH IN FREEZER.MUST REMOVE RUST FROM SHELVING UNITS IN PIZZA PREP COOLER.MUST PROVIDE A DIVIDER IN BETWEEN SODA COLD PLATE INSIDE OF ICE BIN BEHIND BAR.   | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: Inspector Comments: MUST CLEAN DEBRI FROM MEAT SLICER,FLOOR MIXER,SHELVING UNITS IN PREP COOLER,STORAGE AREAS,LOWER INTERIOR OF COOLER AROUND MOTOR,WALK IN COOLER FANGUARD COVERS,EXHAUST FAN BEHIND BAR,INTERIOR BASIN OF 3- COMP & BAR SINKS,BAR BEER COOLER.     | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: Inspector Comments: MUST CLEAN FLOUR FROM FLOOR UNDER,AROUND,ALONG WALL BASES IN KITCHEN.MUST CLEAN DEBRI FROM FLOOR IN BAR AREA & WALK IN COOLER.MUST REPAIR OR REPLACE BROKEN AND DAMAGED CONCRETE FLOOR IN KITCHEN.   | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: Inspector Comments: MUST CLEAN FOOD DEBRI AND DUST BUILD UP FROM WALLS IN PREP AREA.MUST REPAIR OR REPLACE DAMAGED,MISSING AND LOOSE WALL BASES AND WALL PANEL,CEILING IN PREP AREA ,MEN'S & WOMEN'S TOILETROOM, IN BAR AREA,HOLE IN WALL IN PAPER GOODS STORAGE,MISSING WALL OUTLET COVER ABOVE SALAD PREP COOLE,KICK PLATE LOOSE ON FRONT ENTRY DOOR.MUST SEAL ALL OPENINGS AROUND PIPES AND WIRES LEADING INTO WALK IN COOLER,CEILING ABOVE BAR AREA.MUST SCRAPE AND PAINT PEELING PAINT ON WALL ABOVE 3- COMP SINK IN PREP AREA.     | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: Inspector Comments: MUST REPAIR OR REPLACE LEAKY PIPE AT HAND SINK IN BAR AREA,LOW COLD WATER PRESSURE AT 3- COMP SINK IN PREP AREA.MUST INSTALL A MOPSINK WITH HOT AND COLD RUNNING WATER.   | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: Inspector Comments: MUST ELEVATE,ORGANIZE OR REMOVE ARTICLES OFF OF FLOOR AND AWAY FROM WALLS IN CLOSETS IN KITCHEN,LIQUOR STORAGE AREA ",
      "latitude": "41.9168481098103",
      "longitude": "-87.6365244655254",
      "location": "(-87.6365244655254, 41.91684810981031)"
    },
    {
      "inspection_id": "1560149",
      "name": "THE GAGE",
      "aka_name": "THE GAGE",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "24 S MICHIGAN AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60603",
      "date": "07/13/2015",
      "inspection_type": "Complaint",
      "results": "Fail",
      "violations": "12. HAND WASHING FACILITIES: WITH SOAP AND SANITARY HAND DRYING DEVICES, CONVENIENT AND ACCESSIBLE TO FOOD PREP AREA - Comments: OBSERVED THE BAR, REAR PREP AND DISH WASHING EXPOSED HAND SINKS WITH NO PAPER TOWELS. INSTRUCTED TO PROVIDE AND MAINTAIN A METHOD FOR HAND DRYING AT ALL HAND WASHING FACILITIES. CRITICAL VIOLATION 7-38-030 | 18. NO EVIDENCE OF RODENT OR INSECT OUTER OPENINGS PROTECTED/RODENT PROOFED, A WRITTEN LOG SHALL BE MAINTAINED AVAILABLE TO THE INSPECTORS - Comments: OBSERVED APPROXIMATELY 20 LIVE FRUIT FLIES ON THE WALLS SURROUNDING THE MOP SINK BY THE DISH WASHING ROOM. INSTRUCTED TO PROVIDE ADDITIONAL PEST CONTROL TO MINIMIZE OR ELIMINATE THE PEST ACTIVITY. SERIOUS VIOLATION 7-38-020 | 32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: OBSERVED THE CUTTING BOARDS THROUGHOUT THE PREP AREA WITH DEEP DARK GROOVESAND DISCOLORATION. INSTRUCTED TO REPLACE AND MAINTAIN ALL CUTTING BOARDS. | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: OBSERVED THE WET MOP STORED INSIDE OF THE MOP BUCKET AT THE MOP SINK. INSTRUCTED TO HANG OR INVERT ALL WET MOPS.",
      "latitude": "41.88151441122683",
      "longitude": "-87.62449559602777",
      "location": "(-87.62449559602777, 41.88151441122683)"
    },
    {
      "inspection_id": "2370284",
      "name": "SULTAN'S MARKET",
      "aka_name": "SULTAN'S MARKET",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "2057 W NORTH",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60647",
      "date": "08/16/2010",
      "inspection_type": "Short Form Complaint",
      "results": "Out of Business",
      "violations": "",
      "latitude": "41.910332930128",
      "longitude": "-87.67971585452",
      "location": "(-87.67971585451996, 41.91033293012805)"
    },
    {
      "inspection_id": "2370288",
      "name": "BRICKS",
      "aka_name": "BRICKS",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "1909 N LINCOLN AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60614",
      "date": "12/20/2016",
      "inspection_type": "Complaint",
      "results": "No Entry",
      "violations": "",
      "latitude": "41.9168481098103",
      "longitude": "-87.6365244655254",
      "location": "(-87.6365244655254, 41.91684810981031)"
    },
    {
      "inspection_id": "1588339",
      "name": "THE PASTA BOWL COMPANY",
      "aka_name": "THE PASTA BOWL COMPANY",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "2434-2436 N CLARK ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60614",
      "date": "11/13/2015",
      "inspection_type": "Complaint",
      "results": "Pass",
      "violations": "32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: OBSERVED SOUP BOWL BEING USED AS COVER FOR SOUP HOT HOLDING UNIT. REPLACE SOUP HOT HOLDING UNIT WITH APPROPRIATE LID. | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: OBSERVED INTERIOR OF ICE MACHINE UNCLEAN WITH BLACK MILDEWY LIKE SUBSTANCE. CLEAN AND MAINTAIN INE MACHINE. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: OBSERVED FLOORS UNCLEAN FLOORS IN BACK KITHCEN AROUND HOT WATER HEATER AND DISH MACHINE. FLOORS MUST BE CLEANED IN DETAIL AND MAINTAINED.OBSERVED FLOORS IN FRONT FOOD PREPARATION AREA UNCLEAN WITH FOOD DEBRIS. CLEAN AND MAINTAIN ALL FLOORS UNDER AND BEHIND ALL COOKING EQUIPMENT. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: OBSERVED VENT IN PREP ROOM WITH HEAVY DUST ACCUMULATION. CLEAN AND MAINTAIN VENT IN PREP ROOM. | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: OBSERVED LEAKING FAUCET OF 3 COMPARTMENT SINK. REPAIR AND MAINTAIN FAUCET.",
      "latitude": "41.926453319736645",
      "longitude": "-87.6411696521496",
      "location": "(-87.64116965214959, 41.926453319736645)"
    },
    {
      "inspection_id": "2116566",
      "name": "SUSHI-SAN",
      "aka_name": "SUSHI-SAN",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "63 W GRAND AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60654",
      "date": "11/30/2017",
      "inspection_type": "License",
      "results": "Pass",
      "violations": "",
      "latitude": "41.89152462421973",
      "longitude": "-87.6305188254299",
      "location": "(-87.6305188254299, 41.89152462421973)"
    },
    {
      "inspection_id": "2261995",
      "name": "TWISTED HIPPO TAPROOM AND EATERY",
      "aka_name": "TWISTED HIPPO TAPROOM AND EATERY",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "2925 W MONTROSE AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60618",
      "date": "02/14/2019",
      "inspection_type": "Complaint",
      "results": "Pass",
      "violations": "49. NON-FOOD/FOOD CONTACT SURFACES CLEAN - Comments: OBSERVED DUST BUILD UP ON PREP AREA COOLERS CONDENSERS. INSTRUCTED MANAGER MUST CLEAN AND MAINTAIN COOLERS CONDENSERS.",
      "latitude": "41.961118579582894",
      "longitude": "-87.70191546826284",
      "location": "(-87.70191546826284, 41.9611185795829)"
    },
    {
      "inspection_id": "1277860",
      "name": "THE SAVOY",
      "aka_name": "THE SAVOY",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "1408 N MILWAUKEE AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60642",
      "date": "05/23/2013",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "31. CLEAN MULTI-USE UTENSILS AND SINGLE SERVICE ARTICLES PROPERLY STORED: NO REUSE OF SINGLE SERVICE ARTICLES - Comments: Multi use utensils not properly stored. Instructed to invert utensils to prevent contamination before use. | 32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: Exposed handsink in basement installed next to three compartment sink and prep table. Instructed to install shield on sides of exposed handsink.    Exposed raw wood on storage shelve sin basement. Instructed to apply non-toxic sealant to surface. | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: Exhaust hood filters and can opener attached to prep table not cleaned. Instructed to detail clean and sanitize. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: Floor behind equipment and along wallbase not cleaned. Instructed to detail clean daily. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: Light shields in basement prep area not cleaned. Instructed to detail clean. | 36. LIGHTING: REQUIRED MINIMUM FOOT-CANDLES OF LIGHT PROVIDED, FIXTURES SHIELDED - Comments: Light bulbs not shielded in basement prep area. Insructed to shield bulbs or install shatter proof bulbs. | 40. REFRIGERATION AND METAL STEM THERMOMETERS PROVIDED AND CONSPICUOUS - Comments: Thermometer not provided inside prep beverage cooler. Instructed to provide thermometer visible inside cooler. | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: Supplies and stock stored on floor in basement storage room. Instructed to elevate supplies 6 inches or higher and away from wall. | 42. APPROPRIATE METHOD OF HANDLING OF FOOD (ICE) HAIR RESTRAINTS AND CLEAN APPAREL WORN - Comments: Food handler in prep area not wearing hair restraint. Instructed that all food handlers and employees in prep area must have proper hair restraint.",
      "latitude": "41.90742472961463",
      "longitude": "-87.6730736738879",
      "location": "(-87.6730736738879, 41.907424729614625)"
    },
    {
      "inspection_id": "2370286",
      "name": "SUTAN'S MARKET",
      "aka_name": "SULTAN'S MARKET",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "2057 W NORTH AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60647",
      "date": "08/16/2010",
      "inspection_type": "Short Form Complaint",
      "results": "Out of Business",
      "violations": "",
      "latitude": "41.910332930128",
      "longitude": "-87.67971585452",
      "location": "(-87.67971585451996, 41.91033293012805)"
    }
  ]
}