{
  "post_path": "inspections",
  "response": [200,201],
  "values": [
    {
      "inspection_id": "1583329",
      "name": "SPIAGGIA PRIVATE DINING ROOMS",
      "aka_name": "SPIAGGIA PRIVATE DINING ROOMS",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "980 N MICHIGAN AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60611",
      "date": "10/22/2015",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: DETAIL CLEAN WALLS IN PREP AREAS AS NEEDED.  | 36. LIGHTING: REQUIRED MINIMUM FOOT-CANDLES OF LIGHT PROVIDED, FIXTURES SHIELDED - Comments: MUST REPLACE THE BURNED OUT LIGHT BULB UNDER THE VENTILATION HOOD ABOVE THE COOKING EQUIPMENT.  ",
      "latitude": "41.900801649451964",
      "longitude": "-87.6242724679302",
      "location": "(-87.6242724679302, 41.90080164945196)"
    },
    {
      "inspection_id": "1995932",
      "name": "Edge of Sweetness",
      "aka_name": "Edge of Sweetness",
      "facility_type": "Bakery",
      "risk": "Risk 1 (High)",
      "address": "6034 N Broadway ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60660",
      "date": "03/21/2017",
      "inspection_type": "License",
      "results": "Pass",
      "violations": "32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: NO SPLASH GUARD PROVIDED AT EXPOSED HAND SINK FRONT PREP/SERVING AREA BY THE COFFEE STATION.INSTRUCTED TO INSTALL  SPLASH GUARD ON BOTH SIDE OF THE EXPOSED HAND SINK. SURFACE MUST BE SMOOTH,CLEANABLE AND NON-ABSORBENT SURFACE. RUSTY SHELVES INSIDE  THE THREE DOOR REACH-IN COOLER ACROSS FROM PREP TABLE IN THE KITCHEN,REPLACE.SURFACE MUST BE SMOOTH CLEANABLE AND NON-ABSORBENT SURFACE",
      "latitude": "41.99184288216862",
      "longitude": "-87.66047142116385",
      "location": "(-87.66047142116385, 41.99184288216862)"
    },
    {
      "inspection_id": "1361183",
      "name": "HILTON GARDEN INN CHICAGO DOWN",
      "aka_name": "HILTON GARDEN INN",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "10 E GRAND AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60611",
      "date": "09/24/2013",
      "inspection_type": "Canvass Re-Inspection",
      "results": "Pass",
      "violations": "",
      "latitude": "41.8917914631124",
      "longitude": "-87.62765774119987",
      "location": "(-87.62765774119987, 41.8917914631124)"
    },
    {
      "inspection_id": "1372350",
      "name": "Madison Street Cafe",
      "aka_name": "Madison Street Cafe",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "70 W MADISON ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60602",
      "date": "01/14/2014",
      "inspection_type": "Canvass",
      "results": "Fail",
      "violations": "16. FOOD PROTECTED DURING STORAGE, PREPARATION, DISPLAY, SERVICE AND TRANSPORTATION - Comments: TOP PORTION OF SNEEZE GUARD IS MISSING, EXPOSING OPEN FOOD TO CUSTOMER'S CONTAMINATION. INSTRUCTED MGR TO INSTALL AND MAINATIN. | 21. * CERTIFIED FOOD MANAGER ON SITE WHEN POTENTIALLY HAZARDOUS FOODS ARE  PREPARED AND SERVED - Comments: NO CERTIFIED FOOD AND SANITATION MGR ON SITE WHILE HANDLING AND SERVING POTENTIALLY HAZARDOUS FOODS. INSTRUCTED TO OBTAIN. | 26. ADEQUATE NUMBER, CONVENIENT, ACCESSIBLE, PROPERLY DESIGNED AND INSTALLED - Comments: IMPROPER USAGE OF HAND WASH SINK, OBSERVED EMPLOYEE RINSING FRYING PAN SEVERAL TIMES IN THE FRONT BREAKFAST STATION HAND SINK, INSTRUCTED NOT TO USE THE EXPOSED HAND SINK FOR OTHER THAN HANDS WASHING. | 30. FOOD IN ORIGINAL CONTAINER, PROPERLY LABELED: CUSTOMER ADVISORY POSTED AS NEEDED - Comments: BULK-FOOD CONTAINERS NOT LABELED, INSTRUCTED TO LABEL AND MAINTAIN. | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: DELI MEAT SLICER NOT CLEANED PROPERLY, FOUND FOOD DEBRIS STUCK ON BLADE COVER, INSTRUCTED TO TO CLEAN AND MAINTAIN. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: DROP CEILING PANEL ABOVE PREP TABLE NOT PLACED PROPERLY WITH HEAVY DUST AND LOOSE TAPE, INSTRUCTED TO REPAIR.",
      "latitude": "41.88209336730132",
      "longitude": "-87.63039164462683",
      "location": "(-87.63039164462683, 41.882093367301316)"
    },
    {
      "inspection_id": "2268761",
      "name": "LOUISA MAY ALCOTT",
      "aka_name": "LOUISA MAY ALCOTT",
      "facility_type": "School",
      "risk": "Risk 1 (High)",
      "address": "2625 N Orchard (700W) ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60614",
      "date": "03/01/2019",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "28. TOXIC SUBSTANCES PROPERLY IDENTIFIED, STORED, & USED - Comments: OBSERVED FOOD HANDLER PERSONAL BAG, WINTER COAT, ETC. STORED ON BULK FOOD STORAGE BIN IN REAR DRY STORAGE AREA AND MAIN KITCHEN PREP AREAS.  INFORMED MANAGER THAT PERSONAL ITEMS MUST BE STORED IN EMPLOYEE DESIGNATED AREAS.   INSTRUCTED MANAGER TO REMOVE AND STORE PERSONAL ITEMS IN EMPLOYEE DESIGNATED AREAS.  MAINTAIN AT ALL TIMES. | 53. TOILET FACILITIES: PROPERLY CONSTRUCTED, SUPPLIED, & CLEANED - Comments: OBSERVED SELF CLOSING DEVICE ON EMPLOYEE BATHROOM ADJACENT TO DRY STORAGE ROOM NOT WORKING. INSTRUCTED MANAGER TO REPAIR. MAINTAIN AT ALL TIMES. ",
      "latitude": "41.92984626299402",
      "longitude": "-87.64633949131641",
      "location": "(-87.6463394913164, 41.929846262994026)"
    },
    {
      "inspection_id": "1115160",
      "name": "TARGET STORE # 1889",
      "aka_name": "STARBUCKS",
      "facility_type": "Restaurant",
      "risk": "Risk 2 (Medium)",
      "address": "1154 S CLARK ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60605",
      "date": "11/27/2013",
      "inspection_type": "Canvass",
      "results": "Pass w/ Conditions",
      "violations": "21. * CERTIFIED FOOD MANAGER ON SITE WHEN POTENTIALLY HAZARDOUS FOODS ARE  PREPARED AND SERVED - Comments: FOUND NO CITY OF CHICAGO CERTIFIED FOOD MANAGER ON SITE WHILE HANDLING/SERVING POTENTIALLY HAZARDOUS FOODS (I.E. BEEF, PORK, DAIRY, ETC.) INSTRUCTED TO HAVE ONE ON SITE AT ALL TIMES. SERIOUS VIOLATION 7-38-012 | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: MUST DETAIL CLEAN AND MAINTAIN THE INTERIOR OF THE FLOOR DRAINS AND FLOORS IN THE REAR STORAGE AREA. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: MUST DETAIL CLEAN AND MAINTAIN THE WALLS BEHIND THE COOLERS AND COOKING EQUIPMENT.",
      "latitude": "41.86757101543305",
      "longitude": "-87.63058647386144",
      "location": "(-87.63058647386143, 41.86757101543305)"
    },
    {
      "inspection_id": "2184624",
      "name": "CRAFT & BARREL",
      "aka_name": "CRAFT & BARREL",
      "facility_type": "Liquor",
      "risk": "Risk 3 (Low)",
      "address": "1433 W BELMONT AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60657",
      "date": "07/16/2018",
      "inspection_type": "License Re-Inspection",
      "results": "Pass",
      "violations": "",
      "latitude": "41.93963539333258",
      "longitude": "-87.6651419171776",
      "location": "(-87.66514191717759, 41.93963539333258)"
    },
    {
      "inspection_id": "2233157",
      "name": "AUTUMN GREEN AT MIDWAY VILLAGE",
      "aka_name": "AUTUMN GREEN AT MIDWAY VILLAGE",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "6700 S KEATING AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60629",
      "date": "11/14/2018",
      "inspection_type": "Canvass",
      "results": "Fail",
      "violations": "3. MANAGEMENT, FOOD EMPLOYEE AND CONDITIONAL EMPLOYEE; KNOWLEDGE, RESPONSIBILITIES AND REPORTING - Comments: NO EMPLOYEE HEALTH POLICY IN PLACE. INSTD TO PROVIDE AND MAINTAIN. PRIORITY FOUNDATION 7-38-010 | 5. PROCEDURES FOR RESPONDING TO VOMITING AND DIARRHEAL EVENTS - Comments: NO PROCEDURE FOR RESPONDING TO VOMITING AND DIARRHEAL EVENTS. INSTD TO PROVIDE AND MAINTAIN. PRIORITY FOUNDATION VIOLATION 7-38-005 | 10. ADEQUATE HANDWASHING SINKS PROPERLY SUPPLIED AND ACCESSIBLE - Comments: NO HANDWASHING SINK AT 2ND FLOOR ASSISTED LIVING DINING AREA WHERE SERVING LINE/STEAM TABLE LOCATED AND RESIDENTS ARE SERVED. INSTD TO PROVIDE DESIGNATED 1-COMPARTMENT HANDSINK WITH HOT/COLD RUNNING WATER UNDER CITY PRESSURE. PRIORITY FOUNDATION 7-38-030(C). | 23. PROPER DATE MARKING AND DISPOSITION - Comments: VARIETY OF FOODS NOT PROPERLY LABELED, DATED (COOKED PASTA, CHILI, ETC.) FOOD PREPARED AND HELD FOR MORE THAN 24 HOURS SHALL BE CLEARLY MARKED TO INDICATE THE DAY OR DATE BY WHICH FOOD SHALL BE SOLD OR DISCARDED FOR A MAXIMUM OF 7 DAYS. PRIORITY FOUNDATION VIOLATION 7-38-005. | 38. INSECTS, RODENTS, & ANIMALS NOT PRESENT - Comments: OVER 15 LIVE SMALL FLIES NOTED ON CEILINGS, WALLS AND FLYING NEAR ICE MACHINE AND DISHMACHINE. INSTD TO REMOVE ALL FLIES, CLEAN AND SANITIZE AFFECTED AREAS AND HAVE UPDATED PEST CONTROL SERVICE. CITATION ISSUED 7-38-020(A). PRIORITY FOUNDATION. | 47. FOOD & NON-FOOD CONTACT SURFACES CLEANABLE, PROPERLY DESIGNED, CONSTRUCTED & USED - Comments: CABINET UNDER STEAM TABLE IN PREP AREA IN POOR REPAIR, WORN,CRACKED SURFACE AND MISSING DOOR.  SELF SERVICE BEVERAGE STATION LEAKING UNDERNEATH. INSTD TO REPAIR AND MAINTAIN. | 55. PHYSICAL FACILITIES INSTALLED, MAINTAINED & CLEAN - Comments: WALLBASE MISSING IN BOTH FOOD STAFF TOILET ROOMS. INSTD TO INSTALL AND MAINTAIN. ALL WALLS IN DISHMACHINE AREA (ABOVE AND BELOW DISHMACHINE) WITH WORN SURFACE AND BLACK SUBSTANCE ON WALLS. INSTD TO REPAIR/MAINTAIN WALLS, REMOVE BLACK MOLD LIKE SUBSTANCE.",
      "latitude": "41.771069588287695",
      "longitude": "-87.74052887602656",
      "location": "(-87.74052887602656, 41.771069588287695)"
    },
    {
      "inspection_id": "1324517",
      "name": "HOLIDAY BAR & GRILL",
      "aka_name": "HOLIDAY BAR & GRILL",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "740 W RANDOLPH ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60661",
      "date": "06/13/2013",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: MUST CLEAN AND DEFROST INTERIOR OF WALK IN FREEZER TO REMOVE ICE BUILD UP. ALSO CLEAN INTERIOR OF ICE MACHINE. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: FLOORS INSIDE WALK IN COOLER NEEDS CLEANING ALONG WALL BASE AND IN CORNERS TO REMOVE DEBRIS.",
      "latitude": "41.88451685704581",
      "longitude": "-87.6473906819507",
      "location": "(-87.64739068195071, 41.88451685704581)"
    },
    {
      "inspection_id": "2116316",
      "name": "VIET HOA PLAZA",
      "aka_name": "VIET HOA PLAZA",
      "facility_type": "Grocery Store",
      "risk": "Risk 2 (Medium)",
      "address": "1051 W ARGYLE ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60640",
      "date": "11/28/2017",
      "inspection_type": "Canvass",
      "results": "Pass w/ Conditions",
      "violations": "3. POTENTIALLY HAZARDOUS FOOD MEETS TEMPERATURE REQUIREMENT DURING STORAGE, PREPARATION DISPLAY AND SERVICE - Comments: OBSERVED INADEQUATE FOOD TEMPERATURES. APPROXIMATELY 20 LBS OF DUCK EGGS IN THE WALK-IN COOLER RANGING IN TEMPERATURE BETWEEN 54.1 TO 51.8F. COOLER TEMPERATURE FOUND AT 41.7F WITH OTHER FOODS AT PROPER TEMPERATURE. EGGS DISCARDED. MANAGEMENT STATES ESTIMATED VALUE TO BE $120.00. CRITICAL VIOLATION 7-38-005(A). | 30. FOOD IN ORIGINAL CONTAINER, PROPERLY LABELED: CUSTOMER ADVISORY POSTED AS NEEDED - Comments: ALL PRE-PACKAGED ITEMS SUCH AS FROZEN FISH, MUST BE PROPERLY LABELED WITH BUSINESS NAME, ADDRESS LIST OF INGREDIENTS. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: MUST NOT USE CARDBOARD AS MATTING FOR FLOORS IN THE MEAT PREP AREA. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: EXCESSIVE DUST ON THE WALL AND ELECTRICAL CORDS ABOVE THE MEAT PREP CUTTING TABLE. MUST CLEAN AND MAINTAIN. | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: INSTRUCTED TO INSTALL AN EXPOSED HAND WASHING SINK WITH HOT AND COLD RUNNING WATER, SOAP AND PAPER TOWELS IN THE REAR PRODUCE PREP AND LARGE THREE COMPARTMENT SINK DISH AREA. | 40. REFRIGERATION AND METAL STEM THERMOMETERS PROVIDED AND CONSPICUOUS - Comments: MUST PROVIDE AN ACCURATE INTERNAL THERMOMETER FOR THE BASEMENT WALK-IN FREEZER OR REPAIR INACCURATE EXTERNAL THERMOMETER. | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: MUST NOT STORE USED CARDBOARD BOXES BEHIND STORAGE SHELVING THROUGHOUT GROCERY AREA OR ANY OTHER AREAS. ALL ITEMS ON OUT DOOR REAR WALK-WAY MUST BE REMOVED FROM THE PREMISES TO PREVENT RODENT HARBORING.  EMPLOYEES MUST NOT STORE PERSONAL ITEMS, IE: BACK PACKS IN THE REAR DRY FOOD STORAGE SHELVING.",
      "latitude": "41.97317400978317",
      "longitude": "-87.65699233490793",
      "location": "(-87.65699233490794, 41.973174009783165)"
    },
    {
      "inspection_id": "2130020",
      "name": "PENINSULA CHICAGO, LLC",
      "aka_name": "SHANGHAI TERRACE",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "108 E SUPERIOR ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60611",
      "date": "01/05/2018",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: OBSERVED FOOD BUILD UP ON EXTERIOR OF GREASE TRAP. INSTRUCTED MANAGER TO CLEAN EXTERIOR OF GREASE TRAP AND MAINTAIN. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: OBSERVED FOOD DEBRIS/DIRT BUILD UP ON FLOOR ALONG WALLS/CORNERS IN PREP AREA. INSTRUCTED MANAGER TO DETAIL CLEAN FLOOR THROUGHOUT PREP AREA AND MAINTAIN.",
      "latitude": "41.89583963820686",
      "longitude": "-87.6249881413158",
      "location": "(-87.62498814131581, 41.89583963820686)"
    },
    {
      "inspection_id": "1948792",
      "name": "SKYWAY DOG HOUSE INC",
      "aka_name": "SKYWAY DOG HOUSE INC",
      "facility_type": "Restaurant",
      "risk": "Risk 2 (Medium)",
      "address": "9480 S EWING AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60617",
      "date": "08/04/2016",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: FLOORS NEED CLEANING THROUGHT OUT ALONG THE WALL BASE AND IN CORNERS ESPECIALLY BEHIND COOKING EQUIPMENT. MUST CLEAN TO REMOVE SPILLS,GREASE AND DEBRIS. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: NOTED THE WALLS,CEILING AND THE LIGHT SHEILDS DIRTY IN THE PREP AREA. MUST CLEAN TO REMOVE DEBRIS,DUST,FOOD SPLATTER AND GREASE. | 37. TOILET ROOM DOORS SELF CLOSING: DRESSING ROOMS WITH LOCKERS PROVIDED: COMPLETE SEPARATION FROM LIVING/SLEEPING QUARTERS - Comments: NOTED THE EMPLOYEE'S TOILET ROOM DOOR NOT SELF CLOSING. MUST PROVIDE A SELF CLOSING DEVICE. | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: NOTED LEAK AT THE 3 COMPARTMENT SINK FIXTURE. MUST REPAIR AND MAINTAIN.",
      "latitude": "41.72303512369261",
      "longitude": "-87.53679203497644",
      "location": "(-87.53679203497643, 41.72303512369261)"
    },
    {
      "inspection_id": "1583765",
      "name": "COLUMBIA YACHT CLUB",
      "aka_name": "COLUMBIA YACHT CLUB",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "111 N LAKE SHORE DR ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60601",
      "date": "11/03/2015",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: MUST PROVIDE ICE BIN COVERS IN GOOD REPAIRS FOR BOTH ICE BOX BINS LOCATED AT THE BAR ON THE 2ND FLOOR. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: MUST REPAIR/REPLACE EXTREMELY RUSTED FLOOR AT THE WALK-IN PRODUCE COOLER ON THE 1ST FLOOR SO AS TO BE SMOOTH AND EASILY CLEANABLE.",
      "latitude": "41.883065622637346",
      "longitude": "-87.61545613448831",
      "location": "(-87.61545613448831, 41.88306562263734)"
    },
    {
      "inspection_id": "409303",
      "name": "MISTA PIZZA",
      "aka_name": "MISTA PIZA",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "134 N LA SALLE ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60602",
      "date": "10/04/2010",
      "inspection_type": "License",
      "results": "Fail",
      "violations": "",
      "latitude": "41.88411126733353",
      "longitude": "-87.63257638523856",
      "location": "(-87.63257638523856, 41.88411126733353)"
    },
    {
      "inspection_id": "2321075",
      "name": "CHARLOTTE'S BAR AND GRILL",
      "aka_name": "CHARLOTTE'S BAR AND GRILL",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "6000 W GUNNISON ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60630",
      "date": "11/05/2019",
      "inspection_type": "Canvass",
      "results": "Pass w/ Conditions",
      "violations": "3. MANAGEMENT, FOOD EMPLOYEE AND CONDITIONAL EMPLOYEE; KNOWLEDGE, RESPONSIBILITIES AND REPORTING - Comments: OBSERVED NO EMPLOYEE HEALTH POLICY ON SITE.INSTRUCTED MANAGEMENT TO CREATE A EMPLOYEE HEALTH POLICY. PRIORITY FOUNDATION VIOLATION  7-38-010  NO CITATION ISSUED | 5. PROCEDURES FOR RESPONDING TO VOMITING AND DIARRHEAL EVENTS - Comments: OBSERVED NO CLEAN UP PROCEDURE/KIT ON  SITE.INSTRUCTED MANAGEMENT TO CREATE A CLEAN UP PROCEDURE/KIT. PRIORITY FOUNDATION VIOLATION 7-38-005  NO CITATION ISSUED | 25. CONSUMER ADVISORY PROVIDED FOR RAW/UNDERCOOKED FOOD - Comments: OBSERVED NO CONSUMER REMINDER ON THE MENU FOR MEATS.INSTRUCTED MANAGEMENT TO PUT REMINDER FOR CONSUMER ADVISORY AND DISCLOSURE AND REMINDER ON THE PAPER MENUS. PRIORITY FOUNDATION VIOLATION  7-38-005  NO CITATION ISSUED | 51. PLUMBING INSTALLED; PROPER BACKFLOW DEVICES - Comments: OBSERVED NO BACKFLOW DEVICE AT ICE MACHINE.INSTRUCTED MANAGEMENT TO INSTALL A BACKFLOW DEVICE AT ICE MACHINE OD FIND THE LOCATION OF BACKFLOW DEVICE IF CON TAINED IN THE ICE MACHINE. | 52. SEWAGE & WASTE WATER PROPERLY DISPOSED - Comments: OBSERVED NO GREASE TRAP FOR THREE COMPARTMENT SINK BEHIND THE FOOD PREP AREA.INSTRUCTED MANAGEMENT TO INSTALL A GREASE TRAP FOR THE THREE COMPARTMENT SINK.     | 53. TOILET FACILITIES: PROPERLY CONSTRUCTED, SUPPLIED, & CLEANED - Comments: OBSERVED SELF CLOSING DEVICE FOR EMPLOYEES RESTROOM NOT CLOSING.INSTRUCTED MANAGEMENT TO REPAIR DOOR SO IT CAN BE SELF CLOSING | 56. ADEQUATE VENTILATION & LIGHTING; DESIGNATED AREAS USED - Comments: OBSERVED BURN'T OUT LIGHT AND MISSING LIGHT SHIELD OVER HOT LINE IN KITCHEN.INSTRUCTED MANAGEMENT TO PROVIDE LIGHT SHIELD AND REPLACE BURN'T OUT LIGHT BULB. | 58. ALLERGEN TRAINING AS REQUIRED - Comments: OBSERVED NO ALLERGEN CERTIFICATION ON PREMISIS INSTRUCTED MANAGEMENT TO BECOME ALLERGEN CERTIFIED.",
      "latitude": "41.96864190649567",
      "longitude": "-87.77830163616821",
      "location": "(-87.77830163616822, 41.96864190649567)"
    },
    {
      "inspection_id": "1235538",
      "name": "MACARONI GRILL",
      "aka_name": "MACARONI GRILL (T3-K2)",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "11601 W TOUHY AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60666",
      "date": "11/27/2012",
      "inspection_type": "Short Form Complaint",
      "results": "Pass",
      "violations": "33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: INSTRUCTED TO DETAIL CLEAN AND MAINTAIN FOOD CARTS, INTERIOR SURFACES OF BREAD WARMER, INTERIOR AND EXTERIOR SURFACES OF 3 COMPARTMENT BAR SINK BEHIND BAR, AND INTERIOR SURFACES OF PREP SHELVES",
      "latitude": "42.008536400868735",
      "longitude": "-87.91442843927048",
      "location": "(-87.91442843927047, 42.008536400868735)"
    },
    {
      "inspection_id": "2370285",
      "name": "3JJJ'S BETTER TASTE JAMAICAN",
      "aka_name": "3JJJ'S BETTER TASTE JAMAICAN JERK RESTAURANT",
      "facility_type": "Mobile Food Dispenser",
      "risk": "Risk 3 (Low)",
      "address": "409 E 103RD ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60628",
      "date": "06/27/2017",
      "inspection_type": "Complaint",
      "results": "Pass w/ Conditions",
      "violations": "3. POTENTIALLY HAZARDOUS FOOD MEETS TEMPERATURE REQUIREMENT DURING STORAGE, PREPARATION DISPLAY AND SERVICE - Comments: Observed all hot foods at improper temperatures: 30lbs of chicken at 121.8f, 30lbs of rice at 125.2f, 15lbs of beans at 123.7f, 20lbs of cabbage at 119.5f, 10lbs of goat at 127.0f, 4.5lbs of tilapia at 125.4f, 10lbs of oxtail at 119.2f, 1lb of veggies (greens, carrots, cabbage) at 116.1f. Discarded and denatured said food valued at $1500 as stated by operator. Critical violation 7-38-005(a). ",
      "latitude": "41.70721220021213",
      "longitude": "-87.61336681197594",
      "location": "(-87.61336681197594, 41.707212200212126)"
    },
    {
      "inspection_id": "1515826",
      "name": "AMERICAN WILDBURGER",
      "aka_name": "AMERICAN WILDBURGER",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "1234 N HALSTED ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60642",
      "date": "01/13/2015",
      "inspection_type": "License",
      "results": "Pass",
      "violations": "37. TOILET ROOM DOORS SELF CLOSING: DRESSING ROOMS WITH LOCKERS PROVIDED: COMPLETE SEPARATION FROM LIVING/SLEEPING QUARTERS - Comments: MUST PROVIDE SELF-CLOSING DEVICES ON WASHROOM DOORS.",
      "latitude": "41.90450210717989",
      "longitude": "-87.64826686780405",
      "location": "(-87.64826686780404, 41.90450210717989)"
    },
    {
      "inspection_id": "1532998",
      "name": "COCORO",
      "aka_name": "COCORO",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "668 N WELLS ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60654",
      "date": "04/16/2015",
      "inspection_type": "Canvass",
      "results": "Pass w/ Conditions",
      "violations": "1. SOURCE SOUND CONDITION, NO SPOILAGE, FOODS PROPERLY LABELED, SHELLFISH TAGS IN PLACE - Comments: FOUND ONE CONTAINER WITH CLAMS INSIDE THE TWO DOOR REACH IN COOLER WITHOUT TAG ATTACHED TO THE CONTAINER. INSTRUCTED MANAGER THAT ALL SHELLFISH MUST HAVE A TAG ATTACHED TO THE CONTAINER DURING STORAGE INSIDE THE 2 DOOR REACH IN COOLER. THEN WHEN THE SHELLFISH ARE ALL CONSUMED,TAG MUST BE KEPT FOR THE NEXT 90 DAYS. CITATION ISSUED CRITICAL 7-38-005(B). MANAGER DISCARDED THE SAID PRODUCT WIORTH $17.95 TOTAL 3.2 DURING INSPECTION. | 32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: MUST RE CAULK AROUND THE EXPOSED HAND SINK IN THE PREP/KITCHEN AREA,(CAULK WORN OUT) AND MAINTAIN. | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: MUST CLEAN IN DETAIL INSIDE BOTTOM SHELVE OF THE REACH IN COOLER A ND REACH IN FREEZER(WITH FOOD CRUMBS) AND MAINTAIN. CLEAN IN DETAIL THE WOODEN SHELVE CLOSE TO THE EXPOSED HAND SINK IN THE KITCHEN AND MAINTAIN. MUST CLEAN AND SANITIZE UPPER PORTION INTERIOR PANEL OF THE ICE MAKER AND ALL CHOPPING BOARDS AND MAINTAIN. INSIDE THE CABINETS ON THE HALLWAY GOING TO THE KITCHEN NEEDS DETAIL CLEANING. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: FLOOR UNDER AND BEHIND THE COOKING STOVE, GRILL AND DEEP FRYER WITH ACCUMULATED DUST AND GREASE. MUST CLEAN IN DETAIL AND MAINTAIN. FLOOR UNDER THE SHELVINGS CLOSE TO THE STAIR GOING TO THE 2ND FLOOR WITH SYPUP AND DEBRIS. MUST CLEAN IN DETAIL AND MAINTAIN. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: VENT COVER IN BOTH WASHROOMS WITH DUST ACCUMULATED. MUST CLEAN AND MAINTAIN. | 36. LIGHTING: REQUIRED MINIMUM FOOT-CANDLES OF LIGHT PROVIDED, FIXTURES SHIELDED - Comments: MUST REPLACE BROKEN/CRACKED SOLID LIGHT SHIELD IN THE PREP AREA AND MAINTAIN. | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: MUST INSTALL FAUCET WITH HOT AND COLD RUNNING WATER UNDER CITY PRESURE ON THE MOP SINK. | 45. FOOD HANDLER REQUIREMENTS MET - Comments: NO FOOD HANDLER'S CERTIFICATE ON SITE. MUST PROVIDE ",
      "latitude": "41.89438888562674",
      "longitude": "-87.63428942310922",
      "location": "(-87.63428942310924, 41.89438888562674)"
    },
    {
      "inspection_id": "1965289",
      "name": "THE NEW 400",
      "aka_name": "THE NEW 400",
      "facility_type": "Other",
      "risk": "Risk 2 (Medium)",
      "address": "6746 N SHERIDAN RD ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60626",
      "date": "09/26/2016",
      "inspection_type": "Canvass Re-Inspection",
      "results": "Pass",
      "violations": "32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: OBSERVED RUST ON GREASE TRAP UNDER 3-COMP SINK BEHIND FRONT COUNTER. INSTRUCTED TO NOT STORE ITEMS ON TOP. REPAIR SO SURFACE IS SMOOTH AND EASILY CLEANABLE AND MAINTAIN.",
      "latitude": "42.00493637711607",
      "longitude": "-87.66101365071366",
      "location": "(-87.66101365071366, 42.00493637711607)"
    },
    {
      "inspection_id": "2370292",
      "name": "3 JJJ'S BETTER TASTE JAMAICAN JERK RESTAURANT",
      "aka_name": "3 JJJ'S BETTER TASTE JAMAICA",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "409 E 103RD ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60628",
      "date": "05/09/2014",
      "inspection_type": "License",
      "results": "Pass",
      "violations": "32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: REMOVE RUST FROM THE GREASE TRAP AT THE 3 COMPARTMENT SINK IN THE REAR PREP AREA | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: CLEAN THE FILTERS ABOVE STOVE,HAS SOME GREASE BUILD-UP IN THE FRONT PREP AREA | 36. LIGHTING: REQUIRED MINIMUM FOOT-CANDLES OF LIGHT PROVIDED, FIXTURES SHIELDED - Comments: MUST PROVIDE  LIGHT SHIELD COVERS AT FRONT AND REAR PREP AREAS,ALSO 1 LIGHT SHIELD COVER AND  BULB MISSING AT VENTILATION HOOD OVER STOVE,INSTRUCTED TO PROVIDE BULB AND COVER | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: MUST REPAIR THE VENTILATION IN BOTH WASHROOMS IN REAR OF PREMISES AND REMOVE DUST BUILD-UP",
      "latitude": "41.70721220021213",
      "longitude": "-87.61336681197594",
      "location": "(-87.61336681197594, 41.707212200212126)"
    },
    {
      "inspection_id": "2145326",
      "name": "AQUITAINE",
      "aka_name": "AQUITAINE",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "2221 N LINCOLN AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60614",
      "date": "02/22/2018",
      "inspection_type": "Canvass",
      "results": "Out of Business",
      "violations": "",
      "latitude": "41.9224779133742",
      "longitude": "-87.64439904705057",
      "location": "(-87.64439904705058, 41.922477913374195)"
    },
    {
      "inspection_id": "2116472",
      "name": "CICS LLOYD BOND",
      "aka_name": "CICS LLOYD BOND",
      "facility_type": "School",
      "risk": "Risk 2 (Medium)",
      "address": "13300 S LANGLEY ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60827",
      "date": "11/30/2017",
      "inspection_type": "Canvass",
      "results": "Out of Business",
      "violations": "",
      "latitude": "41.65363660026574",
      "longitude": "-87.60507067062305",
      "location": "(-87.60507067062306, 41.65363660026574)"
    },
    {
      "inspection_id": "2088505",
      "name": "TOCCO RESTAURANT",
      "aka_name": "TOCCO RESTAURANT",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "1266 N MILWAUKEE AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60622",
      "date": "09/12/2017",
      "inspection_type": "Canvass",
      "results": "No Entry",
      "violations": "",
      "latitude": "41.904689828481274",
      "longitude": "-87.66878127418673",
      "location": "(-87.66878127418673, 41.90468982848127)"
    },
    {
      "inspection_id": "2176856",
      "name": "THE GRILLROOM",
      "aka_name": "THE GRILLROOM",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "33 W MONROE ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60603",
      "date": "06/06/2018",
      "inspection_type": "Canvass",
      "results": "Fail",
      "violations": "2. FACILITIES TO MAINTAIN PROPER TEMPERATURE - Comments: OBSERVED 3 DOOR PREP COOLER, WITH POTENTIALLY HAZARDOUS FOODS INSIDE, NOT MAINTAINING THE ADEQUATE COLD HOLDING TEMPERATURE LOCATED ACROSS FROM THE COOKING EQUIPMENT. TEMPERATURE OF THE 3 DOOR PREP COOLER WAS 50F AT THE TIME OF THE INSPECTION. INSTRUCTED TO ALWAYS MAINTAIN ALL COLD HOLDING UNITS AT 40F OR BELOW AT ALL TIMES. SAID PREP COOLER TAGGED AND HELD FOR INSPECTION BY THE CHICAGO DEPARTMENT OF PUBLIC HEALTH. CRITICAL VIOLATION 7-38-005(A). | 3. POTENTIALLY HAZARDOUS FOOD MEETS TEMPERATURE REQUIREMENT DURING STORAGE, PREPARATION DISPLAY AND SERVICE - Comments: OBSERVED POTENTIALLY HAZARDOUS FOODS AT IMPROPER COLD HOLDING TEMPERATURES LOCATED IN THE 3 DOOR PREP COOLER; 1 LB OF SLICED TOMATOES AND CHOPPED LETTUCE AT 59F, 3 LBS OF COOKED POTATOES AT 53F, 2 LBS OF GUACAMOLE AT 53F, 1 LB OF MAYO AT 73.4F, AND 1/2 LB OF RANCH DRESSING AT 60F. INSTRUCTED MANAGER TO DISCARD AND DENATURE SAID POTENTIALLY HAZARDOUS FOODS AND TO ALWAYS MAINTAIN ALL COLD HOLDING POTENTIALLY HAZARDOUS FOODS AT 40F OR BELOW AT ALL TIMES. CRITICAL VIOLATION 7-38-005(A). | 10. SEWAGE AND WASTE WATER DISPOSAL, NO BACK SIPHONAGE, CROSS  CONNECTION AND/OR BACK FLOW - Comments: OBSERVED BAR 3 COMPARTMENT SINK BACK FLOWING FROM THE FLOOR DRAIN WHEN THE COMPARTMENTS ARE DRAINED. INSTRUCTED TO REPAIR BAR 3 COMPARTMENT SINK SO THAT IT WILL NEVER BACK FLOW WHEN COMPARTMENTS ARE DRAINED. EMPLOYEE REMOVE PAPER THAT WAS CLOGGING THE FLOOR DRAIN AND BY THE END OF THE INSPECTION SAID 3 COMPARTMENT SINK WAS ABLE TO DRAIN PROPERLY. CRITICAL VIOLATION 7-38-030. | 13. NO EVIDENCE OF RODENT OR INSECT INFESTATION, NO BIRDS, TURTLES OR OTHER ANIMALS - Comments: OBSERVED ABOUT 100 LIVE SMALL FLIES ON THE WALLS AND CEILINGS OF THE FOOD PREP AREA AND OVER 50 LIVE ROACHES LOCATED IN THE DISH MACHINE AND 3 COMPARTMENT SINK AREAS. INSTRUCTED TO CLEAN AND SANITIZE AFFECTED AREAS AND RECOMMENDED CONTACTING PEST CONTROL FOR SERVICE. CRITICAL VIOLATION 7-38-020. | 30. FOOD IN ORIGINAL CONTAINER, PROPERLY LABELED: CUSTOMER ADVISORY POSTED AS NEEDED - Comments: OBSERVED POTENTIALLY HAZARDOUS FOODS, INSIDE OF ALL OF THE PREP COOLERS AND IN THE WALK IN COOLER, OUT OF THE ORIGINAL PACKAGING AND HELD FOR OVER 24 HOURS WITHOUT PROPER LABELS CONTAINING PRODUCT NAME AND DATE. INSTRUCTED TO PROVIDE.  | 31. CLEAN MULTI-USE UTENSILS AND SINGLE SERVICE ARTICLES PROPERLY STORED: NO REUSE OF SINGLE SERVICE ARTICLES - Comments: OBSERVED DINING ROOM TABLES BEING PRE-SET WITH UNCOVERED UTENSILS AND GLASSWARE NOT INVERTED. INSTRUCTED NOT TO PRE-SET DINING ROOM TABLES OR SET UPON CUSTOMER ARRIVAL OR COVER ALL UTENSILS AND INVERT ALL GLASSWARE AND MAINTAIN. | 32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: OBSERVED NO PREP COOLER TOPS FOR THE TOP OF THE PREP COOLER LOCATED ACROSS FROM THE COOKING EQUIPMENT. AT THE TIME OF THE INSPECTION SHEET PANS WERE BEING USED TO COVER TOP PREP COOLER. INSTRUCTED TO REPAIR AND MAINTAIN. | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: OBSERVED THE INTERIOR OF THE ICE MACHINE WITH A SLITE BROWNISH SUBSTANCE LOCATED BY THE ICE MAKER. OBSERVED INTERIOR OF THE FRYERS AND COOKING EQUIPMENT WITH EXCESSIVE ACCUMULATED GREASE, FOOD AND DIRT DEBRIS. OBSERVED ALL UTENSIL SHELVES AND KNIFE RACK WITH ACCUMULATED DUST DEBRIS. INSTRUCTED TO CLEAN ALL AND MAINTAIN. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: OBSERVED FLOORS THRU OUT DISH WASHING AREA NEED TO BE RE-GROUTED. INSTRUCTED TO REPAIR. OBSERVED STANDING WATER UNDER THE BAR'S 3 COMPARTMENT SINK AND UNDER THE DISH MACHINE. INSTRUCTED TO REMOVE ALL STANDING WATER AND MAINTAIN. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: OBSERVED MISSING WALL TILES UNDER THE REAR 3 COMPARTMENT SINK AND DISH MACHINE AREA AND MISSING CEILING TILES THRU OUT THE REAR OF THE FOOD PREP AREA. OBSERVED A LARGE HOLE IN THE WALL LOCATED BEHIND THE 2 DOOR REFRIGERATOR AND A HOLE IN THE WALL LOCATED UNDER THE DISH MACHINE. OBSERVED CRACK AND CREVICES LOCATED AROUND THE GREASE TRAP UNDER THE DISH MACHINE. INSTRUCTED TO REPAIR ALL SAID AREAS AND MAINTAIN AND TO SEAL ALL CRACKS AND CREVICE THRU OUT FOOD PREP AND DISH WASHING AREAS AND MAINTAIN. OBSERVED A BLACK SUBSTANCE ON THE WALL LOCATED BY THE 3 DISH MACHINE. INSTRUCTED TO CLEAN. | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: OBSERVED A HEAVY FRESH WATER LEAK ON A PIPE LOCATED UNDER THE DISH MACHINE AND A LEAK UNDER THE EXPOSED HAND SINK LOCATED BEHIND THE BAR. INSTRUCTED TO REPAIR ALL AND MAINTAIN. | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: OBSERVED GLASS STORAGE RACKS BEING STORED ON THE FLOOR IN THE DISH MACHINE AREA. INSTRUCTED TO ELEVATE ALL ITEMS AT LEAST 6 INCHES ABOVE THE GROUND AND MAINTAIN.",
      "latitude": "41.88061600574007",
      "longitude": "-87.62904942471994",
      "location": "(-87.62904942471995, 41.880616005740066)"
    },
    {
      "inspection_id": "419635",
      "name": "EL VIGIA RESTAURANT",
      "aka_name": "EL VIGIA RESTAURANT",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "4124 W ARMITAGE AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60639",
      "date": "10/20/2010",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: All food and non-food contact equipment and utensils shall be smooth, easily cleanable, and durable, and shall be in good repair.    NOTED PLASTIC BAG USED FOR STORING COOKED RICE ON STEAM TABLE. INSTRUCTED TO REMOVE THE SAID BAG AND USE FOOD GRADE CONTAINER PREFERABLY METAL PAN WITH COVER. | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: All food and non-food contact surfaces of equipment and all food storage utensils shall be thoroughly cleaned and sanitized daily.    INSTRUCTED TO CLEAN AND MAINTAIN SHELF UNDER STEAM TABLE WITH DRIED FOOD AND GREASE DEBRIS IN THE KITCHEN AND STORAGE SHELVES BEHIND FRONT SERVICE COUNTER. | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: Ventilation: All plumbing fixtures, such as toilets, sinks, washbasins, etc., must be adequately trapped, vented, and re-vented and properly connected to the sewer in accordance with the plumbing chapter of the Municipal Code of Chicago and the Rules and Regulations of the Board of Health.    INSTRUCTED TO PROVIDE WORKING DRAIN STOPPERS AT 3 COMPARTMENT SINK BEHIND FRONT SERVICE COUNTER. | 40. REFRIGERATION AND METAL STEM THERMOMETERS PROVIDED AND CONSPICUOUS - Comments: All food establishments that display, prepare, or store potentially hazardous foods shall have calibrated metal stem thermometers, provided and conspicuous, for refrigerated and hot food units.    INSTRUCTED TO PROVIDE THERMOMETER VISIBLE INSIDE HOT HOLDING DISPLAY UNIT IN FRONT AREA. ",
      "latitude": "41.91723056775045",
      "longitude": "-87.73007883695215",
      "location": "(-87.73007883695216, 41.91723056775045)"
    },
    {
      "inspection_id": "1138981",
      "name": "ALOFT HOTEL CHICAGO CITY CENTER",
      "aka_name": "ALOFT",
      "facility_type": "Restaurant",
      "risk": "Risk 3 (Low)",
      "address": "515 N CLARK ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60654",
      "date": "06/04/2013",
      "inspection_type": "License",
      "results": "Pass",
      "violations": "",
      "latitude": "41.891371598247204",
      "longitude": "-87.630972449199",
      "location": "(-87.63097244919902, 41.891371598247204)"
    },
    {
      "inspection_id": "1447419",
      "name": "PRET-A-MANGER",
      "aka_name": "PRET A MANAGER",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "120 S RIVERSIDE PLZ ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60606",
      "date": "08/13/2014",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: CLEAN FLOORS IN THE FOLLOWING AREAS; AT REAR ALONG WALLBASE AT CORNERS, EMPLOYEE BREAKROOM AND STORAGE CLOSET AT REAR. | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: CLEAN, REMOVE CLUTTER,ORGANIZE AND MAINTAIN AT ALL TIMES, EMPLOYEE BREAK ROOM AND STORAGE ROOM AT REAR.",
      "latitude": "41.8799233059124",
      "longitude": "-87.63880253891777",
      "location": "(-87.63880253891776, 41.8799233059124)"
    },
    {
      "inspection_id": "2303530",
      "name": "BETEUR 1 CHILDCARE",
      "aka_name": "BETEUR 1 CHILDCARE",
      "facility_type": "Daycare (2 - 6 Years)",
      "risk": "Risk 1 (High)",
      "address": "7045 S HALSTED ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60621",
      "date": "07/23/2019",
      "inspection_type": "Canvass Re-Inspection",
      "results": "Pass w/ Conditions",
      "violations": "2. CITY OF CHICAGO FOOD SERVICE SANITATION CERTIFICATE - Comments: PERSON IN CHARGE DOES NOT HAVE A CITY OF CHICAGO FOOD SERVICE MANAGER CERTIFICATE. INSTRUCTED TO OBTAIN AND MAINTAIN. PRIORITY FOUNDATION 7-38-012",
      "latitude": "41.76568914272864",
      "longitude": "-87.64427943294706",
      "location": "(-87.64427943294706, 41.76568914272864)"
    },
    {
      "inspection_id": "2370286",
      "name": "CHICAGO'S HOME OF CHICKEN & WAFFLES",
      "aka_name": "CHICAGO'S HOME OF CHICKEN & WAFFLES",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "3947 S DR MARTIN LUTHER KING JR DR ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60653",
      "date": "04/24/2013",
      "inspection_type": "Canvass Re-Inspection",
      "results": "Pass w/ Conditions",
      "violations": "8. SANITIZING RINSE FOR EQUIPMENT AND UTENSILS:  CLEAN, PROPER TEMPERATURE, CONCENTRATION, EXPOSURE TIME - Comments: OBSERVED EMPLOYEE RINSING MULTI USE UTENSILS WITH SPRAYER THEN TAKING TO SERVERS FOR USE TO CUSTUMERS WITHOUT USING SOAP OR SANITIZER.  INSTRUCTED MANAGER TO WASH, RINSE AND SANITIZE AT THE 3 COMPARTMENT SINK.     CRITICAL VIOLATION 7-38-030 CITATION ISSUED  IMPROPER SANITIZING OF MULTI USE UTENSILS     | 32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: NEW CUTTING BOARD NEEDED AT REACH IN PREP COOLER. MUST REPLACE AND MAINTAIN AT ALL TIMES.    | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: FLOORS THROUGH OUT PREP AREA, DISH AREA AND WAIT STATION IN NEED OF DETAIL CLEANING TO REMOVE ALL BUILD UP UNDER AND AROUND ALL EQUIPMENT. FLOORS IN REAR DISH AREA AND PREP AREA REMOVE FOOD BUILD UP FROM MISSING GROUT AREAS AND REGROUT. MUST CLEAN, CORRECT AND MAINTAIN AT ALL TIMES  | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: WALLS WITH BROKEN TILES AND FOOD SPLATTER. MUST REPLACE BROKEN TILES AND REMOVE FOOD SPLATTER. MAINTAIN AT ALL TIMES.    | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: LEAK AT COKE MACHINE. MUST REPAIR AND MAINTAIN AT ALL TIMES.   ",
      "latitude": "41.82254785730014",
      "longitude": "-87.61681561837467",
      "location": "(-87.61681561837467, 41.82254785730014)"
    },
    {
      "inspection_id": "284574",
      "name": "SEE THRU CHINESE KITCHEN",
      "aka_name": "SEE THRU CHINESE KITCHEN",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "5656 W ROOSEVELT RD ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60644",
      "date": "08/19/2010",
      "inspection_type": "Complaint",
      "results": "Pass",
      "violations": "33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: All food and non-food contact surfaces of equipment and all food storage utensils shall be thoroughly cleaned and sanitized daily.    MUST CLEAN EXTERIOR SURFACES OF ALL BULK STORAGE CONTAINERS, VENTS ABOVE COOKING EQUIPMENT AND TOPS, SIDES INTERIOR OF ALL COOKING EQUIPMENT | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: The floors shall be constructed per code, be smooth and easily cleaned, and be kept clean and in good repair.     MUST CLEAN FLOORS UNDER AND BEHIND ALL EQUIPMENT IN KITCHEN AREA   | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: All parts of the food establishment and all parts of the property used in connection with the operation of the establishment shall be kept neat and clean and should not produce any offensive odors.    MUST REMOVE ALL CLUTTER FROM BOTTOM OF COUNTER TABLE AREA, CLEAN AND BETTER ORGANIZE",
      "latitude": "41.86567514236451",
      "longitude": "-87.76662584667757",
      "location": "(-87.76662584667756, 41.86567514236451)"
    },
    {
      "inspection_id": "1383364",
      "name": "TACO BURRITO KING INC.",
      "aka_name": "TACO BURRITO KING INC.",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "811 W JACKSON BLVD ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60607",
      "date": "01/15/2014",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "30. FOOD IN ORIGINAL CONTAINER, PROPERLY LABELED: CUSTOMER ADVISORY POSTED AS NEEDED - Comments: MUST PROPERLY LABEL ALL BULK FOOD ITEM CONTAINERS. | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: DETAIL CLEAN THE INTERIOR OF THE ICE MACHINE.  | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: MUST REPAIR LEAKY FAUCET AT THE THREE COMPARTMENT SINK AND REMOVE TOWEL. | 43. FOOD (ICE) DISPENSING UTENSILS, WASH CLOTHS PROPERLY STORED - Comments: MUST PROVIDE A SANITARY CONTAINER TO PROPERLTY STORE ALL ICE DISPENSING UTENSILS.",
      "latitude": "41.87783013580039",
      "longitude": "-87.64773606109019",
      "location": "(-87.64773606109019, 41.87783013580039)"
    },
    {
      "inspection_id": "1578521",
      "name": "SKYWAY DOG HOUSE INC",
      "aka_name": "SKYWAY DOG HOUSE INC",
      "facility_type": "Restaurant",
      "risk": "Risk 2 (Medium)",
      "address": "9480 S EWING AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60617",
      "date": "10/02/2015",
      "inspection_type": "Canvass Re-Inspection",
      "results": "Pass",
      "violations": "",
      "latitude": "41.72303512369261",
      "longitude": "-87.53679203497644",
      "location": "(-87.53679203497643, 41.72303512369261)"
    },
    {
      "inspection_id": "569280",
      "name": "ELYSIAN HOTEL CHICAGO",
      "aka_name": "ELYSIAN HOTEL CHICAGO",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "11 E WALTON ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60611",
      "date": "04/21/2011",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: FLOORS & DRAINS IN DISHROOM, ESPECIALLY AROUND CORNERS OF EQUIPMENT MUST BE KEPT CLEAN.   The floors shall be constructed per code, be smooth and easily cleaned, and be kept clean and in good repair. | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: ANY MILK CRATES USED FOR STORAGE RACKS MUST BE REPLACED FOR EASY ACCESS TO CLEANING/PEST MONITORING.   All parts of the food establishment and all parts of the property used in connection with the operation of the establishment shall be kept neat and clean and should not produce any offensive odors.",
      "latitude": "41.89983492074242",
      "longitude": "-87.6277991723728",
      "location": "(-87.6277991723728, 41.89983492074242)"
    },
    {
      "inspection_id": "1493400",
      "name": "FIESOLE RESTAURANT",
      "aka_name": "",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "111 E CHESTNUT ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60611",
      "date": "08/07/2014",
      "inspection_type": "License",
      "results": "Pass",
      "violations": "",
      "latitude": "41.89826161908875",
      "longitude": "-87.62516469194004",
      "location": "(-87.62516469194003, 41.89826161908875)"
    },
    {
      "inspection_id": "491668",
      "name": "7 - ELEVEN",
      "aka_name": "7-ELEVEN",
      "facility_type": "Grocery Store",
      "risk": "Risk 2 (Medium)",
      "address": "6801 N WESTERN AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60645",
      "date": "02/09/2011",
      "inspection_type": "Canvass Re-Inspection",
      "results": "Pass",
      "violations": "34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: #34 violation remains to be corrected on 2/1/12 | 36. LIGHTING: REQUIRED MINIMUM FOOT-CANDLES OF LIGHT PROVIDED, FIXTURES SHIELDED - Comments: #36 violation remains to be corrected by 2/1/12",
      "latitude": "42.00508007390452",
      "longitude": "-87.6899247445087",
      "location": "(-87.6899247445087, 42.005080073904516)"
    },
    {
      "inspection_id": "1931512",
      "name": "SALSA  PICANTE",
      "aka_name": "SALSA PICANTE",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "949 N WESTERN AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60622",
      "date": "05/24/2016",
      "inspection_type": "Canvass",
      "results": "Fail",
      "violations": "6. HANDS WASHED AND CLEANED, GOOD HYGIENIC PRACTICES; NO BARE HAND CONTACT WITH READY-TO-EAT FOODS. - Comments: POOR HYGIENIC PRACTICES.OBSERVED EMPLOYEES HANDLING NOT FOOD SURFACES FROM WIPING COUNTER, STORE FOOD(RAW AND COOKED)AWAY,MOVING GARBAGE CONTAINERS,WASHING,RINSING AND STORE CLEAN DISHES. MAKING READY TO EAT FOOD(TACOS)WITHOUT HAND WASHING,JUST GLOVING THEIR HANDS. MUST WASH HANDS PRIOR TO GLOVE HANDS.MUST WASH HANDS EVERY POSSIBLE CONTAMINATION. MANAGER CORRECTED PROBLEM DURING INSPECTION.  CRITICAL VIOLATION:7-38-010(A) | 18. NO EVIDENCE OF RODENT OR INSECT OUTER OPENINGS PROTECTED/RODENT PROOFED, A WRITTEN LOG SHALL BE MAINTAINED AVAILABLE TO THE INSPECTORS - Comments: OBSERVED 30 OR MORE RAT DROPPINGS IN THE BASEMENT AREA WERE MOP SINK IS INSTALLED. INSTRUCTED TO REMOVE DROPPINGS,REMOVE ALL UNUSED EQUIPMENTS,INCLUDED REACH-IN COOLER,STOVE, ETC. SEAL ANY HOLES IF NEEDED AND CONTACT PEST CONTROL COMPANY.  SERIOUS VIOLATION:7-38-020 | 32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments:  BROKEN RUBBER GASKET INSIDE THE  DOOR OF REACH-IN COOLER",
      "latitude": "41.89902106934802",
      "longitude": "-87.6867792752013",
      "location": "(-87.68677927520129, 41.899021069348024)"
    },
    {
      "inspection_id": "577670",
      "name": "WENDY'S",
      "aka_name": "WENDY'S",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "7601 S CICERO AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60652",
      "date": "11/03/2011",
      "inspection_type": "Short Form Complaint",
      "results": "Pass",
      "violations": "33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: THE FOLLOWING IN NEED OF CLEANING: ALL COOKING EQUIPMENT, STORAGE SHELVES, PREP TABLES, FRYERS, INTERIOR OF FRYERS TO ELIMAINATE ALL BUILD UP. MUST CLEAN AND MAINTAIN AT ALL TIMES.    | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: FLOORS THROUGHOUT ENTIRE PREP AREA IN NEED OF REGROUTING. LARGE AMOUNTS OF BUILD-UP ENCRUSTED IN TILES. MUST CLEAN AND MAINTAIN AT ALL TIMES. COVING IN NEED OF REPAIR AT DOOR AREA.    | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: WALLS IN NEED OF DETAIL CLEANING TO REMOVE ALL FOOD SPLATTERS. CEILING IN NEED OF CLEANING TO REMOVE DUST AND SPLATTER. EXPOSED DRY WALL IN NEED OF REPAIR IN DRY STORAGE AGEA. MUST CORRECT AND MAINTAIN AT ALL TIMES.    | 36. LIGHTING: REQUIRED MINIMUM FOOT-CANDLES OF LIGHT PROVIDED, FIXTURES SHIELDED - Comments: LIGHT SHEILD NEED IN WALK IN COOLER. MUST INSTALL AND MAINTAIN AT ALL TIMES.    | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: FLOOR DRAIN AT 3 COMPARTMENT SINK IN NEED OF CLEANING TO REMOVE ALL BUILD UP. MUST CLEAN AND MAINTAIN AT ALL TIMES.    | 42. APPROPRIATE METHOD OF HANDLING OF FOOD (ICE) HAIR RESTRAINTS AND CLEAN APPAREL WORN - Comments: All employees shall be required to use effective hair restraints to confine hair.    ALL FOOD HANDLERS MUST WEAR AND HAVE HAIR RESTRAINED.  MUST CORRECT AND MAINTAINAT ALL TIMES.  ",
      "latitude": "41.754660124393745",
      "longitude": "-87.7413847586052",
      "location": "(-87.74138475860521, 41.75466012439374)"
    },
    {
      "inspection_id": "2166833",
      "name": "Webster, Hansberry",
      "aka_name": "DANIEL WEBSTER ELEMENTARY/LORRAINE HANSBERRY CPC",
      "facility_type": "School",
      "risk": "Risk 1 (High)",
      "address": "4055 W Arthington  (900S) ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60624",
      "date": "04/27/2018",
      "inspection_type": "Canvass",
      "results": "Fail",
      "violations": "19. OUTSIDE GARBAGE WASTE GREASE AND STORAGE AREA; CLEAN, RODENT PROOF, ALL CONTAINERS COVERED - Comments: OBSERVED AN EXCESSIVE AMOUNT OF TRASH AND GARBAGE BEHIND THE GARBAGE DUMPSTER CORRAL.  MANAGEMENT INSTRUCTED TO CLEAN AND MAINTAIN THE OUTSIDE GARBAGE DUMPSTER AREA AT ALL TIMES.  SERIOUS VIOLATION 7-38-020.",
      "latitude": "41.869889038226546",
      "longitude": "-87.72748158769552",
      "location": "(-87.72748158769552, 41.86988903822655)"
    },
    {
      "inspection_id": "1375901",
      "name": "CAOBA",
      "aka_name": "RIPASSO",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "1619 N DAMEN AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60647",
      "date": "12/06/2013",
      "inspection_type": "Canvass",
      "results": "Out of Business",
      "violations": "",
      "latitude": "41.91103747031633",
      "longitude": "-87.67732921269013",
      "location": "(-87.67732921269013, 41.91103747031633)"
    },
    {
      "inspection_id": "1989714",
      "name": "Kelvyn Park  (H/S)",
      "aka_name": "Kelvyn Park High School",
      "facility_type": "School",
      "risk": "Risk 1 (High)",
      "address": "4343 W Wrightwood ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60639",
      "date": "02/24/2017",
      "inspection_type": "Canvass Re-Inspection",
      "results": "Pass",
      "violations": "",
      "latitude": "41.92789092002339",
      "longitude": "-87.73600171432709",
      "location": "(-87.7360017143271, 41.927890920023394)"
    },
    {
      "inspection_id": "1353612",
      "name": "CHESTER'S FOOD DELI, INC.",
      "aka_name": "CHESTER'S FOOD DELI, INC.",
      "facility_type": "",
      "risk": "Risk 3 (Low)",
      "address": "4410 N MILWAUKEE AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60630",
      "date": "07/11/2013",
      "inspection_type": "Canvass",
      "results": "Out of Business",
      "violations": "",
      "latitude": "41.96088949112328",
      "longitude": "-87.75487389098811",
      "location": "(-87.75487389098811, 41.960889491123275)"
    },
    {
      "inspection_id": "1454151",
      "name": "HOOSIER MAMA PIE COMPANY",
      "aka_name": "HOOSIER MAMA PIE COMPANY",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "1618 1/2 W CHICAGO AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60622",
      "date": "09/01/2015",
      "inspection_type": "Canvass",
      "results": "Fail",
      "violations": "16. FOOD PROTECTED DURING STORAGE, PREPARATION, DISPLAY, SERVICE AND TRANSPORTATION - Comments: FRONT DISPLAY OF PIES IS OPEN AND EXPOSED TO THE ELEMENTS, AIR, DUST , PEOPLE, FLIES, ETC...  INSTRUCTED MANAGER TO PROVIDE COVER OR CLOSED DISPLAY CASE TO ELIMINATE ANY CONTAMINATION.    SERIOUS VIOLATION 7-38-005(A) | 18. NO EVIDENCE OF RODENT OR INSECT OUTER OPENINGS PROTECTED/RODENT PROOFED, A WRITTEN LOG SHALL BE MAINTAINED AVAILABLE TO THE INSPECTORS - Comments: OBSERVED 20-22 HOUSE FLIES IN PREP AND DINING AREA.   MANAGER TO CONTACT PEST CONTROL FOR SERVICE.  REAR SCREEN DOOR NOT INSECT PROOFED AT THIS TIME. SCREEN IS IN POOR REPAIR ALLOWING FLIES TO ENTER.  INSTRUCTED TO CONTACT PEST CONTROL FOR SERVICE AND CORRECT DOOR.    SERIOUS VIOLATION 7-38-020 | 19. OUTSIDE GARBAGE WASTE GREASE AND STORAGE AREA; CLEAN, RODENT PROOF, ALL CONTAINERS COVERED - Comments: OUTSIDE GARBAGE AREA NOT MAINTAINED. CONTAINER OPEN AND EXPOSED.  INSTRUCTED MANAGER TO KEEP CONTAINERS CLOSED AND INCREASE PICK UP SERVICE OR PROVIDE LARGER CONTAINER.  MUST CORRECT AND MAINTAIN AT ALL TIMES.    SERIOUS VIOLATION 7-38-020   | 29. PREVIOUS MINOR VIOLATION(S) CORRECTED 7-42-090 - Comments: PREVIOUS MINOR VIOLATIONS NOT CORRECTED FROM OCTOBER 24, 2014 REPORT #1498158 INSPECTOR 386. VIOLATION #34 CLEAN FLOORS UNDER ALL EQUIPMENT, ALONG WALLS AND IN ALL CORNERS IN PREP AND DISH WASHING AREAS. REPLACE DAMAGED FLOOR TILES IN ALL AREAS. FLOORS MUST BE SMOOTH AND EASILY CLEANABLE, #35 REPAIR REAR SCREEN DOOR, #36 PROVIDE LIGHT SHIELD INSIDE FRONT DISPLAY CASE, #41 REMOVE CRATES OUTSIDE REAR DOOR TO PREVENT PEST HARBORAGE.  ALL VIOLATIONS MUST BE CORRECTED AND MAINTAINED.    SERIOUS VIOLATION 7-42-090   | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: HOLE IN FLOOR IN BASEMENT IN NEED OF SEALING.  MUST CORRECT AND MAINTAIN AT ALL TIMES.   | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: HAND SINK SLOW DRAINING.  MUST CORRECT AND MAINTAIN AT ALL TIMES.  ",
      "latitude": "41.896169719571645",
      "longitude": "-87.66811804958151",
      "location": "(-87.66811804958152, 41.89616971957165)"
    },
    {
      "inspection_id": "1098573",
      "name": "RUDY'S BAKERY",
      "aka_name": "RUDY'S BAKERY",
      "facility_type": "Bakery",
      "risk": "Risk 2 (Medium)",
      "address": "2038 W ROSCOE ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60618",
      "date": "09/06/2012",
      "inspection_type": "Canvass",
      "results": "Fail",
      "violations": "11. ADEQUATE NUMBER, CONVENIENT, ACCESSIBLE, DESIGNED, AND MAINTAINED - Comments: EXPOSED HAND WASHING SINK AT MAIN PRODUCTION/PREP AREA NOT ACCESSIBLE FOR PROPER HAND WASHING. OBSERVED A LARGE GARBAGE CONTAINER IN FRONT OF SINK; ALSO NOTED SOME SMALL MULTI-USE UTENSILS INSIDE THE SINK, (SPOONS, FOLKS, SOILED TOWELS, ETC.)AND EXCESSIVE DRIED DEBRIS INSIDE THE SINK.  INSTRUCTED, EXPOSED SINK MUST BE ACCESSIBLE FOR PROPER HAND WASHING.  CRITICAL CITATION ISSUED, 7-38-030. | 18. NO EVIDENCE OF RODENT OR INSECT OUTER OPENINGS PROTECTED/RODENT PROOFED, A WRITTEN LOG SHALL BE MAINTAINED AVAILABLE TO THE INSPECTORS - Comments: OBSERVED EVIDENCE OF INSECTS/FRUIT FLIES.  OVER 15 FRUIT FLIES ON TOP AND INSIDE A BOX OF BANANAS AND SOME ON UNUSED EQUIPMENT AT REAR OF PRODUCTION AREA.  INSTRUCTED TO REMOVE SPOILED BANANAS AND THE BOX, CLEAN AND SANITIZE EQUIPMENT AND THRU-OUT THE AREA.  ADVICED TO CALL PEST CONTROL FOR SERVICE.  SERIOUS CITATION ISSUED, 7-38-020. | 30. FOOD IN ORIGINAL CONTAINER, PROPERLY LABELED: CUSTOMER ADVISORY POSTED AS NEEDED - Comments: DRIED FOOD STORAGE CONTAINERS AT MAIN PRODUCTION AREA NOT LABELED, INSTRUCTED TO LABEL AND MAINTAIN. | 31. CLEAN MULTI-USE UTENSILS AND SINGLE SERVICE ARTICLES PROPERLY STORED: NO REUSE OF SINGLE SERVICE ARTICLES - Comments: INSTRUCTED, CLEAN MULTI-USE UTENSILS MUST BE PROPERLY STORED ON STORAGE SHELVES. | 32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: MUST REPLACE BROKEN GASKETS ON TWO PREP REACH IN COOLERS DOORS. | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: THE FOLLOWING NOT CLEAN, INSTRUCTED TO CLEAN/SANITIZE; COOLERS, HOLDING BOXES, COOKING/BAKING EQUIPMENT, STORAGE CARTS, DRIED FOOD STORAGE CONTAINERS, SINKS, AND TOILET BOWL. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: INSTRUCTED TO REPLACE MISSING AND BROKEN FLOOR TILES AT FRONT SERVING AREA AND CLEAN FLOORS THRU-OUT PREMISES, UNDER, BEHIND, BETWEEN EQUIPMENT AT CORNERS AND ALONG WALLS, INCLUDING THRU-OUT THE BASEMENT. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: MUST REPAIR AND CLEAN OR REPAINT WALLS AT MAIN PRODUCTION/PREP AREA, SEAL OPENINGS/GAPS AT WALL JUNCTION AND AROUND PIPES TO PREVENT PEST ENTRY.  ALSO MUST REPLACE MISSING AND DAMAGED CEILING PANELS THRU-OUT PREMISES.  | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: INSTRUCTED TO REPAIR LEAKING PIPES UNDER BOTH EXPOSED SINKS, AND PROVIDE VENTILATION FOR ONE BURNER AT REAR PRODUCTION AREA. | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: EXCESSIVE CLUTTER THRU-OUT PREP AREAS, REAR STORAGE ROOM AND BASEMENT.  INSTRUCTED TO REMOVE UNNECESSARY ARTICLES/OLD EQUIPMENT, CLEAN AND ORGANIZE TO PREVENT PEST HARBORAGE.  ARTICLES MUST BE STORED OFF FLOORS, AWAY FROM WALLS. | 43. FOOD (ICE) DISPENSING UTENSILS, WASH CLOTHS PROPERLY STORED - Comments: INSTRUCTED, CLEANING TOWELS MUST BE PROPERLY STORED.",
      "latitude": "41.94330913452692",
      "longitude": "-87.67997511525247",
      "location": "(-87.67997511525247, 41.94330913452692)"
    },
    {
      "inspection_id": "1981472",
      "name": "TACO EL JALICIENSE",
      "aka_name": "TACO EL JALICIENSE",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "2859 W CHICAGO AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60622",
      "date": "01/13/2017",
      "inspection_type": "Canvass",
      "results": "Pass w/ Conditions",
      "violations": "6. HANDS WASHED AND CLEANED, GOOD HYGIENIC PRACTICES; NO BARE HAND CONTACT WITH READY-TO-EAT FOODS. - Comments: POOR HYGIENIC PRACTICES OBSERVED ON PREMISES: OBSERVED BARE HAND CONTACT WITH READY TO EAT FOOD IN THE KITCHEN. FOOD HANDLER WAS PREPARING TACOS, TORTAS AND BURRITOS WITH BARE HANDS AFTER THE TORTILLAS WERE REMOVED FROM THE GRILL AND BEING PREPARED TO SERVE. INSTRUCTED STAFF MEMBERS THAT BARE HAND CONTACT WITH READY TO EAT FOOD IS PROHIBITED AT ALL TIMES. EMPLOYEES MUST WASH HANDS BEFORE APPLYING A NEW PAIR OF GLOVES. CRITICAL VIOLATION 7-38-010 | 32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: OBSERVED MEAT STORED DIRECTLY IN GROCERY BAGS IN THE REACH-IN FREEZER. INSTRUCTED TO USE FOOD GRADE STORAGE BAGS TO PROPERLY STORE MEATS AT ALL TIMES.  | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: MUST REPLACE THE ONE WATER DAMAGED CEILING TILE IN THE REAR ABOVE THE ICE MACHINE AND MAINTAIN.",
      "latitude": "41.89552707795517",
      "longitude": "-87.69909818297548",
      "location": "(-87.69909818297548, 41.895527077955165)"
    },
    {
      "inspection_id": "1279308",
      "name": "TAMALLI SPACE CHARROS LLC",
      "aka_name": "TAMALLI SPACE CHARROS",
      "facility_type": "Mobile Food Dispenser",
      "risk": "Risk 3 (Low)",
      "address": "324 N LEAVITT ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60612",
      "date": "11/28/2012",
      "inspection_type": "License Re-Inspection",
      "results": "Pass",
      "violations": "",
      "latitude": "41.88743405025222",
      "longitude": "-87.68184949426895",
      "location": "(-87.68184949426895, 41.88743405025222)"
    },
    {
      "inspection_id": "2244202",
      "name": "COLECTIVO COFFEE ROASTERS, INC.",
      "aka_name": "COLECTIVO COFFEE ROASTERS",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "2530 N CLARK ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60614",
      "date": "01/09/2019",
      "inspection_type": "Canvass",
      "results": "Pass w/ Conditions",
      "violations": "19. PROPER REHEATING PROCEDURES FOR HOT HOLDING | 23. PROPER DATE MARKING AND DISPOSITION - Comments: 3-501.17- OBSERVED PRE PORTIONED CONTAINERS OF READY TO EAT FOOD, SALSA, STORED IN COOLER AND WALK IN COOLER, NOT LABEL WITH DATE TAG. INFORMED MANAGER THAT READY TO EAT FOODS STORED AT MORE THAN 24 HOURS MUST BE PROPERLY DATED AND LABELLED. INSTRUCTED MANAGER TO PROVIDE LABELS. MAINTAIN AT ALL TIMES.   PRIORITY FOUNDATION VIOLATION #7-38-005  NO CITATION ISSUED. | 40. PERSONAL CLEANLINESS - Comments: 2-402.11- OBSERVED FOOD HANDLERS NOT WEARING HAIR RESTRAINS IN FRONT PREP AREA WHEN FOOD IS BEING PREPARED AND SERVED. MUST WEAR HAIR RESTRAINT AT ALL TIMES FOOD IS BEING PREPEARED AND SERVED. | 58. ALLERGEN TRAINING AS REQUIRED - Comments: PA 100-0367- OBSERVED ALLERGEN AWARENESS CERTIFICATE NOT MAINTAINED. INSTRUCTED MANAGER TO OBTAIN ALLERGEN AWARENESS CERTIFICATES. NO CITATION ISSUED. | 63. REMOVAL OF SUSPENSION SIGN",
      "latitude": "41.928585159058045",
      "longitude": "-87.64242391270672",
      "location": "(-87.64242391270672, 41.92858515905805)"
    },
    {
      "inspection_id": "517574",
      "name": "RINGO",
      "aka_name": "RINGO",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "2507-2509 N LINCOLN AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60614",
      "date": "10/18/2011",
      "inspection_type": "Complaint",
      "results": "Pass w/ Conditions",
      "violations": "8. SANITIZING RINSE FOR EQUIPMENT AND UTENSILS:  CLEAN, PROPER TEMPERATURE, CONCENTRATION, EXPOSURE TIME - Comments: Equipment and utensils should get proper exposure to the sanitizing solution during the rinse cycle.  Bactericidal treatment shall consist of exposure of all dish and utensil surfaces to a rinse of clean water at a temperature of not less than 180F. LOW TEMPERATURE CHEMICAL DISH MACHINE NOT PROPERLY DISPENSING SANITIZER WHILE DISHES BEING WASHED. FOUND 0PPM AFTER SEVERAL ATTEMPTS. NO CHEMICAL TEST STRIPS ON PREMISES.  MACHINE TAGGED HELD FOR INSPECTION AND MUST NOT USE UNTIL REPAIRED AND MAINTAINS RINSE AT 100PPM, FAX REQUEST TO 312-746-4240 FOR INSPECTION AND TAG REMOVAL. | 11. ADEQUATE NUMBER, CONVENIENT, ACCESSIBLE, DESIGNED, AND MAINTAINED - Comments: Adequate and convenient toilet facilities shall be provided.  They should be properly designed, maintained, and accessible to employees at all times. EXPOSED HAND SINK IN SUSHI BAR PREP AREA NOT MAINTAINED. OBSERVED STYROFOAM PLATES STORED INSIDE SINK. FOOD BEING PREPARED IN AREA AT TIME OF INSPECTION. | 16. FOOD PROTECTED DURING STORAGE, PREPARATION, DISPLAY, SERVICE AND TRANSPORTATION - Comments: All food should be properly protected from contamination during  storage, preparation, display, service, and transportation. OBSERVED THE FOLLOWING FOODS INSIDE WALK-IN COOLER NOT PROTECTED DURING STORAGE. RAW EGGS BEING STORED ON SHELVING ABOVE CASE OF UNCOVER FRESH LETTUCE. RAW CHICKEN BEING STORED ABOVE READY TO EAT PREPARED SUSHI ROLLS. RAW FISH STORED ABOVE READY TO EAT CUT VEGETABLES. | 30. FOOD IN ORIGINAL CONTAINER, PROPERLY LABELED: CUSTOMER ADVISORY POSTED AS NEEDED - Comments: All food not stored in the original container shall be stored in properly labeled containers.ALL PREPARED FOODS IN WALK-IN COOLER MUST BE LABELED AND DATED. | 32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: All food and non-food contact equipment and utensils shall be smooth, easily cleanable, and durable, and shall be in good repair. SHELVING UNDER PREP TABLES ON COOKS LINE DIRTY. MUST CLEAN AND MAINTAIN.  TORN RUBBER DOOR GASKETS ON SUSHI PREP TWO DOOR COOLER. MUST REPLACE.  REAR METAL EXIT DOOR ON TOP SEAL IN POOR REPAIR/RUSTED. MUST REPLACE REPAIR. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: The floors shall be constructed per code, be smooth and easily cleaned, and be kept clean and in good repair. MUST NOT USE CARDBOARD AS MATTING FOR FLOORS THROUGHOUT INCLUDING BASEMENT AND WALK-IN FREEZER. | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: Ventilation: All plumbing fixtures, such as toilets, sinks, washbasins, etc., must be adequately trapped, vented, and re-vented and properly connected to the sewer in accordance with the plumbing chapter of the Municipal Code of Chicago and the Rules and Regulations of the Board of Health. LEAK AT NOZZLE ON THREE COMPARTMENT SINK. MUST REPAIR. | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: All parts of the food establishment and all parts of the property used in connection with the operation of the establishment shall be kept neat and clean and should not produce any offensive odors. EMPLOYEES PERSONAL BELONGINGS MUST NOT BE STORED IN FOOD PREP AREAS. | 43. FOOD (ICE) DISPENSING UTENSILS, WASH CLOTHS PROPERLY STORED - Comments: Between uses and during storage ice dispensing utensils and ice receptacles shall be stored in a way that protects them from contamination. COOKS LINE WIPING CLOTHS MUST BE STORED IN A CLEAN CONTAINER WITH A SANITIZING SOLUTION.   USED DIRTY CLOTHS MUST NOT BE HUNG TO DRY ON OR OVER CLEAN HANGING UTENSILS ABOVE THREE COMPARTMENT SINK.",
      "latitude": "41.92748853370833",
      "longitude": "-87.65140481061863",
      "location": "(-87.65140481061862, 41.92748853370833)"
    },
    {
      "inspection_id": "1434527",
      "name": "EUREST DINING SERVICES AT CAFE 300",
      "aka_name": "CAFE 300",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "300 N LA SALLE ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60654",
      "date": "04/03/2014",
      "inspection_type": "Canvass",
      "results": "Pass w/ Conditions",
      "violations": "2. FACILITIES TO MAINTAIN PROPER TEMPERATURE - Comments: NOTED TEMPERATURE OF WALK IN COOLER TO BE IMPROPER AT 48.9F. INSTRUCTED NOT TO USE UNTIL EQUIPMENT MAINTAINS PROPER TEMPERATURE OF 40F OR BELOW. MANAGER IMMEDIATELY CALLED REFRIGERATION TECHNICIAN FOR MAINTENANCE. BY END OF INSPECTION TEMPERATURE OF WALK IN COOLER IS READING 46.6F. PREMISES HAS OTHER COOLERS MAINTAINING PROPER TEMPERATURE OF 40F AND BELOW.  CITATION ISSUED FOR CRITICAL VIOLATION #7-38-005(A). | 3. POTENTIALLY HAZARDOUS FOOD MEETS TEMPERATURE REQUIREMENT DURING STORAGE, PREPARATION DISPLAY AND SERVICE - Comments: NOTED INTERNAL TEMPERATURES OF THE FOLLOWING POTENTIALLY HAZARDOUS FOOD ITEM TO BE IMPROPER BETWEEN 44F TO 63F ON SHELVES AT THE REAR PREP AREA AND INSIDE THE WALK IN COOLER.(CHICKEN SALAD 44.4F,TUNA 44.4F,TURKEY SANDWICH 60F,CHICKEN SALAD SANDWICH 60.2F,DELI SANDWICH 63.2F,VEGGIE WRAP(EGG PLANT,ZUCCHINI,PEPPERS ETC)54.6F,EGGS 51.2,YOGURT 50.5F,MILK (HALF/HALF)48F,HAM 47.3,CHICKEN 47.3F. MANAGER IMMEDIATELY AND VOLUNTARILY DISPOSED OF 88LBS OF PRODUCTS WORTH $435.00 THROUGH DENATURING PROCESS.  CITATION ISSUED FOR CRITICAL VIOLATION #7-38-005(A) | 6. HANDS WASHED AND CLEANED, GOOD HYGIENIC PRACTICES; NO BARE HAND CONTACT WITH READY-TO-EAT FOODS. - Comments: NOTED EMPLOYEES WEARING GLOVES AT THE PREP AREA, PUTS HAND INSIDE PANTS POCKET, WRITES ON WRAP,CONTINUES TO THE WALK IN COOLER AND BACK TO THE PREP TABLE AND CONTINUES TO PREPARE FOOD ALL WITHOUT CHANGING GLOVES. FINALLY CHANGES GLOVES BUT THEN DOES NOT WASH HANDS IN THE PROCESS.INSTRUCTED TO CHANGE GLOVES IN BETWEEN TASKS, WHEN MOVING FROM ONE STATION TO ANOTHER AND MUST WASH HAND AFTER CHANGING GLOVES.  CITATION ISSUED FOR CRITICAL VIOLATION #7-38-010(A) | 31. CLEAN MULTI-USE UTENSILS AND SINGLE SERVICE ARTICLES PROPERLY STORED: NO REUSE OF SINGLE SERVICE ARTICLES - Comments: NOTED MULTI USE UTENSILS ON SHELVING AT THE DISH WASHER ROOM NOT PROPERLY STORED. INSTRUCTED TO INVERT ALL UTENSILS DURING STORAGE TO PREVENT DUST ACCUMULATION AND CONTAMINATION. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: NOTED ACCUMULATION OF GREASE AND DIRT ALONG WALL BASE AND UNDERNEATH COOKING STOVE AT THE FRONT COOKING LINE. INSTRUCTED TO CLEAN AND MAINTAIN. | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: NOTED SLOW DRAIN AT THE EXPOSED HAND WASH SINK AT THE FRONT PREP LINE. INSTRUCTED TO REPAIR AND MAINTAIN.",
      "latitude": "41.88752863965694",
      "longitude": "-87.63264683652444",
      "location": "(-87.63264683652446, 41.887528639656935)"
    },
    {
      "inspection_id": "1607258",
      "name": "CAFE DU MARCHE",
      "aka_name": "LE CAFE DU MARCHE",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "131 N Clinton ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60661",
      "date": "12/28/2015",
      "inspection_type": "Canvass Re-Inspection",
      "results": "Pass",
      "violations": "",
      "latitude": "41.88418750712781",
      "longitude": "-87.64111966683218",
      "location": "(-87.64111966683218, 41.884187507127805)"
    },
    {
      "inspection_id": "1387750",
      "name": "WENDY'S OLD FASHIONED HAMBURGERS",
      "aka_name": "WENDY'S",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "7 E 111TH ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60628",
      "date": "11/14/2014",
      "inspection_type": "Short Form Complaint",
      "results": "Pass",
      "violations": "",
      "latitude": "41.69247632322652",
      "longitude": "-87.62284191735947",
      "location": "(-87.62284191735947, 41.692476323226515)"
    },
    {
      "inspection_id": "233221",
      "name": "Howe Elem",
      "aka_name": "Howe Elem",
      "facility_type": "School",
      "risk": "Risk 1 (High)",
      "address": "720 N Lorel AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60644",
      "date": "04/22/2010",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "36. LIGHTING: REQUIRED MINIMUM FOOT-CANDLES OF LIGHT PROVIDED, FIXTURES SHIELDED - Comments: Shielding to protect against broken glass falling into food shall be provided for all artificial lighting sources in preparation, service, and display facilities.    MUST PROVIDE LIGHT BULB INSIDE WALK-IN COOLER AND FREEZER",
      "latitude": "41.89362521162533",
      "longitude": "-87.75943556816057",
      "location": "(-87.75943556816058, 41.893625211625334)"
    },
    {
      "inspection_id": "2370293",
      "name": "BILLY GOAT TAVERN & GRILL",
      "aka_name": "BILLY GOAT TAVERN & GRILL",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "00 E LAKE ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60601",
      "date": "02/07/2017",
      "inspection_type": "Canvass Re-Inspection",
      "results": "Pass",
      "violations": "",
      "latitude": "41.8858384517594",
      "longitude": "-87.62584164558254",
      "location": "(-87.62584164558255, 41.8858384517594)"
    },
    {
      "inspection_id": "413411",
      "name": "MIKES LIQUOR",
      "aka_name": "MIKES LIQUOR",
      "facility_type": "TAVERN",
      "risk": "Risk 3 (Low)",
      "address": "3135 W MONTROSE AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60618",
      "date": "09/14/2010",
      "inspection_type": "License-Task Force",
      "results": "Fail",
      "violations": "34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: The floors shall be constructed per code, be smooth and easily cleaned, and be kept clean and in good repair.OBSERVE STANDING WATER IN BASEMENT INSTRUCTED TO REMOVE. | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: Ventilation: All plumbing fixtures, such as toilets, sinks, washbasins, etc., must be adequately trapped, vented, and re-vented and properly connected to the sewer in accordance with the plumbing chapter of the Municipal Code of Chicago and the Rules and Regulations of the Board of Health.NEED TO INSTALL HAND SINK BEHIND BAR AREA WITH HOT AND COLD RUNNING WATER AND HOOKED TO PROPER DRAINAGE.",
      "latitude": "41.961083923126395",
      "longitude": "-87.70724120876541",
      "location": "(-87.70724120876541, 41.96108392312639)"
    },
    {
      "inspection_id": "1319794",
      "name": "BRONZEVILLE CONVENIENCE",
      "aka_name": "BRONZEVILLE CONVENIENCE",
      "facility_type": "Grocery Store",
      "risk": "Risk 2 (Medium)",
      "address": "100 E 47TH ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60653",
      "date": "09/27/2013",
      "inspection_type": "License",
      "results": "Fail",
      "violations": "18. NO EVIDENCE OF RODENT OR INSECT OUTER OPENINGS PROTECTED/RODENT PROOFED, A WRITTEN LOG SHALL BE MAINTAINED AVAILABLE TO THE INSPECTORS - Comments: MUST PROVIDE A COMPLETE PEST CONTROL LOG BOOK CONTAINING ALL REQUIRED DOCUMENTS AND NEW COMPANY INFORMATION.   | 19. OUTSIDE GARBAGE WASTE GREASE AND STORAGE AREA; CLEAN, RODENT PROOF, ALL CONTAINERS COVERED - Comments: MUST PROVIDE AN OUTSIDE WASTE RECEPTACLE WITH NEW COMPANY INFORMATION.   | 24. DISH WASHING FACILITIES: PROPERLY DESIGNED, CONSTRUCTED, MAINTAINED, INSTALLED, LOCATED AND OPERATED - Comments: MUST INSTALL A METAL DRAIN BOARD AT THE THREE COMPARTMENT SINK. | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: MUST DETAIL CLEAN INTERIOR OF REACH IN COOLERS AND FREEZERS. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: MUST CLEAN FLOORS IN BASEMENT AND REMOVE DEBRIS AND POOLING WATER. | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: MUST REPAIR LEAKY PIPE UNDER THE THREE COMPARTMENT SINK.  | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: MUST REMOVE CLUTTER FROM REAR HALLWAY AND BASEMENT. ",
      "latitude": "41.809398169618895",
      "longitude": "-87.62275731970226",
      "location": "(-87.62275731970227, 41.809398169618895)"
    },
    {
      "inspection_id": "1931400",
      "name": "7-ELEVEN # 37622A",
      "aka_name": "7 ELEVEN",
      "facility_type": "Grocery Store",
      "risk": "Risk 3 (Low)",
      "address": "4 W JACKSON BLVD ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60606",
      "date": "05/23/2016",
      "inspection_type": "License Re-Inspection",
      "results": "Pass",
      "violations": "",
      "latitude": "41.87828615621557",
      "longitude": "-87.62780446623054",
      "location": "(-87.62780446623054, 41.87828615621557)"
    },
    {
      "inspection_id": "1734233",
      "name": "FLASH FOOD MART",
      "aka_name": "FLASH FOOD MART",
      "facility_type": "Grocery Store",
      "risk": "Risk 2 (Medium)",
      "address": "3424 W OHIO ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60624",
      "date": "03/16/2016",
      "inspection_type": "License Re-Inspection",
      "results": "Pass",
      "violations": "",
      "latitude": "41.89194263700593",
      "longitude": "-87.71248780539938",
      "location": "(-87.71248780539938, 41.89194263700593)"
    },
    {
      "inspection_id": "555295",
      "name": "J & J FISH",
      "aka_name": "J & J FISH",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "6659 S DAMEN AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60636",
      "date": "11/01/2011",
      "inspection_type": "Short Form Complaint",
      "results": "Pass",
      "violations": "35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: The walls and ceilings shall be in good repair and easily cleaned.  REPLACE STAINED CEILING TILES IN ALL AREAS. CLEAN ALL CEILING VENTS. | 37. TOILET ROOM DOORS SELF CLOSING: DRESSING ROOMS WITH LOCKERS PROVIDED: COMPLETE SEPARATION FROM LIVING/SLEEPING QUARTERS - Comments: REPAIR SELF CLOSING DEVICE ON WASHROOM DOOR.   | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: REPAIR LEAKING DRAINPIPE UNDER EXPOSED SINK. | 43. FOOD (ICE) DISPENSING UTENSILS, WASH CLOTHS PROPERLY STORED - Comments: USE LONG HANDLE UTENSILS FOR DISPENSING COLESLAW.",
      "latitude": "41.7721674229412",
      "longitude": "-87.67356656790552",
      "location": "(-87.67356656790552, 41.772167422941195)"
    },
    {
      "inspection_id": "2184723",
      "name": "ISLA TROPICAL",
      "aka_name": "ISLA TROPICAL",
      "facility_type": "Grocery Store",
      "risk": "Risk 3 (Low)",
      "address": "3736 W LAWRENCE AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60625",
      "date": "07/18/2018",
      "inspection_type": "License",
      "results": "Pass w/ Conditions",
      "violations": "3. MANAGEMENT, FOOD EMPLOYEE AND CONDITIONAL EMPLOYEE; KNOWLEDGE, RESPONSIBILITIES AND REPORTING - Comments: NO HEALTH POLICY ON SITE.  PF 2-102.14(A), 7-38-012(A), NO CITATION ISSUED. | 5. PROCEDURES FOR RESPONDING TO VOMITING AND DIARRHEAL EVENTS - Comments: NO WRITTEN PROCEDURES FOR CLEANING AFTER A PATRON OR EMPLOYEE EXPERIENCES VOMITING AND/OR DIARRHEA. MUST DEVELOP WRITTEN PROCEDURES.  PF 2-501.11(A0 7-38-005 NO CITATION ISSUED.",
      "latitude": "41.96841586549297",
      "longitude": "-87.72213865574992",
      "location": "(-87.7221386557499, 41.968415865492965)"
    },
    {
      "inspection_id": "1497400",
      "name": "DULCERIA ACAPULCO",
      "aka_name": "DULCERIA ACAPULCO",
      "facility_type": "Grocery Store",
      "risk": "Risk 2 (Medium)",
      "address": "2101 S CALIFORNIA AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60608",
      "date": "10/01/2014",
      "inspection_type": "Canvass",
      "results": "No Entry",
      "violations": "",
      "latitude": "41.85369311668322",
      "longitude": "-87.69535819955435",
      "location": "(-87.69535819955435, 41.85369311668322)"
    },
    {
      "inspection_id": "2159612",
      "name": "MCDONALD'S",
      "aka_name": "MCDONALD'S",
      "facility_type": "Restaurant",
      "risk": "Risk 2 (Medium)",
      "address": "1040 W RANDOLPH ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60607",
      "date": "04/06/2018",
      "inspection_type": "License",
      "results": "Pass",
      "violations": "32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: MUST INSTALL SPLASH GUARDS AT EXPOSED HAND SINKS THROUGHOUT PREP AREAS.  | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: MUST INSTALL MISSING CEILING TILES IN EMPLOYEE BREAK ROOM IN REAR.",
      "latitude": "41.88440773161879",
      "longitude": "-87.65368149002035",
      "location": "(-87.65368149002035, 41.88440773161879)"
    },
    {
      "inspection_id": "1497260",
      "name": "EL PRESIDENTE RESTAURANT",
      "aka_name": "EL PRESIDENTE RESTAURANT",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "2558 N ASHLAND AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60614",
      "date": "09/29/2014",
      "inspection_type": "Short Form Complaint",
      "results": "Pass w/ Conditions",
      "violations": "30. FOOD IN ORIGINAL CONTAINER, PROPERLY LABELED: CUSTOMER ADVISORY POSTED AS NEEDED - Comments: ALL FOOD CONTAINERS WITH READY TO EAT FOODS INSIDE THE WALK IN COOLER AND REACH IN COOLER MUST BE LABELED AND DATED. | 32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: MUST RE CAULK ALL THE EXPOSED HAND SINK AND ALL THE WASHBOWL SINK IN THE WASHROOM. CAULK ARE ALL WORN OUT. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: MUST REMOVE CARDBOARD ON THE FLOOR INSIDE THE WALK IN FREEZER. ALL CONTAINERS WITH COOKED FOODS MUST BE ELEVATED 6' OFF THE FLOOR INSIDE THE WALK IN COOLER.   | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: CRACKED/DAMAGED CEILING ABOVE THE WATER HEATER IN THE BASEMENT. MUST REPAIR AND MAINTAIN.   | 36. LIGHTING: REQUIRED MINIMUM FOOT-CANDLES OF LIGHT PROVIDED, FIXTURES SHIELDED - Comments: MISSING LIGHT SHIELD ON THE LIGHT BULB INSIDE THE WALK IN COOLER. MUST PROVIDE LIGHT SHIELD.  ",
      "latitude": "41.92868240867868",
      "longitude": "-87.66841492782217",
      "location": "(-87.66841492782217, 41.928682408678675)"
    },
    {
      "inspection_id": "1578656",
      "name": "CAKE BROS BAKERY",
      "aka_name": "CAKE BROS BAKERY",
      "facility_type": "Bakery",
      "risk": "Risk 2 (Medium)",
      "address": "6808 W NORTH AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60707",
      "date": "10/07/2015",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: INSTRUCTED TO CLEAN AND MAINTAIN FOOD CARTS AND RACKS IN REAR AREA. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: INSTRUCTED TO CLEAN AND MAINTAIN CEILING VENT COVER WITH DUST ACCUMULATION ABOVE SERVICE DISPLAY AREA. | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: INSTRUCTED TO REMOVE UNNECESSARY ARTICLES/UNUSED EQUIPMENT IN REAR STORAGE AREA. USABLE ITEMS AND CLEANING SUPPLY MUST BE STORED 6' OFF THE FLOOR FOR EASY ACCESS ON CLEANING.-------MOPS AND BROOMS MUST BE STORED 6' OFF THE FLOOR. | 45. FOOD HANDLER REQUIREMENTS MET - Comments: NO FOOD HANDLER TRAINING CERTIFICATES ON PREMISE. INSTRUCTED TO PROVIDE.",
      "latitude": "41.90912967114548",
      "longitude": "-87.79529634543768",
      "location": "(-87.79529634543768, 41.90912967114548)"
    },
    {
      "inspection_id": "2352692",
      "name": "KIDS ARE US LEARNING CENTER",
      "aka_name": "KIDS ARE US LEARNING CENTER",
      "facility_type": "Daycare Above and Under 2 Years",
      "risk": "Risk 1 (High)",
      "address": "7453 S VINCENNES AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60621",
      "date": "12/04/2019",
      "inspection_type": "Canvass Re-Inspection",
      "results": "Pass",
      "violations": "",
      "latitude": "41.758492245412725",
      "longitude": "-87.63105072780108",
      "location": "(-87.63105072780108, 41.75849224541273)"
    },
    {
      "inspection_id": "2135789",
      "name": "CHICAGO ARTS HIGH SCHOOL",
      "aka_name": "CHICAGO ARTS HIGH SCHOOL",
      "facility_type": "School",
      "risk": "Risk 1 (High)",
      "address": "2714 W Augusta BLVD ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60622",
      "date": "01/22/2018",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: NOTED A LEAK UNDERNEATH THE 3 COMPARTMENT SINK (MIDDLE COMPARTMENT) WHEN THE RELEASE LEVER IS OPEN. MUST REPAIR AND MAINTAIN.",
      "latitude": "41.899404016321824",
      "longitude": "-87.69494543228109",
      "location": "(-87.6949454322811, 41.89940401632183)"
    },
    {
      "inspection_id": "1234990",
      "name": "THE WORLD IS YOUR'S CHILD CARE & LEARNING CENTER INC.",
      "aka_name": "THE WORLD IS YOUR'S CHILD CARE & LEARNING CENTER INC.",
      "facility_type": "Daycare (2 - 6 Years)",
      "risk": "Risk 1 (High)",
      "address": "8026 S COTTAGE GROVE AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60619",
      "date": "08/30/2012",
      "inspection_type": "License",
      "results": "No Entry",
      "violations": "",
      "latitude": "41.7486247573131",
      "longitude": "-87.6053113596727",
      "location": "(-87.6053113596727, 41.7486247573131)"
    },
    {
      "inspection_id": "2050579",
      "name": "PEGASUS RESTAURANT & TAVERNA",
      "aka_name": "PEGASUS RESTAURANT & TAVERNA",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "130 S HALSTED ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60661",
      "date": "05/17/2017",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: Found several heavily stained cutting boards with deep groves (along the hot holding unit in kitchen). Must resurface or replace. Must maintain same.  | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: Found cracked tile on wall in dish area. Must repair and maintain.  Found excessive dirt build up around pipes along the floor under sprayer near dishwasher. Must remove, detail clean and sanitize this area. Must maintain same.  | 36. LIGHTING: REQUIRED MINIMUM FOOT-CANDLES OF LIGHT PROVIDED, FIXTURES SHIELDED - Comments: Found excessive debris inside light shield inside walk in cooler in rear of kitchen. Must remove debris, detail clean and sanitize. Must maintain same. ",
      "latitude": "41.87951951720997",
      "longitude": "-87.64743782249445",
      "location": "(-87.64743782249445, 41.87951951720997)"
    },
    {
      "inspection_id": "1383349",
      "name": "Mc DONALDS # 25509",
      "aka_name": "Mc DONALDS # 25509",
      "facility_type": "Restaurant",
      "risk": "Risk 2 (Medium)",
      "address": "4601 W DIVERSEY AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60639",
      "date": "12/30/2013",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "31. CLEAN MULTI-USE UTENSILS AND SINGLE SERVICE ARTICLES PROPERLY STORED: NO REUSE OF SINGLE SERVICE ARTICLES - Comments: Single use articles not properly stored. Instructed to invert utensils to prevent contamination before use. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: Floor under and behind equipment not cleaned. Instructed to detail clean daily. | 42. APPROPRIATE METHOD OF HANDLING OF FOOD (ICE) HAIR RESTRAINTS AND CLEAN APPAREL WORN - Comments: Employees in food prep area not wearing hair restraints. Instructed to provide proper hair restraints for all employees in prep area.",
      "latitude": "41.931483591781685",
      "longitude": "-87.74199187144146",
      "location": "(-87.74199187144147, 41.931483591781685)"
    },
    {
      "inspection_id": "2320798",
      "name": "QUE RICO RESTAURANT",
      "aka_name": "QUE RICO RESTAURANT",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "2814 N SOUTHPORT AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60657",
      "date": "10/30/2019",
      "inspection_type": "Canvass",
      "results": "Pass w/ Conditions",
      "violations": "1. PERSON IN CHARGE PRESENT, DEMONSTRATES KNOWLEDGE, AND PERFORMS DUTIES - Comments:  PERSON IN CHARGE AT THE TIME OF INSPECTION DOES NOT HAVE A CITY OF CHICAGO SANITATION CERTIFICATE. PRIORITY FOUNDATION VIOLATION. NO CITATION ISSUED - | 2. CITY OF CHICAGO FOOD SERVICE SANITATION CERTIFICATE - Comments:  NO ORIGINAL AND VALID CITY OF CHICAGO FOOD SERVICE SANITATION CERTIFICATE POSTED NOR PROVIDED ON SITE. INSTRUCTED TO PROVIDE. A LEAST ONE CERTIFIED FOOD MANAGER MUST BE ON SITE WHEN FOOD IS HANDLED. PRIORITY FOUNDATION: 7-38-012, CITATION ISSUED.  | 16. FOOD-CONTACT SURFACES: CLEANED & SANITIZED - Comments:  WE OBSERVED SLIGHTLY BLACK SUBSTANCE AT INTERIOR PANEL OF ICE BIN OF THE ICE MACHINE IN THE SMOOTHIES AREA,INSTRUCTED TO CLEAN AND MAINTAIN - | 25. CONSUMER ADVISORY PROVIDED FOR RAW/UNDERCOOKED FOOD - Comments: MENU DOES NOT DISCLOSE AND INFORM CONSUMERS THE SPECIFIC MENU ITEMS THAT ARE RAW OR UNDER COOKED AND A POTENTIAL HAZARD OF CONSUMING SUCH FOOD(STEAKS). MUST DISCLOSE AND REMIND SUCH ITEMS. PRIORITY FOUNDATION VIOLATION:7-38-005. NO CITATION ISSUED - | 47. FOOD & NON-FOOD CONTACT SURFACES CLEANABLE, PROPERLY DESIGNED, CONSTRUCTED & USED - Comments: OBSERVED NO STOPPERS AT THREE COMPARTMENT SINK,INSTRUCTED TO PROVIDE THREE STOPPERS AT SAID SINK | 53. TOILET FACILITIES: PROPERLY CONSTRUCTED, SUPPLIED, & CLEANED - Comments: NO SELF CLOSING DEVICE PROVIDED AT SECOND FLOOR WASHROOM DOOR. INSTRUCTED TO PROVIDE.",
      "latitude": "41.932964216671685",
      "longitude": "-87.6637295301993",
      "location": "(-87.66372953019929, 41.932964216671685)"
    },
    {
      "inspection_id": "2088913",
      "name": "GRAND RIVER",
      "aka_name": "THE LAND ON LINCOLN",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "3032 N LINCOLN AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60657",
      "date": "09/26/2017",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: OBSERVED STANDING WATER IN BOTTOM OF PREP TOP COOLER. INSTRUCTED TO ELIMINATE. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: MUST CLEAN GREASE AND FOOD DEBRIS FROM UNDER FRYER.",
      "latitude": "41.936779807698976",
      "longitude": "-87.6648344969278",
      "location": "(-87.6648344969278, 41.936779807698976)"
    },
    {
      "inspection_id": "1751611",
      "name": "J & K DOLLAR STORE, INC.",
      "aka_name": "J & K DOLLAR STORE, INC.",
      "facility_type": "Grocery Store",
      "risk": "Risk 3 (Low)",
      "address": "1645 W 79TH ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60620",
      "date": "04/07/2016",
      "inspection_type": "Complaint",
      "results": "Pass w/ Conditions",
      "violations": "19. OUTSIDE GARBAGE WASTE GREASE AND STORAGE AREA; CLEAN, RODENT PROOF, ALL CONTAINERS COVERED - Comments: OBSERVED THE OUTSIDE DUMPSTERS OVERFLOWING AND THE LIDS OPEN. INSTRUCTED TO MAINTAIN THE OUTSIDE DUMPSTER AREA. SERIOUS VIOLATION 7-38-020 | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: OBSERVED THE FLOOR WITH HOLES AND GAPS THROUGHOUT THE FACIITY AND ACCUMULATED DEBRIS UNDER SHELVING. INSTRUCTED TO CLEAN, REPAIR AND MAINTAIN THE FLOORS. | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: OBSERVED CLUTTER IN THE REAR STORAGE AREA AND THE OFFICE. INSTRUCTED TO REMOVE ALL UNECCESARY ITEMS AND/OR BETTER ORGANIZE. ",
      "latitude": "41.75022123811565",
      "longitude": "-87.66521277969126",
      "location": "(-87.66521277969125, 41.75022123811565)"
    },
    {
      "inspection_id": "1286213",
      "name": "RESTAURANT & POZOLERIA SAN JUAN",
      "aka_name": "RESTAURANT & POZOLERIA SAN JUAN",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "1523 N PULASKI RD ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60651",
      "date": "12/28/2012",
      "inspection_type": "Complaint",
      "results": "Pass w/ Conditions",
      "violations": "16. FOOD PROTECTED DURING STORAGE, PREPARATION, DISPLAY, SERVICE AND TRANSPORTATION - Comments: OBSERVED RUST INSIDE ICE MACHINE WHERE ICE IS BEING MADE.                       SERIOUS VIOLATION  7-38-005(A).                       MACHINE TAGGED. | 32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments:    OBSERVED CARDBOARD LINERS ON SHELVING OF PREP TABLE AT KITCHEEN   AREA. INSRUCTED TO REMOVE ALL LINERS/ONLY SMOOTH EASILY CLEANABLE   SURFACES MAY BE USED. | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: INTERIOR OF REACH IN ONE DOOR COOLER NEEDS CLEANING.     CHEST FREEZERS AT DRY STORAGE NEED TO BE DEFROSTED AND CLEANED.     DEEP FAT FRYER CABINETS NEED CLEANING. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: FLOORS NEED CLEANING BEHIND HOT LINE EQUIPMENT IN KITCHEN. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments:   WALLS NEED CLEANING BEHIND THE STOVE AND GRILL IN THE KITCHEN.",
      "latitude": "41.908816903427464",
      "longitude": "-87.7263339710053",
      "location": "(-87.72633397100529, 41.90881690342746)"
    },
    {
      "inspection_id": "606289",
      "name": "EZZARD CHARLES DAYCARE CENTER",
      "aka_name": "EZZARD CHARLES DAYCARE CENTER",
      "facility_type": "Daycare (2 - 6 Years)",
      "risk": "Risk 1 (High)",
      "address": "7946 S ASHLAND AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60620",
      "date": "06/23/2011",
      "inspection_type": "Canvass",
      "results": "Pass w/ Conditions",
      "violations": "2. FACILITIES TO MAINTAIN PROPER TEMPERATURE - Comments: AIR TEMP OF 41.0 DEGREES OBSERVED IN 2-DOOR REACH-IN COOLER WHICH ALSO HAS A DOOR(RIGHT SIDE) THAT NEEDS REPAIRING(WILL NOT REMAIN CLOSED WHEN LEFT SIDE IS OPENED)UNIT TAGGED HELD FOR INSPECTION, MUST BE REPAIRED AND CAPABLE OF MAINTAINING AN INTERNAL TEMPERATURE OF 40 DEGREES OR BELOW- NO CITATION ISSUED | 3. POTENTIALLY HAZARDOUS FOOD MEETS TEMPERATURE REQUIREMENT DURING STORAGE, PREPARATION DISPLAY AND SERVICE - Comments: MILK FOUND AT 44.5-46.1 IN 2-DOOR REACH-IN COOLER, PRODUCT MUST BE MAINTAINED AT 40 DEGREES  /- 2 DEGREES. ALL PRODUCT FOUND AT IMPROPER TEMPERATURE TAGGED HELD FOR INSPECTION. PRODUCT MUST REMAIN ON PREMISES UNTIL EXPIRATION DATE HAS PASSED, AND CDPH MUST BE CONTACTED SO THAT PRODUCT CAN BE RELEASED-CITATION ISSUED-CRITICAL 7-38-00B(1).  52 1/2 GALLONS VALUED AT $170.00 TAGGED. | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: CLEAN THE INTERIOR OF DISH MACHINE, AND EXTERIORS OF ALL DEEP FREEZERS,  | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: DETAIL CLEAN ALL FLOORS ALONG ALL WALL BASES, IN CORNERS, UNDERNEATH AND BEHIND ALL HEAVY EQUIPMENT IN EVERY ROOM. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: CLEAN AND/OR PAINT ALL WALLS THROUGHOUT WHERE NEEDED. SEAL ALL LOOSE BASEBOARDS THROUGHOUT. REPAIR AREAS OF WALLS THROUGHOUT WHERE NEEDED. CLEAN DOOR TO FOOD STORAGE ROOM. | 36. LIGHTING: REQUIRED MINIMUM FOOT-CANDLES OF LIGHT PROVIDED, FIXTURES SHIELDED - Comments: REPLACE MISSING END CAPS ON LIGHTS IN FOOD PREP AREA. | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: REPAIR LEAKY FAUCET AT 3 COMP. SINK. REPAIR VENTILATION IN BOY'S WASHROOM. | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: ELIMINATE CLUTTERED AREAS BEHIND DEEP FREEZERS IN STORAGE ROOM, BEHIND BOOK CASE IN CLASSROOM BY FACULTY WASHROOM, AND IN MOP SINK ROOM. DESIGNATE AN AREA FOR PERSONAL BELONGINGS IN FOOD STORAGE ROOM.",
      "latitude": "41.74895804211779",
      "longitude": "-87.66355545886084",
      "location": "(-87.66355545886083, 41.74895804211779)"
    },
    {
      "inspection_id": "2136172",
      "name": "LEE WING WAH",
      "aka_name": "LEE WING WAH",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "2147 S CHINA PL ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60616",
      "date": "01/29/2018",
      "inspection_type": "Complaint Re-Inspection",
      "results": "Pass",
      "violations": "33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: MUST CLEAN THE INTERIOR OF ALL REACH IN COOLERS, WALK IN COOLER, ALL PREP TABLES, ALL SINKS, AND ALL AIR VENTS. MUST CLEAN TO REMOVE FOOD AND DUST BUILD UP. HOOD VENTILATION IN NEED OF DETAIL CLEANING TO REMOVE ALL DUST BUILD UP. MUST DETAIL CLEAN AND MAINTAIN.  | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments:  FLOORS THROUGHOUT 1ST AND 2ND FLOOR PREP AREAS IN NEED OF DETAIL CLEANING UNDER AND AROUND ALL COOKING EQUIPMENT, STORAGE SHELVES AND PREP TABLES. MUST CLEAN AND MAINTAIN AT ALL TIMES.  | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: CEILING MUST BE CLEANED TO REMOVE ALL DUST BUILD UP. MUST DETAIL CLEAN AND MAINTAIN.  | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: HANDSINK NEEDED AT FRONT BAR AREA WHERE COCKTAILS AND FRUIT SMOOTHIES ARE PREPARED. MUST INSTAL HANDSINK AND MAINTAIN WITH SOAP AND PAPER TOWELS. CORRECT AND MAINTAIN.  | 45. FOOD HANDLER REQUIREMENTS MET - Comments: MUST PROVIDE FOOD HANDLER CERTIFICATES FOR ALL FOOD HANDLERS. MUST PROVIDE AND MAINTAIN AT ALL TIMES. ",
      "latitude": "41.85372213502968",
      "longitude": "-87.6348528729056",
      "location": "(-87.6348528729056, 41.85372213502968)"
    },
    {
      "inspection_id": "529529",
      "name": "NEW CHINA EXPRESS, INC",
      "aka_name": "NEW CHINA EXPRESS, INC",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "2101 E 71ST ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60649",
      "date": "01/31/2012",
      "inspection_type": "Short Form Complaint",
      "results": "Pass",
      "violations": "",
      "latitude": "41.765990001140594",
      "longitude": "-87.57378733665414",
      "location": "(-87.57378733665412, 41.765990001140594)"
    },
    {
      "inspection_id": "537869",
      "name": "CHEF'S WOK & POLAR BEAR",
      "aka_name": "CHEF'S WOK & POLAR BEAR",
      "facility_type": "",
      "risk": "Risk 1 (High)",
      "address": "6832 W ARCHER AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60638",
      "date": "01/31/2012",
      "inspection_type": "Canvass",
      "results": "Out of Business",
      "violations": "",
      "latitude": "41.79224120425551",
      "longitude": "-87.79286084020947",
      "location": "(-87.79286084020947, 41.79224120425551)"
    },
    {
      "inspection_id": "2049697",
      "name": "LA MICHOAKANA",
      "aka_name": "LA MICHOAKANA",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "3125 W 26th ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60623",
      "date": "05/03/2017",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "30. FOOD IN ORIGINAL CONTAINER, PROPERLY LABELED: CUSTOMER ADVISORY POSTED AS NEEDED - Comments: ALL PREPACKAGED FOOD ITEMS MUST HAVE PROPER LABELS TO IDENTIFY PRODUCT. CORRECT AND MAINTAIN.  | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: MUST CLEAN ALL CONTACT SURFACES TO REMOVE BUILD UP ON HADLES AND DOORS OF REACH IN COOLERS. CLEAN AND MAINTAIN.  | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: FLOORS IN NEED OF CLEANING TO REMOVE ALL BUILD UP IN CORNERS AND UNDER ALL EQUIPMENT AND SINKS. CLEAN AND MAINTAIN. ",
      "latitude": "41.84442314568154",
      "longitude": "-87.70366175610235",
      "location": "(-87.70366175610236, 41.84442314568154)"
    },
    {
      "inspection_id": "2185154",
      "name": "81ST AND RACINE CITGO INC.",
      "aka_name": "CITGO",
      "facility_type": "Grocery Store",
      "risk": "Risk 3 (Low)",
      "address": "8106 S RACINE AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60620",
      "date": "07/27/2018",
      "inspection_type": "Short Form Complaint",
      "results": "Fail",
      "violations": "3. MANAGEMENT, FOOD EMPLOYEE AND CONDITIONAL EMPLOYEE; KNOWLEDGE, RESPONSIBILITIES AND REPORTING - Comments: OBSERVED NO EMPLOYEE HEALTH POLICY AVAILABLE. INSTRUCTED MANAGER TO PROVIDE EMPLOYEE HEALTH POLICY. PRIORITY FOUNDATION VIOLATION 7-38-012A | 5. PROCEDURES FOR RESPONDING TO VOMITING AND DIARRHEAL EVENTS - Comments: OBSERVED NO CLEAN UP POLICY FOR VOMITING OR DIARRHEAL EVENTS. INSTRUCTED MANAGER TO PROVIDE CLEAN UP POLICY. PRIORITY FOUNDATION VIOLATION 7-38-005 | 10. ADEQUATE HANDWASHING SINKS PROPERLY SUPPLIED AND ACCESSIBLE - Comments: OBSERVED NO EXPOSED SINK IN REAR DISH WASHING AREA. INSTRUCTED MANAGER TO INSTALL AN EXPOSED SINK WITH HOT AND COLD RUNNING WATER, SOAP AND PAPER TOWELS IN DISH WASHING AREA. PRIORITY FOUNDATION VIOLATION 7-38-030C | 13. FOOD IN GOOD CONDITION, SAFE, & UNADULTERATED - Comments: OBSERVED SEVERAL BAGS OF CHEEZ-IT AND RAMEN NOODLES GNAWED, TORN AND DISPLAYED FOR SALE ON DISPLAY SHELVES IN SALES AREA. INSTRUCTED MANAGER TO DISCARD. PRIORITY FOUNDATION VIOLATION 7-38-005 | 38. INSECTS, RODENTS, & ANIMALS NOT PRESENT - Comments: OBSERVED OVER 30 MICE DROPPINGS ON CHIP DISPLAY SHELVES, 20 MICE DROPPINGS SCATTERED INSIDE CARDBOARD TRAYS ON CHIP DISPLAY RACKS AND CARDBOARD BOXES ON COOKIE DISPLAY SHELVES, 20 MICE DROPPINGS SCATTERED ON COOKIE DISPLAY SHELVES, 30 MICE DROPPINGS SCATTERED ON RAMEN NOODLE SHELVES. INSTRUCTED MANAGER TO CALL AN EXTERMINATOR FOR SERVICE, CLEAN AND SANITIZE ALL AREAS. PRIORITY FOUNDATION VIOLATION 7-38-020(A) | 38. INSECTS, RODENTS, & ANIMALS NOT PRESENT - Comments: OBSERVED 1/2 INCH GAP ON BOTTOM RIGHT SIDE OF LEFT ENTRANCE DOOR. INSTRUCTED MANAGER TO SEAL ALL OUTER OPENINGS ON DOOR TO PREVENT PEST ENTRY. | 48. WAREWASHING FACILITIES: INSTALLED, MAINTAINED & USED; TEST STRIPS - Comments: OBSERVED NO DRAINBOARD ON 3-COMPARTMENT SINK. INSTRUCTED MANAGER TO PROVIDE AN ATTACHED METAL DRAINBOARD TO PROPERLY AIR DRY FOOD EQUIPMENT AND UTENSILS.",
      "latitude": "41.746594707551054",
      "longitude": "-87.65378117410792",
      "location": "(-87.65378117410792, 41.746594707551054)"
    },
    {
      "inspection_id": "1506374",
      "name": "LUV N CARE",
      "aka_name": "LUV N CARE",
      "facility_type": "Daycare (2 - 6 Years)",
      "risk": "Risk 1 (High)",
      "address": "5776-5778 N LINCOLN AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60659",
      "date": "02/23/2015",
      "inspection_type": "License",
      "results": "Pass",
      "violations": "32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: Prep table lower shelving had peeling paint/exposed raw wood, shall be repaired/replaced. | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: Non food contact surfaces of cooler shelving not clean, need detailed cleaning, kitchen storage shelving not clean, needs detailed cleaning(crevices). | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: Floors in kitchen area not clean, need cleaning(corners), floors in furnace room, and by hot water closet not clean, need detailed cleaning(corners). | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: Wall by 3 compartment sink had peeling paint, shall be repaired/sealed, wall by prep table not clean, needs detailed cleaning.",
      "latitude": "41.98639000133417",
      "longitude": "-87.70089409380749",
      "location": "(-87.70089409380749, 41.98639000133417)"
    },
    {
      "inspection_id": "577580",
      "name": "THE LEARNING TREE II",
      "aka_name": "THE LEARNING TREE II",
      "facility_type": "Daycare Combo 1586",
      "risk": "Risk 1 (High)",
      "address": "8233-8237 S PULASKI RD ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60652",
      "date": "10/03/2011",
      "inspection_type": "License",
      "results": "Pass",
      "violations": "34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: The floors shall be constructed per code, be smooth and easily cleaned, and be kept clean and in good repair.    FLOORS IN PREP AREA AND IN STORAGE CLOSET IN NEED OF CLEANING TO REMOVE DEBRIS AND BUILD UP.  MUST CORRECT AND MAINTAIN AT ALL TIMES.   | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: The walls and ceilings shall be in good repair and easily cleaned. Use dustless cleaning methods.    WALLS IN PREP AREA IN NEED OF CLEANING TO REMOVE ALL FOOD SPLATTERS.  MUST CLEAN AND MAINTAIN AT ALL TIMES.   | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: The flow of air discharged from kitchen fans shall always be through a duct to a point above the roofline. Ventilation: All plumbing fixtures, such as toilets, sinks, washbasins, etc., must be adequately trapped, vented, and re-vented and properly connected to the sewer in accordance with the plumbing chapter of the Municipal Code of Chicago and the Rules and Regulations of the Board of Health.    FAUCET IN INFANT ROOM BATHROOM IN NEED OF REPAIR.  MUST CORRECT AND MAINTAIN AT ALL TIMES.   | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: All parts of the food establishment and all parts of the property used in connection with the operation of the establishment shall be kept neat and clean and should not produce any offensive odors. Cleaning equipment shall be properly stored away from food, utensils, equipment, and clean linens.    ALL UNECESSARY CLUTTER IN STORAGE AREA MUST BE REMOVED AND OR ORGANIZED.  MUST CORRECT AND MAINTAIN AT ALL TIMES.  ",
      "latitude": "41.74299303153854",
      "longitude": "-87.72155821260195",
      "location": "(-87.72155821260196, 41.74299303153854)"
    },
    {
      "inspection_id": "1214725",
      "name": "RINCONCITO CUBANO REST",
      "aka_name": "RINCONCITO CUBANO REST",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "3238 W FULLERTON AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60647",
      "date": "05/08/2012",
      "inspection_type": "Canvass Re-Inspection",
      "results": "Pass",
      "violations": "30. FOOD IN ORIGINAL CONTAINER, PROPERLY LABELED: CUSTOMER ADVISORY POSTED AS NEEDED - Comments: VIOLATION STILL PENDING, SEE PREVIOUS INSPECTION REPORT #1214436 | 32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: VIOLATION STILL PENDING, SEE PREVIOUS INSPECTION REPORT #1214436 | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: VIOLATION STILL PENDING, SEE PREVIOUS INSPECTION REPORT #1214436 | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: VIOLATION STILL PENDING, SEE PREVIOUS INSPECTION REPORT #1214436 | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: VIOLATION STILL PENDING, SEE PREVIOUS INSPECTION REPORT #1214436 | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: VIOLATION STILL PENDING, SEE PREVIOUS INSPECTION REPORT #1214436",
      "latitude": "41.924809736160476",
      "longitude": "-87.7089499807186",
      "location": "(-87.70894998071859, 41.92480973616048)"
    },
    {
      "inspection_id": "1401398",
      "name": "RENAISSANCE COURT AT CULTURAL CENTER",
      "aka_name": "CULTURAL CENTER GOLDEN DINER",
      "facility_type": "Golden Diner",
      "risk": "Risk 3 (Low)",
      "address": "78 E WASHINGTON ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60602",
      "date": "02/21/2014",
      "inspection_type": "Canvass",
      "results": "Fail",
      "violations": "2. FACILITIES TO MAINTAIN PROPER TEMPERATURE - Comments: NO REFRIGERATION IN FACILITY, INSTRUCTED TO OBTAIN AND KEEP TEMP AT 40F OR LOWER.",
      "latitude": "41.883334279293905",
      "longitude": "-87.6250501351137",
      "location": "(-87.6250501351137, 41.883334279293905)"
    },
    {
      "inspection_id": "2160061",
      "name": "MARKET CREATIONS",
      "aka_name": "MARKET CREATIONS",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "233 S WACKER DR ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60606",
      "date": "04/13/2018",
      "inspection_type": "Canvass",
      "results": "Fail",
      "violations": "3. POTENTIALLY HAZARDOUS FOOD MEETS TEMPERATURE REQUIREMENT DURING STORAGE, PREPARATION DISPLAY AND SERVICE - Comments: OBSERVED POTENTIALLY HAZARDOUS FOODS AT IMPROPER TEMPERATURES. APPROX 5-LBS OF CHICKEN BREAST IN HOT UNITS AT 123.0F, 2-LBS OF RICE AT 131.0F, 4-LBS OF CHICKEN WINGS AT 113.4F, 10-LBS OF COOKED GREEN BEANS AT 126.0F,  4-LBS OF BREADED FISH AT 120.3F, 10-LBS OF  MARKET CREATION CHICKEN AT 115.0F,  6-LBS OF COOKED  BROCCOLI AT 115.6F,10-LBS OF BEEF SZECHUAN WITH VEGETABLES AT 128.7F. ALL FOODS REMOVED AND DISCARDED BY MANAGER AT COST APPROX $250.00. CRITICAL VIOLATION 7-38-005A. | 11. ADEQUATE NUMBER, CONVENIENT, ACCESSIBLE, DESIGNED, AND MAINTAINED - Comments: INADEQUATE HAND WASHING FACILITIES. OBSERVED PORTABLE HAND SINK USED FOR HAND WASHING FOR STAFF. INSTRUCTED TO CONTACT THE BUILDING DEPT FOR APPROVAL FOR PORTABLE HAND SINK. INSTRUCTED TO INSTALL EXPOSED HAND SINK WITH HOT AND COLD RUNNING WATER TO CITY PLUMBING BY 4-17-2018 CRITICAL VIOLATION 7-38-030 | 21. * CERTIFIED FOOD MANAGER ON SITE WHEN POTENTIALLY HAZARDOUS FOODS ARE  PREPARED AND SERVED - Comments: NO CERTIFIED FOOD MANAGER ON PREMISES WHEN POTENTIALLY HAZARDOUS FOODS ARE PREPARED AND SERVED, RICE, CHICKEN, ETC. SERIOUS VIOLATION 7-38-012.",
      "latitude": "41.87856015362371",
      "longitude": "-87.63652387205532",
      "location": "(-87.63652387205532, 41.87856015362371)"
    },
    {
      "inspection_id": "2177032",
      "name": "HUDSON NEWS",
      "aka_name": "HUDSON NEWS (T5 ARRIVAL)",
      "facility_type": "Grocery Store",
      "risk": "Risk 3 (Low)",
      "address": "11601 W TOUHY AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60666",
      "date": "06/08/2018",
      "inspection_type": "Canvass",
      "results": "Pass w/ Conditions",
      "violations": "28. * INSPECTION REPORT SUMMARY DISPLAYED AND VISIBLE TO ALL CUSTOMERS - Comments: FOUND NO INSPECTION SUMMARY REPORT (09-29-16) POSTED ON PREMISES AT TIME OF INSPECTION. INSTRUCTED MANAGER, A SUMMARY REPORT MUST BE DISPLAYED AND VISIBLE TO ALL CUSTOMERS. SERIOUS VIOLATION 7-42-090(B)  | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: INSTRUCTED TO DETAIL CLEAN AND MAINTAIN INTERIOR SURFACES OF DISPLAY COOLER IN FRONT SERVICE/DISPLAY AREA WITH DUST AND FOOD DEBRIS ACCUMULATION.",
      "latitude": "42.008536400868735",
      "longitude": "-87.91442843927048",
      "location": "(-87.91442843927047, 42.008536400868735)"
    },
    {
      "inspection_id": "2370287",
      "name": "FLASH TACO -N- UNDERDOGG",
      "aka_name": "FLASH TACO -N- UNDERDOGG",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "1570-1/2 N DAMEN AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60622",
      "date": "09/13/2011",
      "inspection_type": "Complaint Re-Inspection",
      "results": "Fail",
      "violations": "9. WATER SOURCE: SAFE, HOT & COLD UNDER CITY PRESSURE - Comments: All food establishments shall be provided with an adequate supply of hot and cold water under pressure properly connected to the city water supply. NO HOT WATER AT  3 COMPARTMENT  SINK OR EXPOSED HAND SINK, BATHROOM  SINKS ETC. DUE TO OWNER REPLACED THE HOT WATER TANK. DURING INSPECTION PLUMBER WAS STILL WORKING ON IT. | 10. SEWAGE AND WASTE WATER DISPOSAL, NO BACK SIPHONAGE, CROSS  CONNECTION AND/OR BACK FLOW - Comments: VIOLATION STILL PENDING.DURING THE TIME OF INSPECTION WATER WAS BACKING UP AT THE GREASE BOX. THE 3 COMPARTMENT HAD PLUMBER PUTTY AROUND THE INSIDE OF THE SINK. THIS IS A PREP AREA FOR THE HOT DOG STAND AREA. NEEDS TO FIX REPAIR.  | 11. ADEQUATE NUMBER, CONVENIENT, ACCESSIBLE, DESIGNED, AND MAINTAINED - Comments: VIOLATION STILL PENDING",
      "latitude": "41.91027897110033",
      "longitude": "-87.67761701039795",
      "location": "(-87.67761701039795, 41.910278971100325)"
    },
    {
      "inspection_id": "1497150",
      "name": "AMERICAN ACCORD FOOD CORPORATION",
      "aka_name": "AMERICAN ACCORD FOOD CORPORATION",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "9485 S EWING AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60617",
      "date": "09/25/2014",
      "inspection_type": "Canvass",
      "results": "Pass w/ Conditions",
      "violations": "21. * CERTIFIED FOOD MANAGER ON SITE WHEN POTENTIALLY HAZARDOUS FOODS ARE  PREPARED AND SERVED - Comments: NO VALID CITY OF CHICAGO FOOD SANITATION CERTIFICATE POSTED.SERIOUS VIOLATION ISSUED 7-38-012 | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: INTERIOR PANEL OF ICE MACHINE NOT CLEAN.MUST CLEAN/MAINTAIN. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: MISSING FLOOR TILES AT KITCHEN ENTRANCE DOORWAY.MUST INSTALL. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: SOILED STAIN CEILING TILES IN PREP AREA.MUST REPLACE. | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: HOT WATER HANDLE TO MIDDLE FAUCET AT 4 COMP SINK LOOSE.MUST REPAIR.",
      "latitude": "41.723064125984116",
      "longitude": "-87.53647144222067",
      "location": "(-87.53647144222067, 41.723064125984116)"
    },
    {
      "inspection_id": "2078561",
      "name": "BAI CAFE, INC.",
      "aka_name": "BAI CAFE",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "3406 N ASHLAND AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60657",
      "date": "08/16/2017",
      "inspection_type": "Canvass Re-Inspection",
      "results": "Pass",
      "violations": "",
      "latitude": "41.94360207196127",
      "longitude": "-87.66891732656353",
      "location": "(-87.66891732656353, 41.94360207196127)"
    },
    {
      "inspection_id": "2049917",
      "name": "STARBUCKS COFFEE #48513",
      "aka_name": "STARBUCKS COFFEE",
      "facility_type": "Restaurant",
      "risk": "Risk 2 (Medium)",
      "address": "467 W CHICAGO AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60654",
      "date": "05/08/2017",
      "inspection_type": "License",
      "results": "Not Ready",
      "violations": "",
      "latitude": "41.89638791628231",
      "longitude": "-87.64117360265585",
      "location": "(-87.64117360265585, 41.89638791628231)"
    },
    {
      "inspection_id": "1516441",
      "name": "EL TACO SABROSO INC.",
      "aka_name": "EL TACO SABROSO INC.",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "8346 S PULASKI RD ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60652",
      "date": "08/18/2015",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: OBSERVED REAR CEILING VENT DUSTY OVER REAR PREP AREA, INSTRUCTED TO CLEAN. | 45. FOOD HANDLER REQUIREMENTS MET - Comments: OBSERVED NO FOOD HANDLER CERTIFICATES ON PREMISES AT THIS TIME,INSTRUCTED TO PROVIDE. GIVEN COPY OF IDPH'S FOOD HANDLER INFO. AT THIS TIME.",
      "latitude": "41.74074622126893",
      "longitude": "-87.72177863827976",
      "location": "(-87.72177863827976, 41.74074622126893)"
    },
    {
      "inspection_id": "277072",
      "name": "NAS FOOD MARKETET, INC",
      "aka_name": "NAS FOOD MARKETET, INC",
      "facility_type": "Grocery Store",
      "risk": "Risk 3 (Low)",
      "address": "6240 S DAMEN AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60636",
      "date": "07/02/2010",
      "inspection_type": "License Re-Inspection",
      "results": "Pass",
      "violations": "",
      "latitude": "41.77992159911442",
      "longitude": "-87.67406248504456",
      "location": "(-87.67406248504456, 41.779921599114424)"
    },
    {
      "inspection_id": "664224",
      "name": "EVANGELICAL LUTHERAN/ST PHILLIP",
      "aka_name": "EVANGELICAL LUTHERAN/ST PHILLIP",
      "facility_type": "Daycare Combo 1586",
      "risk": "Risk 1 (High)",
      "address": "2444 W BRYN MAWR AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60659",
      "date": "11/08/2011",
      "inspection_type": "License",
      "results": "Pass",
      "violations": "32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: MUST RE CAULK AROUND THE WASHBOWL SINK IN THE IST FLOOR CHILDRENS WASHROOM, AND ONE COMPT SINK IN THE PREP AREA IN THE BASEMENT AND MAINTAIN. | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: MUST CLEAN IN DETAIL THE CEILING VENT INSIDE THE WASHROOM OF THE 3 YEAR OLD CLASSROOM AND 2 YEAR OLD CLASSROOM AND MAINTAIN. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: MUST CLEAN THE FLOOR IN DETAIL INSIDE THE ELETRICAL ROOM, AND MAINTAIN. LOOSE FLOOR TILE UNDER THE DISH MACHINE MUST REPAIR/RE GLUE. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: WALLS BY THE ONE COMPT SINK, NEEDS DETAIL CLEANING. STAINED CEILING TILES BY THE LUNCH ROOM IN THE BASEMENT. MUST REPLACE. PEELING PAINT ON THE WALLS INSIDE THE CLOSET OF THE MOP SINK IN THE BASEMENT. MUST REMOVE PEELING PAINT AND REPAINT. | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: MUST INSTALL BACK FLOW PREVENTIVE DEVICE IN THE FAUCET OF THE MOP SINK,1ST FLOOR. ",
      "latitude": "41.983270108525524",
      "longitude": "-87.69126593252453",
      "location": "(-87.69126593252453, 41.98327010852552)"
    },
    {
      "inspection_id": "567372",
      "name": "SUBWAY #51581",
      "aka_name": "SUBWAY",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "29 W LAKE ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60601",
      "date": "05/09/2011",
      "inspection_type": "License Re-Inspection",
      "results": "Pass",
      "violations": "",
      "latitude": "41.88563898075977",
      "longitude": "-87.62905001540051",
      "location": "(-87.6290500154005, 41.885638980759765)"
    },
    {
      "inspection_id": "2312405",
      "name": "I-CAFE SUKUR'S PLACE/PIDE VE LAHMACUN",
      "aka_name": "I-CAFE SUKUR'S PLACE",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "1812-1814 W IRVING PARK RD ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60613",
      "date": "09/17/2019",
      "inspection_type": "Canvass Re-Inspection",
      "results": "Pass w/ Conditions",
      "violations": "25. CONSUMER ADVISORY PROVIDED FOR RAW/UNDERCOOKED FOOD - Comments: MENU DOES NOT DISCLOSE AND INFORM CONSUMERS THE SPECIFIC MENU ITEMS THAT ARE RAW OR UNDER COOKED AND A POTENTIAL HAZARD OF CONSUMING SUCH FOOD SUCH AS BREAKFAST EGGS COOKED TO ORDER AND STEAKS. MUST PROVIDE A CONSUMER ADVISORY FOR MENU AND DISCLOSE AND REMIND OF ALL ITEMS PERTAINING TO ADVISORY. PRIORITY FOUNDATION VIOLATION. NO CITATION ISSUED.",
      "latitude": "41.95431818306882",
      "longitude": "-87.67476031983938",
      "location": "(-87.67476031983938, 41.95431818306882)"
    },
    {
      "inspection_id": "1931822",
      "name": "PL Lounge",
      "aka_name": "PL Lounge",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "3454-3456 N PULASKI RD ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60641",
      "date": "05/27/2016",
      "inspection_type": "Canvass",
      "results": "No Entry",
      "violations": "",
      "latitude": "41.944298159597494",
      "longitude": "-87.7274828078833",
      "location": "(-87.72748280788329, 41.94429815959749)"
    },
    {
      "inspection_id": "2069990",
      "name": "STAN'S DONUTS & COFFEE",
      "aka_name": "STAN'S DONUTS & COFFEE",
      "facility_type": "Restaurant",
      "risk": "Risk 2 (Medium)",
      "address": "26 E ROOSEVELT RD FL ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60605",
      "date": "07/17/2017",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: HOSE ON THE 3-COMPARTMENT SINK THAT DISPENSES THE DETERGENT AND SANITIZER HANGS TO THE BOTTOM OF THE SINK. INSTRUCTED TO SHORTEN THE HOSES. MAINTAIN SAME. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: THE INTERIOR OF THE FLOOR DRAINS AND THE FLOORS UNDER/AROUND THE ICE MACHINE AND STORAGE RACKS IN THE REAR HAS DIRT AND DEBRIS ON THEM. INSTRUCTED TO CLEAN AND MAINTAIN. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: THE VENTS, WALLS AND CEILING HAS DIRT/DUST PARTICLES ON THE SURFACE. INSTRUCTED TO CLEAN AND MAINTAIN.",
      "latitude": "41.86753862662266",
      "longitude": "-87.6262084807218",
      "location": "(-87.6262084807218, 41.86753862662266)"
    },
    {
      "inspection_id": "1983223",
      "name": "KENTUCKY FRIED CHICKEN",
      "aka_name": "KFC",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "5852 S WESTERN AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60636",
      "date": "05/10/2017",
      "inspection_type": "Canvass Re-Inspection",
      "results": "Pass",
      "violations": "45. FOOD HANDLER REQUIREMENTS MET - Comments: ALL EMPLOYEES THAT FALL UNDER THE CATEGORY OF FOOD HANDLER THAT ARE NOT CERTIFIED FOOD SERVICE MANAGERS MUST MEET IDPH FOOD HANDLER REQUIREMENTS.",
      "latitude": "41.78678808590068",
      "longitude": "-87.68398488287295",
      "location": "(-87.68398488287293, 41.786788085900675)"
    },
    {
      "inspection_id": "1188532",
      "name": "WING CHONG RESTAURANT",
      "aka_name": "WING CHONG RESTAURANT",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "4077 N ELSTON AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60618",
      "date": "03/13/2013",
      "inspection_type": "Complaint",
      "results": "Pass w/ Conditions",
      "violations": "10. SEWAGE AND WASTE WATER DISPOSAL, NO BACK SIPHONAGE, CROSS  CONNECTION AND/OR BACK FLOW - Comments: WASTE WATER BACKING UP ON THE IST AND 3RD COMPARTMENT SINK OF THE 3 COMPARTMENT SINK WHEN I RUN THE WATER ON THE 2ND COMPARTMNET SINK . CITATION ISSUED CRITICAL. 7-38-030. OWNER/MANGER CALLED THE PLUMBER TO FIX THE 3 COMPARTMENT SINK WHILE I WAS TYPING THE REPORT. PLUMBER SHOWED UP AT 2:45PM AND WAS ABLE TO FIX THE 3 COMPARTMENT SINK. 3 COMPARTMENT SINK IS NOW DRAINING WELL. NO MORE BACKING UP OF WASTE WATER. | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: MUST CLEAN AND SANITIZE THE FOLLOWING: EXTERIOR OF THE STOVE, DEEP FRYER, TRAYS FOR THE CONDIMENTS, CART FOR THE CONDIMENTS/SPICES, ALL THE LIDS OF BULK CONTAINERS WITH RICE,SUGAR,FLOUR; INTERIOR OF ALL CABINETS IN THE PREP AREA AND FRONT COUNTER, EXTERIOR  PART OF THE RICE COOKER, ALL THE EXTERIOR PART OF THE DOORS OF ALL REACH IN FREEZERS AND MAINTAIN. CLEAN ALSO THE TELEPHONE, ADDING MACHINE MACHINE WITH DUST BUILD-UP IN THE FRONT COUNTER. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: MUST CLEAN IN DETAIL THE FLOOR THRU-OUT THE DINING AREA(ALONG THE WALL BASE,ALL CORNER). FLOOR THRU-OUT THE PREP AREA/KITCHEN, UNDER AND BEHIND THE COOKING EQUIPMENT AND COOLERS, STORAGE AREA AND BASEMENT. MUST ELEVATE ALL ITEMS/ARTICLES IN THE BASEMENT TO HAVE AN EASY ACCESS IN CLEANING THE FLOOR. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: MUST CLEAN THE FILTER BY THE HOOD WITH HEAVY GREASE ACCUMULATED. CLEAN THE FAN GUARD COVER OF THE 2 DOOR REACH IN COOLER ,WITH HEAVY DUST BUILD-UP AND MAINTAIN. | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: HEAVY LEAK ON THE PIPE UNDER THE 3 COMPARTMENT SINK AND HEAVY LEAK ON THE FAUCET CONNECTOR OF THE 3 COMPARTMENT SINK. MUST REPAIR TO STOP THE LEAK. | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: CLUTTER IN THE BASEMENT.(OLD CHAIRS, OLD POT AND PANS, OLD EXTRA LARGE COOKING EQUIPMENTS,DISHES ETC). INSTRUCTED TO ORGANIZE THE BASEMENT,DISPOSE ALL UNUSED ITEMS/ARTICLES NOT BEING USED T PREVENT PEST HARB6RAGE.",
      "latitude": "41.95528788588939",
      "longitude": "-87.7212583034741",
      "location": "(-87.7212583034741, 41.95528788588939)"
    },
    {
      "inspection_id": "1343544",
      "name": "T J SUB",
      "aka_name": "T J SUB",
      "facility_type": "",
      "risk": "Risk 3 (Low)",
      "address": "1559 S KOSTNER AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60623",
      "date": "11/05/2013",
      "inspection_type": "Canvass",
      "results": "Out of Business",
      "violations": "",
      "latitude": "41.85882397025515",
      "longitude": "-87.73459109692568",
      "location": "(-87.73459109692567, 41.85882397025515)"
    },
    {
      "inspection_id": "2064839",
      "name": "DMK BURGER BAR AND FISH BAR",
      "aka_name": "DMK BURGER BAR AND FISH BAR",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "600 E GRAND AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60611",
      "date": "06/23/2017",
      "inspection_type": "Canvass",
      "results": "Pass w/ Conditions",
      "violations": "3. POTENTIALLY HAZARDOUS FOOD MEETS TEMPERATURE REQUIREMENT DURING STORAGE, PREPARATION DISPLAY AND SERVICE - Comments: FOUND POTENTIALLY HAZARDOUS FOODS NOT MAINTAINING PROPER TEMPERATURE OF 40F AND BELOW AT A 4-DRAWER COOLER. FOUND APPROXIMATELY A GRAND TOTAL OF 35 POUNDS OF FOOD VALUED AT $400.00 FOUND CALAMARI 58F, CRAWFISH 60F,SHRIMP 54F, SALMON 65F, CHICKEN 59F, AND TILAPIA AT 55F. MANAGER VOLUNTARILY DISCARDED ALL ABOVE POTENTIALLY HAZARDOUS FOODS MENTIONED ABOVE. INSTRUCTED MANAGER THAT ALL POTENTIALLY HAZARDOUS FOODS MUST ALWAYS MAINTAIN 40F AND BELOW AT ALL TIMES.CDI. CRITICAL CITATION ISSUED.PLEASE NOTE 4-DRAWER UNIT WAS MAINTAINING PROPER TEMPERATURE OF 40F AND BELOW AT INSPECTION TIME. THE 4-DRAWERS OF COOLER WERE NOT PROPERLY CLOSED. | 31. CLEAN MULTI-USE UTENSILS AND SINGLE SERVICE ARTICLES PROPERLY STORED: NO REUSE OF SINGLE SERVICE ARTICLES - Comments: FOUND PLATES AND CUPS WITHOUT HANDLES BEING USED AS SCOOPERS INSIDE LARGE BULK FOOD CONTAINERS IN THE REAR KITCHEN AREA AND DRY STORAGE AREA.MUST USE SCOOPERS WITH HANDLES AT ALL TIMES. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: FOUND CRACKED AND UNEVEN FLOOR UNDER FIRST PORTION OF THE DISH MACHINE.ALSO FOUND DIRTY STANDING WATER ACROSS FROM THE MOP SINK CLOSET AND UNDER STORAGE RACKS. MUST CLEAN, SANITIZE AND REPAIR. | 36. LIGHTING: REQUIRED MINIMUM FOOT-CANDLES OF LIGHT PROVIDED, FIXTURES SHIELDED - Comments: FOUND MISSING LIGHT SHIELD OVER THE ENTRANCE INTO THE WALK-IN COOLER. MUST PROVIDE SHATTER PROOF BULB OR LIGHT SHIELD COVER AT ABOVE MENTIONED LIGHT FIXTURE. ",
      "latitude": "41.89209413686178",
      "longitude": "-87.61156988394657",
      "location": "(-87.61156988394656, 41.892094136861786)"
    },
    {
      "inspection_id": "1473346",
      "name": "SUBWAY SANDWICH & SALAD",
      "aka_name": "SUBWAY SANDWICH & SALAD",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "2352 W CERMAK RD ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60608",
      "date": "06/04/2014",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: FOUNTAIN DRINK STATION KNOZZLES,UPPER PANEL ICE MACHINE NOT CLEAN.INSTRUCTED TO CLEAN AND MAINTAIN. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: REMOVE BLACKENED WORNED-OUT CAULK ABOVE THE 3 COMPARTMENT SINK MUST BE SMOOTH,EASILY CLEANABLE SURFACE AND REMOVE DUSTS ACCUMULATIONS ON VENTILATION COVERS IN TOILET ROOMS. | 36. LIGHTING: REQUIRED MINIMUM FOOT-CANDLES OF LIGHT PROVIDED, FIXTURES SHIELDED - Comments: LIGHT SHIELDS ABOVE THE REAR DRY STORAGE SHELVINGS ARE NOT CLEAN.  INSTRUCTED TO DETAIL CLEAN AND SANITIZE.",
      "latitude": "41.852142589161744",
      "longitude": "-87.6853605774659",
      "location": "(-87.68536057746589, 41.852142589161744)"
    },
    {
      "inspection_id": "2355905",
      "name": "MISS LEE GOOD FOOD",
      "aka_name": "MISS LEE GOOD FOOD",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "203-205 E GARFIELD BLVD ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60637",
      "date": "12/26/2019",
      "inspection_type": "Canvass Re-Inspection",
      "results": "Fail",
      "violations": "38. INSECTS, RODENTS, & ANIMALS NOT PRESENT - Comments: OBSERVED 50 MICE DROPPINGS ON FLOOR BY PREP TABLE, 50 ALONG WALL BASE AND AROUND HEAVY EQUIPMENT AT REAR,25 ON PREP TABLES AND EQUIPMENT, 50 ON FLOOR IN STORAGE AREA AND UNABLE TO ACCESS OTHER AREAS DUE TO CLUTTER. MUST REMOVE DROPPINGS CLEAN/SANITIZE AFFECTED AREAS. PRIORITY FOUNDATION VIOLATION 7-38-020(A). | 41. WIPING CLOTHS: PROPERLY USED & STORED - Comments: MUST STORE UNUSED WIPING CLOTHS IN CHEMICAL SANITIZING SOLUTION. | 47. FOOD & NON-FOOD CONTACT SURFACES CLEANABLE, PROPERLY DESIGNED, CONSTRUCTED & USED - Comments: DETAIL CLEAN AND SANITIZE COUNTER TOPS, SLICER, COOKING EQUIPMENT, PREP TABLES AND COOLERS. MUST REMOVE ANY MICE DROPPINGS AND FOOD DEBRIS. | 55. PHYSICAL FACILITIES INSTALLED, MAINTAINED & CLEAN - Comments: DETAIL CLEAN TOILETS AND SINKS IN WASHROOMS. DETAIL CLEAN FLOORS THROUGHOUT.",
      "latitude": "41.794286942277694",
      "longitude": "-87.6206720841227",
      "location": "(-87.6206720841227, 41.794286942277694)"
    },
    {
      "inspection_id": "1150245",
      "name": "MCDONALD'S #490",
      "aka_name": "MCDONALD'S #490",
      "facility_type": "Restaurant",
      "risk": "Risk 2 (Medium)",
      "address": "10320 S KEDZIE AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60655",
      "date": "03/16/2012",
      "inspection_type": "Suspected Food Poisoning Re-inspection",
      "results": "Pass",
      "violations": "33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: All food and non-food contact surfaces of equipment and all food storage utensils shall be thoroughly cleaned and sanitized daily.CLEAN SALAD COOLER STANDING WATER, CLEAN DRINK DISPENSOR DRIP TRAYS AND EXTERIOR OR FRYERS. FROM REPORT 1674734 DATE 3/9/12 | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: The floors shall be constructed per code, be smooth and easily cleaned, and be kept clean and in good repair.CLEAN FLOOR UNDER FRONT FRYERS. | 36. LIGHTING: REQUIRED MINIMUM FOOT-CANDLES OF LIGHT PROVIDED, FIXTURES SHIELDED - Comments: Shielding to protect against broken glass falling into food shall be provided for all artificial lighting sources in preparation, service, and display facilities.CLEAN LIGHT SHIELD ABOVE REAR FRYER.",
      "latitude": "41.70552029655878",
      "longitude": "-87.7014580422018",
      "location": "(-87.70145804220182, 41.70552029655878)"
    },
    {
      "inspection_id": "2345400",
      "name": "TRIKE NOODLES INC.",
      "aka_name": "TRIKE NOODLES",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "2339 N MILWAUKEE AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60647",
      "date": "11/08/2019",
      "inspection_type": "Canvass",
      "results": "No Entry",
      "violations": "",
      "latitude": "41.92379231815833",
      "longitude": "-87.6985698267018",
      "location": "(-87.69856982670179, 41.92379231815833)"
    },
    {
      "inspection_id": "1313344",
      "name": "EL PACIFICO",
      "aka_name": "EL PACIFICO",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "1354-1358 W BELMONT AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60657",
      "date": "12/20/2012",
      "inspection_type": "Canvass",
      "results": "Out of Business",
      "violations": "",
      "latitude": "41.939882633586656",
      "longitude": "-87.66333997883463",
      "location": "(-87.66333997883463, 41.93988263358666)"
    },
    {
      "inspection_id": "1174303",
      "name": "JEWELL EVENTS CATERING",
      "aka_name": "JEWELL EVENTS CATERING",
      "facility_type": "Catering",
      "risk": "Risk 1 (High)",
      "address": "424 N WOOD ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60622",
      "date": "07/19/2012",
      "inspection_type": "Complaint",
      "results": "Pass",
      "violations": "34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: CLEAN FLOORS UNDER, AROUND AND BEHIND EQUIPMENT IN KITCHEN AND STORAGE. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: CLEAN OR REPLACE WALL PANEL UNDER THREE COMP SINKS IN MAIN KITCHEN.  PANEL STARTING TO MOLD FROM MOISTURE/WATER.",
      "latitude": "41.88957241308932",
      "longitude": "-87.672130097824",
      "location": "(-87.672130097824, 41.88957241308932)"
    },
    {
      "inspection_id": "1447660",
      "name": "LOCAL ROOT",
      "aka_name": "LOCAL ROOT",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "401 E ONTARIO ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60611",
      "date": "01/29/2015",
      "inspection_type": "Complaint",
      "results": "Pass",
      "violations": "33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: DETAIL CLEAN INTERIOR BOTTOM OF DEEP FRYER AND ALL HEAVY COOKING EQUIPMENT OF GREASE BUILD UP. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: CLEAN FLOORS IN KITCHEN PREP AREA, WALK-IN COOLER AND DRY FOOD STORAGE AREA. | 36. LIGHTING: REQUIRED MINIMUM FOOT-CANDLES OF LIGHT PROVIDED, FIXTURES SHIELDED - Comments: MUST PROVIDE ADEQUATE LIGHTING IN FRONT WALK-IN COOLER. | 42. APPROPRIATE METHOD OF HANDLING OF FOOD (ICE) HAIR RESTRAINTS AND CLEAN APPAREL WORN - Comments: MUST PROVIDE PROPER HAIR RESTRAINTS FOR FACIAL (BEARDS)HAIR. | 45. FOOD HANDLER REQUIREMENTS MET - Comments: MUST MEET FOOD HANDLER REQUIREMENTS.",
      "latitude": "41.893341296312244",
      "longitude": "-87.61758915120579",
      "location": "(-87.61758915120579, 41.893341296312244)"
    },
    {
      "inspection_id": "1961043",
      "name": "HARMONY RESTAURANT",
      "aka_name": "HARMONY RESTAURANT",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "6525 W ARCHER AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60638",
      "date": "09/22/2016",
      "inspection_type": "Complaint",
      "results": "Fail",
      "violations": "11. ADEQUATE NUMBER, CONVENIENT, ACCESSIBLE, DESIGNED, AND MAINTAINED - Comments: FOUND BASEMENT HANDSINK WITH NO PAPER TOWELS, FOUND BASEMENT EMPLOYEE WASHROOM WITH NO SOAP, AND FOUND 1ST FLOOR PREP AREA HAND SINK WITH NO PAPER TOWELS. MANAGER CORRECTED DURING INSPECTION.  CRITICAL VIOLATION 7-38-030  | 19. OUTSIDE GARBAGE WASTE GREASE AND STORAGE AREA; CLEAN, RODENT PROOF, ALL CONTAINERS COVERED - Comments: FOUND OUTSIDE GARBAGE AREA OPEN WITH GARBAGE EXPOSED AND OVERFLOWING. FOUND GREASE CONTAINER WITH GREASE ENCRUSTED TO THE TOP, SIDES AND GROUND. INSTRUCTED MANAGER TO CLEAN, CORRECT AND MAINTAIN ATALL TIMES.  SERIOUS VIOLATION 7-38-020  | 29. PREVIOUS MINOR VIOLATION(S) CORRECTED 7-42-090 - Comments: PREVIOUS MINOR VIOLATIONS NOT CORRECTED FROM 1-22-16 REPORT #1454352 INSP#218 #33 COOKING EQUIPMENT IN NEED OF CLEANING TO REMOVE ALL GREASE BUILD UP. MUST CLEAN AND MAINTAIN AT ALL TIMES. #34 FLOORS IN NEED OF CLEANING THROUGH OUT BASEMENT AND REAR PREP. MUST CLEAN AND MAINTAIN AT ALL TIMES. #35 WALLS IN PREP AREA IN NEED OF CLEANING TO REMOVE FOOD SPLATTER. MUST CLEAN AND MAINTAIN AT ALL TIMES. #36 LIGHT SHEILDS NEEDED IN REAR PREP AREA. MUST INSTALL AND MAINTAIN. #37 EMPLOYEE WASHROOM IN BASEMENT IN NEED OF CLEANING. MUST CORRECT AND MAINTAIN AT ALL TIMES.  MUST CORRECT AND MAINTAIN AT ALL TIMES.  SERIOUS VIOLATION 7-42-090  | 31. CLEAN MULTI-USE UTENSILS AND SINGLE SERVICE ARTICLES PROPERLY STORED: NO REUSE OF SINGLE SERVICE ARTICLES - Comments: ALL MULTI USE UTENSILS MUST BE STORED IN A CLEAN SANITIZED MANNER.  MAY NOT STORE UTENSILS BETWEEN TABLES. MUST CORRECT AND MAINTAIN.  | 32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: RUBBER GASKET NEEDED ON REACH IN COOLER AT SUSHI BAR. MUST CORRECT AND MAINTAIN.   | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: INTERIOR OF ALL REACH IN COOLERS IN NEED OF CLEANING TO REMOVE ALL FOOD BUILD UP AND DEBRIS. HOOD VENTILATION WITH HEAVY GREASE BUILD UP. MUST DETAIL CLEAN AND MAINTAIN. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: CEILING ABOVE HOOD VENTILATION IN POOR REPAIR. HOLES AND WATER DAMAGE MUST CORRECT AND MAINTAIN.  | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: ALL UNNECESSARY CLUTTER MUST BE REMOVED AND OR ORGANIZED. CORRECT AND MAINTAIN.  | 45. FOOD HANDLER REQUIREMENTS MET - Comments: MUST PROVIDE PROOF OF ALL FOOD HANDLER CERTIFICATES. PROVIDE AND MAINTAIN. ",
      "latitude": "41.792163848654795",
      "longitude": "-87.78540566160221",
      "location": "(-87.78540566160221, 41.792163848654795)"
    },
    {
      "inspection_id": "2316068",
      "name": "FALCON FUEL",
      "aka_name": "FALCON FUEL",
      "facility_type": "Grocery Store",
      "risk": "Risk 3 (Low)",
      "address": "304-308 S CICERO AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60644",
      "date": "10/18/2019",
      "inspection_type": "Canvass",
      "results": "Out of Business",
      "violations": "",
      "latitude": "41.876622404666854",
      "longitude": "-87.74528678507124",
      "location": "(-87.74528678507123, 41.87662240466685)"
    },
    {
      "inspection_id": "1977186",
      "name": "PREMIER CATERING & EVENTS",
      "aka_name": "PREMIER CATERING & EVENTS",
      "facility_type": "Liquor",
      "risk": "Risk 3 (Low)",
      "address": "500 W JACKSON BLVD ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60661",
      "date": "12/15/2016",
      "inspection_type": "License",
      "results": "Pass",
      "violations": "",
      "latitude": "41.87815352261035",
      "longitude": "-87.63963862300314",
      "location": "(-87.63963862300314, 41.87815352261035)"
    },
    {
      "inspection_id": "1588493",
      "name": "ARGO TEA",
      "aka_name": "ARGO TEA",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "250 E SUPERIOR ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60611",
      "date": "11/17/2015",
      "inspection_type": "Canvass",
      "results": "Pass w/ Conditions",
      "violations": "2. FACILITIES TO MAINTAIN PROPER TEMPERATURE - Comments: REFRIGERATED FOOD STORAGE FACILITIES AT IMPROPER TEMPERATURES.  NOTED REACH IN COOLER IN THE PREP AREA AT 47 DEGREES F AND THE REACH IN COOLER IN THE BASEMENT STORAGE AREA BETWEEN 52-60 DEGREES F.  MUST REPAIR AND MAINTAIN REFRIGERATION UNITS AT 40 DEGREES F AND BELOW.  CRITICAL CITATION ISSUED 7-38-005A | 3. POTENTIALLY HAZARDOUS FOOD MEETS TEMPERATURE REQUIREMENT DURING STORAGE, PREPARATION DISPLAY AND SERVICE - Comments: NOTED POTENTIALLY HAZARDOUS FOODS AT IMPROPER TEMPERATURES.  NOTED QUICHE AT 50-53 DEGREES F, YOGURT AT 48.7-50 DEGREES F, MILK AT 47.6 DEGREES F, VARIOUS DELI SANDWICHES AT 48.9 DEGREES F, SPINACH AT 47-50 DEGREES F, LENTIL SALAD AT 49.7-52 DEGREES F, BLACK BEAN SALAD AT 49.7-52 DEGREES F,HALF AND HALF AT 53.6 DEGREES F,RAW EGGS AT 58 DEGREES F,AND VARIOUS CHEESES AT 47-52 DEGREES F.  MUST MAINTAIN POTENTIALLY HAZARDOUS COLD FOODS AT 40 DEGREES F AND BELOW.  CRITICAL CITATION ISSUED 7-38-005A | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: DETAIL CLEAN THE INTERIOR TOP PANEL OF THE ICE MACHINE.  MUST ALSO CLEAN SINKS, STORAGE CABINETS, COUNTER TOPS, REFRIGERATION UNITS AND ALL EQUIPMENT AS NEEDED.  | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: DETAIL CLEAN FLOORS UNDERNEATH SINKS AND OTHER EQUIPMENT.  KEEP FLOORS DRY UNDER THE HAND SINK AND THE THREE COMPARTMENT SINK. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: MUST DETAIL CLEAN LOWER WALLS IN PREP AREA UNDER SINKS AND BEHIND EQUIPMENT. ",
      "latitude": "41.89589815739559",
      "longitude": "-87.62077291309296",
      "location": "(-87.62077291309295, 41.89589815739559)"
    },
    {
      "inspection_id": "626386",
      "name": "LEAMINGTON FOODS INC",
      "aka_name": "LEAMINGTON FOODS INC",
      "facility_type": "Grocery Store",
      "risk": "Risk 2 (Medium)",
      "address": "3240 W ROOSEVELT RD ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60624",
      "date": "01/27/2012",
      "inspection_type": "Complaint",
      "results": "Pass",
      "violations": "33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: All food and non-food contact surfaces of equipment and all food storage utensils shall be thoroughly cleaned and sanitized daily.  CLEAN OR REPLACE PLASTIC FLAPS HANGING IN WALK-IN UNIT WHERE SMOKED MEATS STORED IN PRODUCE AREA.  SOME REFRIGERATION UNIT BOTTOM SHELVES NEED CLEANING; CLEAN SAME. CLEAN SHELF INSIDE OF WALIK-IN DAIRY COOLER BY THE DOOR AND MAINTAIN. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: The floors shall be constructed per code, be smooth and easily cleaned, and be kept clean and in good repair.  REMOVE ITEMS FROM FLOOR BEHIND TRASH COMPACTOR. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: The walls and ceilings shall be in good repair and easily cleaned.  SOME AREAS OF WALLS IN DAIRY WALK-IN COOLER RUSTY; REMOVE RUST.  REPLACE MISSING WALL TILE AT WALLBASE OF WOMENS WASHROOM.  REPLACE WALL COVING AT LOWER WALL OF PRODUCE PREP ROOM WHERE LOOSE. | 40. REFRIGERATION AND METAL STEM THERMOMETERS PROVIDED AND CONSPICUOUS - Comments: All food establishments that display, prepare, or store potentially hazardous foods shall have calibrated metal stem thermometers, provided and conspicuous, for refrigerated and hot food units.  PROVIDE AN INTERNAL THERMOMETER FOR THE TWO DOOR PREP COOLER IN DELI AREA. | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: Cleaning equipment shall be properly stored away from food, utensils, equipment, and clean linens.  ORGANIZE AND MAINTAIN UTILITY CLOSET.",
      "latitude": "41.866497308125936",
      "longitude": "-87.70733778712558",
      "location": "(-87.7073377871256, 41.866497308125936)"
    },
    {
      "inspection_id": "2116507",
      "name": "PMA MCD INC",
      "aka_name": "MCDONALDS",
      "facility_type": "Restaurant",
      "risk": "Risk 2 (Medium)",
      "address": "5624 W ROOSEVELT RD ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60644",
      "date": "11/30/2017",
      "inspection_type": "Short Form Complaint",
      "results": "Pass",
      "violations": "",
      "latitude": "41.865690107045424",
      "longitude": "-87.76538911467928",
      "location": "(-87.76538911467928, 41.86569010704542)"
    },
    {
      "inspection_id": "1319599",
      "name": "PARK 52",
      "aka_name": "PARK 52",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "5201 S HARPER ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60615",
      "date": "06/13/2013",
      "inspection_type": "Canvass",
      "results": "Out of Business",
      "violations": "",
      "latitude": "41.80106220163419",
      "longitude": "-87.58899288411371",
      "location": "(-87.58899288411371, 41.80106220163419)"
    },
    {
      "inspection_id": "2303573",
      "name": "BOB-O-RINO'S",
      "aka_name": "BOB-O-RINO'S",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "3435 N CENTRAL AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60634",
      "date": "07/23/2019",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "39. CONTAMINATION PREVENTED DURING FOOD PREPARATION, STORAGE & DISPLAY - Comments: OBSERVED OPENING AT COUNTER AREA LEADING TO FOOD PREP AREA.INSTRUCTED TO PUT A BARRIER AT OPENING AT COUNTER AREA.  CORE VIOLATION | 55. PHYSICAL FACILITIES INSTALLED, MAINTAINED & CLEAN - Comments: OBSERVED FLOOR AT BASE OF CHEST FREEZER DIRTY AT PREP KITCHEN.INSTRUCTED MANAGEMENT TO MAINTAIN AND CLEAN. CORE VIOLATION",
      "latitude": "41.943303967580135",
      "longitude": "-87.76651979727566",
      "location": "(-87.76651979727566, 41.94330396758013)"
    },
    {
      "inspection_id": "521776",
      "name": "RICOCHETS",
      "aka_name": "RICOCHETS",
      "facility_type": "TAVERN",
      "risk": "Risk 3 (Low)",
      "address": "4644 N LINCOLN AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60625",
      "date": "09/27/2011",
      "inspection_type": "Canvass",
      "results": "Out of Business",
      "violations": "",
      "latitude": "41.96600612838032",
      "longitude": "-87.68700620545464",
      "location": "(-87.68700620545464, 41.96600612838032)"
    },
    {
      "inspection_id": "2145647",
      "name": "VERONICA OCELOTL",
      "aka_name": "VERONICA OCELOTL",
      "facility_type": "Grocery Store",
      "risk": "Risk 3 (Low)",
      "address": "858 W 33RD ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60608",
      "date": "02/27/2018",
      "inspection_type": "License Re-Inspection",
      "results": "Fail",
      "violations": "19. OUTSIDE GARBAGE WASTE GREASE AND STORAGE AREA; CLEAN, RODENT PROOF, ALL CONTAINERS COVERED - Comments: NO CONTRACT WITH A LICENSE DISPOSAL SERVICE OR DUMPSTER. MUST PROVIDE.  SERIOUS VIOLATION 7-38-020. NO CITATION ISSUED. | 32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: NO DRAIN BOARD AT REAR 3-COMP SINK. MUST PROVIDE. MUST SEAL RAW WOOD BEHIND FRONT SERVICE COUNTER. | 36. LIGHTING: REQUIRED MINIMUM FOOT-CANDLES OF LIGHT PROVIDED, FIXTURES SHIELDED - Comments: MUST PROVIDE LIGHT SHIELDS FOR INTERIOR BULBS OF 4-DR REFRIGERATOR AND AT CEILING ABOVE FOOD DISPLAY AREA.   | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: REPAIR LEAK AT FAUCET OF 3-COMP SINK AT REAR. MUST PROVIDE BACKFLOW DEVICE AT MOP SINK AND REMOVE THREADS ON FAUCET.  ",
      "latitude": "41.83490818545951",
      "longitude": "-87.64855875568806",
      "location": "(-87.64855875568807, 41.834908185459504)"
    },
    {
      "inspection_id": "2059784",
      "name": "ALIBABA CAFE",
      "aka_name": "ALIBABA CAFE",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "4044 W LAWRENCE AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60630",
      "date": "06/07/2017",
      "inspection_type": "Canvass",
      "results": "Fail",
      "violations": "10. SEWAGE AND WASTE WATER DISPOSAL, NO BACK SIPHONAGE, CROSS  CONNECTION AND/OR BACK FLOW - Comments: FOUND 3 COMPARTMENT SINK NOT PROPERLY MAINTAINED. WASTE WATER (DIRTY WATER - GREASE AND FOOD DEBRIS) BACKING-UP FROM ONE COMPARTMENT INTO ANOTHER COMPARTMENT OF THE 3 COMPARTMENT SINK. INSTRUCTED TO REPAIR. (CORRECTED DURING INSPECTION - MANAGER CLEANED AND RODDED THE OUTSIDE GREASE TRAP). CRITICAL VIOLATION 7-38-030 | 11. ADEQUATE NUMBER, CONVENIENT, ACCESSIBLE, DESIGNED, AND MAINTAINED - Comments: FOUND EXPOSED HANDSINK CLOGGED IN PREP AREA. INSTRUCTED TO FIX.  (CORRECTED DURING INSPECTION - MANAGER PLUNGED THE SAID EXPOSED HANDSINK). CRITICAL VIOLATION 7-38-030 | 18. NO EVIDENCE OF RODENT OR INSECT OUTER OPENINGS PROTECTED/RODENT PROOFED, A WRITTEN LOG SHALL BE MAINTAINED AVAILABLE TO THE INSPECTORS - Comments: FOUND FRONT ENTRANCE AND SIDE DOOR NOT RODENT PROOFED WITH 1/4 INCH GAP/OPENING. INSTRUCTED TO RODENT PROOFED BOTTOM OF THE SAID DOORS, ALSO NOTED OVER 3 MICE DROPPINGS IN BASEMENT STORAGE. INSTRUCTED TO REMOVE, CLEAN AND SANITIZE THE AFFECTED AREA. MUST REMOVE ALL CLUTTER IN BASEMENT STORAGE AREA. SERIOUS VIOLATION 7-38-020 | 21. * CERTIFIED FOOD MANAGER ON SITE WHEN POTENTIALLY HAZARDOUS FOODS ARE  PREPARED AND SERVED - Comments: FOUND NO CERTIFIED FOOD MANAGER ON SITE WHEN POTENTIALLY HAZARDOUS FOODS (EG COOKED RICE, CHICKEN, BEEF ETC) ARE BEING PREPARED. INSTRUCTED PERSON IN CHARGE, A CERTIFIED FOOD MANAGER WITH CITY OF CHICAGO FOODSERVICE SANITATION CERTIFICATE MUST BE PRESENT WHEN HANDLING POTENTIALLY HAZARDOUS FOODS. SERIOUS VIOLATION 7-38-012 | 29. PREVIOUS MINOR VIOLATION(S) CORRECTED 7-42-090 - Comments: PREVIOUS MINOR VIOLATION NOT CORRECTED FROM INSPECTION REPORT#  1961168 ISSUED ON 09-23-2016. SERIOUS VIOLATION 7-42-090 #41 - BASEMENT FLOOR CLUTTERED AT NORTHEAST WALL BY EXIT DOOR. INSTRUCTED MANAGER TO ELEVATE ITEMS 6' OFF FLOOR OR REMOVE ITEMS | 32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: INSTRUCTED TO TRANSFER FOOD PRODUCTS FROM AN OPEN ORIGINAL CAN CONTAINER INTO FOOD GRADE CONTAINER FOR PROPER FOOD STORAGE.-------- GROCERY BAGS NOT ALLOWED TO USE FOR FOOD STORAGE INSIDE COOLERS AND FREEZERS. MUST USE FOOD GRADE STORAGE BAGS.-------NOTED WATER LEAK INSIDE 3 DOOR PREP/DISPLAY COOLER. INSTRUCTED TO REPAIR. | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: INSTRUCTED TO DETAIL CLEAN AND MAINTAIN KITCHEN HOOD AND FILTERS, SIDES OF COOKING EQUIPMENT, INTERIOR SURFACES OF COOLERS AND FREEZERS. | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: INSTRUCTED TO REMOVE AIR CONDITIONER DRAIN LINE DRAINING INTO ONE COMPARTMENT OF THE 3 COMPARTMENT SINK. DRAIN LINE MUST PROPERLY DRAIN ONTO FLOOR DRAIN. | 40. REFRIGERATION AND METAL STEM THERMOMETERS PROVIDED AND CONSPICUOUS - Comments: INSTRUCTED TO PROVIDE THERMOMETER VISIBLE AND ACCURATE INSIDE ALL COOLERS.",
      "latitude": "41.96833130892333",
      "longitude": "-87.72987051441721",
      "location": "(-87.72987051441721, 41.968331308923325)"
    },
    {
      "inspection_id": "58426",
      "name": "JUST BAKED FOODS",
      "aka_name": "JUST BAKED FOODS",
      "facility_type": "",
      "risk": "Risk 1 (High)",
      "address": "901 N DAMEN AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60622",
      "date": "04/08/2010",
      "inspection_type": "Out of Business",
      "results": "Pass",
      "violations": "",
      "latitude": "41.897779276935026",
      "longitude": "-87.67695886634722",
      "location": "(-87.67695886634722, 41.89777927693502)"
    },
    {
      "inspection_id": "63354",
      "name": "JALISCO RESTAURANT",
      "aka_name": "JALISCO RESTAURANT",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "4224 W 31ST ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60623",
      "date": "05/18/2010",
      "inspection_type": "License Re-Inspection",
      "results": "Pass",
      "violations": "",
      "latitude": "41.836923800437326",
      "longitude": "-87.73036890225058",
      "location": "(-87.73036890225058, 41.836923800437326)"
    },
    {
      "inspection_id": "2213508",
      "name": "BUCKINGHAM PAVILLION INC",
      "aka_name": "BUCKINGHAM PAVILLION",
      "facility_type": "Long Term Care",
      "risk": "Risk 1 (High)",
      "address": "2625 W TOUHY AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60645",
      "date": "08/27/2018",
      "inspection_type": "Canvass",
      "results": "Pass w/ Conditions",
      "violations": "3. MANAGEMENT, FOOD EMPLOYEE AND CONDITIONAL EMPLOYEE; KNOWLEDGE, RESPONSIBILITIES AND REPORTING - Comments: 2-102.14(A)FOUND NO EMPLOYEE HEALTH POLICY/TRAINING ON SITE. INSTRUCTED FACILITY TO ESTABLISH AN APPROPRIATE EMPLOYEE HEALTH POLICY/TRAINING SYSTEM AND MAINTAIN WITH VERIFIABLE DOCUMENTS ON SITE. PRIORITY FOUNDATION VIOLATION 7-38-012. NO CITATION ISSUED. | 5. PROCEDURES FOR RESPONDING TO VOMITING AND DIARRHEAL EVENTS - Comments: 2-501.11 FOUND NO PROCEDURE/PLAN FOR RESPONDING TO VOMITING AND DIARRHEAL EVENTS. INSTRUCTED FACILITY TO DEVELOP AND MAINTAIN A PROCEDURE/PLAN AND TO MAINTAIN ANY APPROPRIATE SUPPLIES ON SITE. PRIORITY FOUNDATION VIOLATION 7-38-005. NO CITATION ISSUED | 47. FOOD & NON-FOOD CONTACT SURFACES CLEANABLE, PROPERLY DESIGNED, CONSTRUCTED & USED - Comments: 4-204.18 OBSERVED AIR CONDITIONING CONDENSER IN DRY STORAGE ROOM WITH HOME MADE CATCH BASIN MADE OF DISPOSABLE TIN FOIL PANS. THIS SYSTEM IS INADEQUATE AND MUST ADEQUATELY PROTECT FOOD UNDER CONDENSER UNIT. | 51. PLUMBING INSTALLED; PROPER BACKFLOW DEVICES - Comments: 5-205.15 (B)OBSERVED LEAKING CONDITION UNDER 3 COMPARTMENT SINK ON EAST SIDE OF KITCHEN AND LEAKING CONDITION UNDER LOW TEMP DISH MACHINE ON EAST SIDE OF KITCHEN. REPAIR AND MAINTAIN LEAKS.",
      "latitude": "42.01204322780128",
      "longitude": "-87.69601187012722",
      "location": "(-87.69601187012722, 42.01204322780128)"
    },
    {
      "inspection_id": "2290786",
      "name": "POLLO EXPRESS",
      "aka_name": "POLLO EXPRESS",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "1315 W 18TH ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60608",
      "date": "05/31/2019",
      "inspection_type": "Canvass",
      "results": "Pass w/ Conditions",
      "violations": "3. MANAGEMENT, FOOD EMPLOYEE AND CONDITIONAL EMPLOYEE; KNOWLEDGE, RESPONSIBILITIES AND REPORTING - Comments: OBSERVED NO EMPLOYEE HEALTH POLICY ON PREMISES AT THIS TIME, INSTRUCTED TO PROVIDE. PRIORITY FOUNDATION 7-38-005, NO CITATION ISSUED. | 5. PROCEDURES FOR RESPONDING TO VOMITING AND DIARRHEAL EVENTS - Comments: OBSERVED NO PROCEDURES FOR RESPONDING FOR VOMITING AND DIARRHEAL EVENTS, INSTRUCTED TO PROVIDE. PRIORITY FOUNDATION 7-38-005, NO CITATION ISSUED. | 37. FOOD PROPERLY LABELED; ORIGINAL CONTAINER - Comments: OBSERVED MADE ON SITE FLAN, RICE PUDDING, AND CATUS SALAD PRE-PACKAGED FOR RETAIL SALE WITH OUT PROPER LABELING, INSTRUCTED TO PROPER LABEL ABOVE ITEMS. | 51. PLUMBING INSTALLED; PROPER BACKFLOW DEVICES - Comments: OBSERVED THE SPRAYER AT THE 3 COMPARTMENT SINK LEAKING, INSTRUCTED TO REPAIR/MAINTAIN. | 58. ALLERGEN TRAINING AS REQUIRED - Comments: OBSERVED NO ALLERGEN TRAINING ONPREMISES AT THIS TIME, INSTRUCTED TO PROVIDE FOR ALL CITY OF CHICAGO MANAGERS.",
      "latitude": "41.8577926491534",
      "longitude": "-87.6596342606081",
      "location": "(-87.6596342606081, 41.85779264915341)"
    },
    {
      "inspection_id": "2129450",
      "name": "CHINA DOLL",
      "aka_name": "CHINA DOLL",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "1246 N WELLS ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60610",
      "date": "12/19/2017",
      "inspection_type": "Complaint",
      "results": "Pass",
      "violations": "32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: USING BROWN PAPER BAGS TO STORED COOKED FOOD IN WALK-IN COOLER. INSTRUCTED TO USE FOOD GRADE FOOD CONTACT SURFACE. | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: SHELVES AND PREP COUNTER AT COOK LINE NOT CLEAN, DIRT AND HEAVY DUST BUILD-UP NOTED INSTRUCTED TO CLEAN AND MAINTAIN. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: FLOOR NOT CLEAN UNDER COOK LINE, TRASH, GREASE AND FOOD DEBRIS NOTED, INSTRUCTED TO CLEAN AND MAINTAIN. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: ICE MAKER LOCATED UNDER A SEWER LINE AT BASEMENT, INSTRUCTED TO INSTALL A BARRIER ABOVE OR RELOCATE MACHINE. | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: CHIPPED WOOD PANELS ATTACHED TO PREP AREA SHELVES, INSTRUCTED TO REMOVE.",
      "latitude": "41.905240227396824",
      "longitude": "-87.63467549842754",
      "location": "(-87.63467549842754, 41.90524022739683)"
    },
    {
      "inspection_id": "1150918",
      "name": "CHICAGO CHEESE STEAK COMPANY",
      "aka_name": "CHICAGO CHEESE STEAK COMPANY",
      "facility_type": "Restaurant",
      "risk": "Risk 2 (Medium)",
      "address": "7759 S CICERO AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60652",
      "date": "11/08/2012",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: CLEAN COOKIE OVEN. | 36. LIGHTING: REQUIRED MINIMUM FOOT-CANDLES OF LIGHT PROVIDED, FIXTURES SHIELDED - Comments: CLEAN INSIDE LIGHT SHIELDS.",
      "latitude": "41.75106615967994",
      "longitude": "-87.74128107760146",
      "location": "(-87.74128107760146, 41.751066159679944)"
    },
    {
      "inspection_id": "1482820",
      "name": "GAELIC IMPORTS",
      "aka_name": "GAELIC IMPORTS",
      "facility_type": "Grocery Store",
      "risk": "Risk 1 (High)",
      "address": "6346 W GUNNISON ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60630",
      "date": "06/25/2015",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: FOUND TWO  GAS BURNER UNITS BY THE LARGE OVEN WITHOUT VENTILATION/HOOD.INSTRUCTED TO PROVIDE VENTILATION/HOOD ABOVE THE UNIT OR REMOVE UNIT FROM PREMISES | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: CANOPY DECORATION ABOVE DISPLAY SERVING COOLER AT FRONT SELLING AREA WITH DUST BUILD-UP,SURFACE IS UNEVEN AND ABSORBENT MATERIAL,'THATCH' INSTRUCTED TO CLEAN AND MAINTAIN OR REPLACE IT WITH A SMOOTH,CLEANABLE AND NON-ABSORBENT SURFACE | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: DUST BUILD-UP ON FLOOR BEHIND THE CHEST  AND REACH-IN FREEZERS.INSTRUCTED TO CLEAN AND MAINTAIN.  FOOD STAINED CARPET BEHIND THE FRONT DISPLAY PREP/SERVING COOLER  MUST BE CLEANED OR REPLACED WITH A SMOOTH CLEANABLE AND NON-ABSORBENT SURFACE.USE OF CARPET IS PROHIBITED IN FOOD AREAS | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: OBSERVED STOCK(FOOD:FOAM CUPS AND NON-FOOD ITEMS)STORED INSIDE THE STAFF WASH ROOM.INSTRUCTED TO REMOVE",
      "latitude": "41.968525355574286",
      "longitude": "-87.78743940246437",
      "location": "(-87.78743940246437, 41.96852535557429)"
    },
    {
      "inspection_id": "347226",
      "name": "Food 4 Less Midwest #552",
      "aka_name": "FOOD 4 LESS",
      "facility_type": "Grocery Store",
      "risk": "Risk 1 (High)",
      "address": "7030 S ASHLAND AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60636",
      "date": "10/14/2010",
      "inspection_type": "Short Form Complaint",
      "results": "Pass w/ Conditions",
      "violations": "21. * CERTIFIED FOOD MANAGER ON SITE WHEN POTENTIALLY HAZARDOUS FOODS ARE  PREPARED AND SERVED - Comments: A certified food service manager must be present in all establishments at which potentially hazardous food is prepared or served.    NO CITY OF CHICAGO FOOD SERVICE MANAGER ON DUTY AS REQUIRED WHILE POTENTIALLY HAZARDOUS FOODS BEING PREPARED AND SERVED; MUST PROVIDE.  ADVISED TO ENROLL AS MANY MANAGERS AND DEPT HEADS AS POSSIBLE TO COVER ALL SHIFTS.  COURT HEARING ON THURSDAY DEC. 16, 2010 AT 400 W. SUPERIOR, ROOM 107 AT 9:00 AM. | 32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: VIOLATION PREVIOUSLY WRITTEN JAN. 2010 WAS CORRECTED. CLEAN INTERIOR BOTTOM CABINETS OF FRYERS TO REMOVE GREASE NOTED IN DELI. CLEAN ALL STORAGE CRATES AND RACKS IN DELI AND BAKERY AREA AND MAINTAIN. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: VIOLATION CORRECTED FROM JAN. 2010. CLEAN FLOORS IN STORAGE AREAS, WALK-IN UNITS AND PREP AREAS AROUND EQUIPMENT. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: VIOLATION CORRECTED FROM JAN. 2010 MUST REMOVE DUST FROM CEILING VENTS AND TILES IN DELI AREA.   | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: ORGANIZE AND MAINTAIN REAR STORAGE AREAS BY REMOVING UNNECESSARY ITEMS.  ",
      "latitude": "41.76579077043186",
      "longitude": "-87.66396688645496",
      "location": "(-87.66396688645497, 41.76579077043187)"
    },
    {
      "inspection_id": "2370290",
      "name": "#1 CHOP SUEY",
      "aka_name": "#1 CHOP SUEY",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "4307 W IRVING PARK",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60641",
      "date": "06/28/2010",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: Can opener, storage shelves, exhaust hood and filters not cleaned. Instructed to detail clean and sanitize daily. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: Floor under equipment and along wallbase not cleaned. Instructed to detail clean. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: Ceiling tile in prep area not maintained. Instructed to detail all damaged ceiling tile.",
      "latitude": "41.953443449987795",
      "longitude": "-87.73576333403282",
      "location": "(-87.73576333403281, 41.953443449987795)"
    },
    {
      "inspection_id": "557282",
      "name": "XSPORT FITNESS",
      "aka_name": "XSPORT FITNESS",
      "facility_type": "Grocery Store",
      "risk": "Risk 3 (Low)",
      "address": "3212 N CENTRAL AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60634",
      "date": "03/17/2011",
      "inspection_type": "Canvass",
      "results": "Pass w/ Conditions",
      "violations": "21. * CERTIFIED FOOD MANAGER ON SITE WHEN POTENTIALLY HAZARDOUS FOODS ARE  PREPARED AND SERVED - Comments: No Certified Food Manager on premises when potentially hazardous foods are being served and prepared-smoothies with dairy products. Instructed that a certified food manager must be on premises during all hours of operation. Serious citation issued 7-38-012. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: Floors in storage room not cleaned or maintained. Instructed to detail clean and elevate supplies 6 inches or higher and away from wall.",
      "latitude": "41.93899704610903",
      "longitude": "-87.76666179291243",
      "location": "(-87.76666179291242, 41.93899704610903)"
    },
    {
      "inspection_id": "277275",
      "name": "PETRA MINI MART, INC.",
      "aka_name": "PETRA MINI MART",
      "facility_type": "Grocery Store",
      "risk": "Risk 2 (Medium)",
      "address": "2701 E 79TH ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60649",
      "date": "07/07/2010",
      "inspection_type": "License",
      "results": "Fail",
      "violations": "18. NO EVIDENCE OF RODENT OR INSECT OUTER OPENINGS PROTECTED/RODENT PROOFED, A WRITTEN LOG SHALL BE MAINTAINED AVAILABLE TO THE INSPECTORS - Comments: All necessary control measures shall be used to effectively minimize or eliminate the presence of rodents, roaches, and other vermin and insects on the premises of all food establishments, in food-transporting vehicles, and in vending machines.    NO LOG BOOK WITH NECESSARY DOCUMENTS FROM A LICENSED PEST CONTROL COMPANY; MUST PROVIDE A LOG BOOK WITH MSDS SHEETS, A COPY OF THE STATE LICENSE AND INVOICES/CONTRACT.  OBSERVED ABOUT TEN MOUSE DROPPINGS UNDER SHELVES ON SELLING FLOOR UNDER CHIPS; INSTRD. TO CLEAN AND REMOVE. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: The walls and ceilings shall be in good repair and easily cleaned.    SEAL LARGE HOLE IN WALL OF STORAGE ROOM.  PROVIDE WALL COVING AT LOWER WALL IN REAR STORAGE ROOM UNDER SINK AND BY CLOSET.  REATTACH COVING TO WASHROOM WALL. | 37. TOILET ROOM DOORS SELF CLOSING: DRESSING ROOMS WITH LOCKERS PROVIDED: COMPLETE SEPARATION FROM LIVING/SLEEPING QUARTERS - Comments: PROVIDE A SELF CLOSING DEVICE FOR WASHROOM DOOR. | 40. REFRIGERATION AND METAL STEM THERMOMETERS PROVIDED AND CONSPICUOUS - Comments: All food establishments that display, prepare, or store potentially hazardous foods shall have calibrated metal stem thermometers, provided and conspicuous, for refrigerated and hot food units.    PROVIDE THERMOMETERS FOR ALL REFRIGERATION UNITS AND FREEZERS. | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: All parts of the food establishment and all parts of the property used in connection with the operation of the establishment shall be kept neat and clean and should not produce any offensive odors.    REMOVE UNNECESSARY ITEMS FROM STORAGE TO AVOID CLUTTER.  REMOVE STOVE FROM REAR STORAGE.  ",
      "latitude": "41.751720377952616",
      "longitude": "-87.55893129286476",
      "location": "(-87.55893129286477, 41.751720377952616)"
    },
    {
      "inspection_id": "1447715",
      "name": "BELLWETHER MEETING HOUSE & EATERY",
      "aka_name": "BELLWETHER",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "302 E ILLINOIS ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60611",
      "date": "03/18/2015",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: OBSERVED DEBRIS ON FLOOR AT 2ND FL. DRY FOOD STORAGE AREA. MUST CLEAN. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: REPLACE MISSING CEILING TILES AT CEILING OF ENTRANCE TO KITCHEN/PREP AREA AND ON 2ND FL. | 36. LIGHTING: REQUIRED MINIMUM FOOT-CANDLES OF LIGHT PROVIDED, FIXTURES SHIELDED - Comments: BULBS BLOWN AT HOOD IN KITCHEN PREP AREA AT STOVE/GRILL. MUST PROVIDE. | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: REMOVE CLUTTER IN DRY FOOD STORAGE AREA AT 2ND FL. UNDER SHELVES AND DRY FOOD ITEMS ON SHELF. ORGANIZE AND MAINTAIN AT ALL TIMES.",
      "latitude": "41.891116359630644",
      "longitude": "-87.6200659573806",
      "location": "(-87.6200659573806, 41.89111635963065)"
    },
    {
      "inspection_id": "1199659",
      "name": "EJ SUSHI",
      "aka_name": "EJ SUSHI",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "131 N CLINTON ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60661",
      "date": "12/15/2014",
      "inspection_type": "Canvass",
      "results": "Fail",
      "violations": "2. FACILITIES TO MAINTAIN PROPER TEMPERATURE - Comments: FACILITIES UNABLE TO MAINTAIN PROPER TEMPERATURE. SUSHI DISPLAY COOLER FOUND AT 52F WITH FOOD SUCH AS RAW TUNA AT 54.8F. COOLER TAGGED HELD FOR INSPECTION AND MUST NOT USE UNTIL REPAIRED AND MAINTAINS A TEMPERATURE OF 40F. OR BELOW AND CDPH CONTACTED FOR RE-INSPECTION AND TAG REMOVAL. CRITICAL CITATION ISSUED 7-38-005(A). | 3. POTENTIALLY HAZARDOUS FOOD MEETS TEMPERATURE REQUIREMENT DURING STORAGE, PREPARATION DISPLAY AND SERVICE - Comments: THE FOLLOWING POTENTIALLY HAZARDOUS FOODS FOUND HELD IN THE ABOVE MENTIONED COOLER AT IMPROPER TEMPERATURES. RAW TUNA AT 54.8F, RAW YELLOW TAIL FISH AT 47.9F, CRAB AT 45.1F, SALMON AT 50.4F, COOKED SHRIMP AT 48.5F, COOKED EGG AT 50.3F. APPROXIMATELY 10 LBS AT AN ESTIMATED VALUE OF $250.00. ALL FOODS DISCARDED.CRITICAL CITATION ISSUED 7-38-005(A). | 8. SANITIZING RINSE FOR EQUIPMENT AND UTENSILS:  CLEAN, PROPER TEMPERATURE, CONCENTRATION, EXPOSURE TIME - Comments: OBSERVED EMPLOYEE NOT SANITIZING DISHES AFTER BEING WASHED. THREE COMPARTMENT SINK NOT PROPERLY SET TO WASH, RINSE AND SANITIZE. EMPLOYEE UNAWARE THAT CHLORINE IS TO BE USED TO SANITIZE ALL DISHES IN A FINAL RINSE AND UNABLE TO SET SINK PROPERLY. DEMONSTRATED AT THIS TIME THE PROPER WAY TO SET A THREE COMPARTMENT SINK USING CHLORINE AS A SANITIZER AND INSTRUCTED TO RE-WASH ALL DISHES. CRITICAL CITATION ISSUED 7-38-005(A). | 18. NO EVIDENCE OF RODENT OR INSECT OUTER OPENINGS PROTECTED/RODENT PROOFED, A WRITTEN LOG SHALL BE MAINTAINED AVAILABLE TO THE INSPECTORS - Comments: NO PEST CONTROL LOG ON THE PREMISES OR AVAILABLE DURING THIS INSPECTION. MUST PROVIDE A RECENT PEST CO. SERVICE INVOICE AND ALL OTHER REQUIRED DOCUMENTATION. SERIOUS CITATION ISSUED 7-38-020. | 21. * CERTIFIED FOOD MANAGER ON SITE WHEN POTENTIALLY HAZARDOUS FOODS ARE  PREPARED AND SERVED - Comments: NO CITY OF CHICAGO SANITATION CERTIFICATE POSTED ON THE PREMISES. CERTIFIED MANAGER ARRIVED ON SITE AFTER BEING TELEPHONED BY EMPLOYEE WITH CERTIFICATE IN WALLET. SERIOUS CITATION ISSUED. 7-38-012. | 29. PREVIOUS MINOR VIOLATION(S) CORRECTED 7-42-090 - Comments: PREVIOUS MINOR VIOLATION FROM 3-25-14 NOT CORRECTED. #41-MUST PROPERLY STORE ALL ITEMS 6 INCHES OFF THE FLOOR.   SERIOUS CITATION ISSUED 7-42-090.  | 30. FOOD IN ORIGINAL CONTAINER, PROPERLY LABELED: CUSTOMER ADVISORY POSTED AS NEEDED - Comments: BULK RICE CONTAINER MUST BE LABELED.  ALL PREPARED, READY TO EAT FOODS IE: SPICY MAYONNAISE, MUST BE LABELED AND DATED. | 32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: MUST NOT USE PLASTIC WRAP AS A LINER AT SUSHI PREP STATION. | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: DIRTY BULK RICE CONTAINER. MUST CLEAN AND MAINTAIN. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: FLOORS THROUGHOUT WITH DIRT AND DEBRIS. MUST CLEAN AND MAINTAIN. | 43. FOOD (ICE) DISPENSING UTENSILS, WASH CLOTHS PROPERLY STORED - Comments: WIPING CLOTHS MUST BE STORED IN A SANITIZING SOLUTION.",
      "latitude": "41.88418750712781",
      "longitude": "-87.64111966683218",
      "location": "(-87.64111966683218, 41.884187507127805)"
    },
    {
      "inspection_id": "2311809",
      "name": "REAL GOOD STUFF CO",
      "aka_name": "REAL GOOD STUFF CO",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "2355 N LINCOLN AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60614",
      "date": "09/05/2019",
      "inspection_type": "License Re-Inspection",
      "results": "Pass",
      "violations": "57. ALL FOOD EMPLOYEES HAVE FOOD HANDLER TRAINING - Comments: FOOD HANDLER REQUIREMENTS NOT MET. INFORMATION PROVIDED.",
      "latitude": "41.924934718635406",
      "longitude": "-87.6478328749538",
      "location": "(-87.6478328749538, 41.924934718635406)"
    },
    {
      "inspection_id": "2359530",
      "name": "MANNY'S TACOS & BURRITOS",
      "aka_name": "MANNY'S TACOS & BURRITOS",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "11545 S MICHIGAN AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60628",
      "date": "01/28/2020",
      "inspection_type": "Canvass",
      "results": "Pass w/ Conditions",
      "violations": "36. THERMOMETERS PROVIDED & ACCURATE - Comments: INSTRUCTED MANAGER TO PROVIDE AND MAINTAIN WORKING THERMOMETERS INSIDE ALL RIC AND PREP COOLER. | 37. FOOD PROPERLY LABELED; ORIGINAL CONTAINER - Comments: OBSERVED A FEW TCS FOOD AND TAMALES INSIDE THE REACH IN COOLER NOT PROPERLY LABELED. INSTRUCTED MANAGER TO LABEL PRODUCT WITH NAME,DATE AND/OR TIME. | 49. NON-FOOD/FOOD CONTACT SURFACES CLEAN - Comments: MUST CLEAN THE INTERIOR AND EXTERIOR OF ALL COOLERS AND FREEZERS TO REMOVE FOOD DEBRIS AND SPILLS. | 55. PHYSICAL FACILITIES INSTALLED, MAINTAINED & CLEAN - Comments: FLOORS NEED CLEANING THROUGH ALONG THE WALL BASE AND IN CORNER. ALSO FLOORS NEED CLEANING IN THE BASE UNDERNEATH THE PALLETS TO REMOVE SPILLS AND/OR DEBRIS. | 58. ALLERGEN TRAINING AS REQUIRED - Comments: SEE VIOLATION #60. | 60. PREVIOUS CORE VIOLATION CORRECTED - Comments: PREVIOUS CORE VIOLATION (58) ALLERGEN TRAINING NOT CORRECTED FROM REPORT #2252820 DATE 1-18-19.   Violation Codes: 2-102.13  Inspector Comments: PA 100-0367 OBSERVED CITY OF CHICAGO FOOD SERVICE SANITATION MANAGER WITHOUT THE REQUIRED ALLERGEN TRAINING. INSTRUCTED TO MEET REQUIREMENT.  PRIORITY FOUNDATION CITATION ISSUE #7-42-090.",
      "latitude": "41.68400844171807",
      "longitude": "-87.62055576815645",
      "location": "(-87.62055576815645, 41.68400844171807)"
    },
    {
      "inspection_id": "1277863",
      "name": "LOU MALNATIS PIZZERIA",
      "aka_name": "LOU MALNATIS PIZZERIA",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "1520 N DAMEN AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60622",
      "date": "05/24/2013",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: Floor along wallbase and under equipment not cleaned. Instructed to detail clean daily. | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: Supplies stored on floor in basement. Instructed to elevate all supplies 6 inches or higher and away from wall.",
      "latitude": "41.90892140028331",
      "longitude": "-87.67756779552343",
      "location": "(-87.67756779552343, 41.90892140028331)"
    },
    {
      "inspection_id": "1506747",
      "name": "MIKE'S PLACE",
      "aka_name": "MIKE'S PLACE",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "6977 N WESTERN AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60645",
      "date": "10/14/2015",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "30. FOOD IN ORIGINAL CONTAINER, PROPERLY LABELED: CUSTOMER ADVISORY POSTED AS NEEDED - Comments: Found some food items not properly dated in walk in cooler, must properly date food items in walk in cooler. | 32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: Walk in cooler shelving/racks that had peeling paint/rust, shall be repaired/replaced. | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: Walk in cooler shelving/racks not clean, need detailed cleaning(crevices). | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: Floors in walk in cooler under shelving/racks not clean, need cleaning(corners), floors under heavy equipment not clean, need cleaning.  Floors in bsmt storage areas not clean, need cleaning(corners). | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: Wall tiles that were damaged/broken by 3 compartment sink in kitchen area, shall be repaired/replaced. | 45. FOOD HANDLER REQUIREMENTS MET - Comments: must provide food handlers list for next routine inspection.",
      "latitude": "42.00853184627894",
      "longitude": "-87.69001159469369",
      "location": "(-87.69001159469369, 42.008531846278935)"
    },
    {
      "inspection_id": "1734984",
      "name": "GREAT EXPECTATIONS LEARNING ACADEMY INCORPORATED",
      "aka_name": "GREAT EXPECTATIONS LEARNING ACADEMY",
      "facility_type": "Children's Services Facility",
      "risk": "Risk 1 (High)",
      "address": "2800 W ROOSEVELT RD ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60612",
      "date": "03/29/2016",
      "inspection_type": "Canvass",
      "results": "Pass w/ Conditions",
      "violations": "9. WATER SOURCE: SAFE, HOT & COLD UNDER CITY PRESSURE - Comments: FOUND NO HOT WATER PER CITY CODE AT ANY OF THE SINKS, TEMPERATURE RANGED FROM 48.5F-52.1F. INSTRUCTED TO PROVIDE HOT WATER TO THE SINKS AND MAINTAIN AT ALL TIMES. CRITICAL VIOLATION 7-38-030 | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: INSTRUCTED TO CLEAN AND MAINTAIN FLOORS IN ALL CORNERS AND UNDER/AROUND ALL HEAVY EQUIPMENT. | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: INSTRUCTED TO PROVIDE A BACK FLOW PREVENTION DEVICE TO THE MOP SINK AND MAINTAIN.    INSTRUCTED TO REMOVE PORTABLE HAND SINK FROM PREMISES, ALL SINKS MUST  PROPERLY CONNECT TO THE CITY WATER SUPPY.",
      "latitude": "41.86661965174332",
      "longitude": "-87.69597101435787",
      "location": "(-87.69597101435788, 41.86661965174332)"
    },
    {
      "inspection_id": "1395211",
      "name": "SUBWAY",
      "aka_name": "SUBWAY",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "55 E RANDOLPH ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60601",
      "date": "12/30/2013",
      "inspection_type": "Canvass",
      "results": "Out of Business",
      "violations": "",
      "latitude": "41.8843876187293",
      "longitude": "-87.62586884949191",
      "location": "(-87.62586884949191, 41.8843876187293)"
    },
    {
      "inspection_id": "1300656",
      "name": "SUBWAY",
      "aka_name": "SUBWAY",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "3129 W ARMITAGE AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60647",
      "date": "11/16/2012",
      "inspection_type": "Canvass",
      "results": "Out of Business",
      "violations": "",
      "latitude": "41.91729424455668",
      "longitude": "-87.70654528949484",
      "location": "(-87.70654528949485, 41.91729424455668)"
    },
    {
      "inspection_id": "2200609",
      "name": "WALMART #5402",
      "aka_name": "WAL-MART",
      "facility_type": "Grocery Store",
      "risk": "Risk 1 (High)",
      "address": "4650 W NORTH AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60639",
      "date": "08/07/2018",
      "inspection_type": "Complaint Re-Inspection",
      "results": "Fail",
      "violations": "3. MANAGEMENT, FOOD EMPLOYEE AND CONDITIONAL EMPLOYEE; KNOWLEDGE, RESPONSIBILITIES AND REPORTING - Comments: NO EMPLOYEE HEALTH POLICY ON SITE. MUST PROVIDE. PRIORITY FOUNDATION VIOLATION#: 7-38-012(a) NO CITATION ISSUED.  | 5. PROCEDURES FOR RESPONDING TO VOMITING AND DIARRHEAL EVENTS - Comments: NO VOMITOUS AND DIARRHEAL INCIDENT CLEAN UP POLICY AND KIT ON SITE. MUST PROVIDE. PRIORITY FOUNDATION VIOLATION#: 7-38-005  NO CITATION ISSUED  | 36. THERMOMETERS PROVIDED & ACCURATE - Comments: MUST PROVIDE A TEMPERATURE MEASURING DEVICE INSIDE ALL COOLERS, AND HOT HOLD UNITS.  PRIORITY FOUNDATION VIOLATION#: 7-38-005.  NO CITATION ISSUED. | 38. INSECTS, RODENTS, & ANIMALS NOT PRESENT - Comments: SEE VIOLATION 59 | 38. INSECTS, RODENTS, & ANIMALS NOT PRESENT - Comments: MUST SEAL ALL GAPS/ OPENINGS IN THE FACILITY AND IN THE MAIN ENTRANCE DOORS AND THE UPSTAIRS ROOF ACCESS DOOR TO PROTECT AGAINST THE ENTRY OF PESTS.  | 47. FOOD & NON-FOOD CONTACT SURFACES CLEANABLE, PROPERLY DESIGNED, CONSTRUCTED & USED - Comments: OBSERVED CARDBOARD BEING USED AS SHELF LINER. MUST REMOVE AND PROVIDE A NON-POROUS, CORROSION-RESISTANT, SMOOTH, EASILY CLEANABLE SURFACE. OBSERVED PALLETS BEING USED AS SHELVING. MUST REMOVE AND PROVIDE A NON-POROUS, CORROSION-RESISTANT, SMOOTH, EASILY CLEANABLE SURFACE THAT IS 6' OFF THE FLOOR AND PROVIDES FLOOR ACCESSIBILITY TO ENSURE ADEQUATE FACILITY CLEANING.   | 47. FOOD & NON-FOOD CONTACT SURFACES CLEANABLE, PROPERLY DESIGNED, CONSTRUCTED & USED - Comments: OBSERVED THE CUTTING BOARDS IN THE PRODUCE PREP AREA, AND THE MEAT PREP AREA WITH DEEP BLACK GROOVES. MUST RESURFACE OR REPLACE. | 47. FOOD & NON-FOOD CONTACT SURFACES CLEANABLE, PROPERLY DESIGNED, CONSTRUCTED & USED - Comments: OBSERVED RUST ON THE SURFACE OF THE HOT HOLD UNITS IN THE DELI AREA. MUST REMOVE RUST AND PROVIDE A NON-POROUS, CORROSION-RESISTANT, SMOOTH, EASILY CLEANABLE SURFACE. | 49. NON-FOOD/FOOD CONTACT SURFACES CLEAN - Comments: MUST DETAIL CLEAN INSIDE THE HOT HOLD UNIT IN THE DELI AREA, INSIDE THE FRYER CABINETS, THE EXTERIOR OF THE GREASE TRANSPORTER, AND INSIDE BOTTOM AREA OF THE BACKSIDE OF THE BAKERY DISPLAY UNIT. | 51. PLUMBING INSTALLED; PROPER BACKFLOW DEVICES - Comments: ALL SINKS IN WHICH FOOD, UTENSILS, AND EQUIPMENT ARE USED, SHALL BE CONNECTED TO A CATCH-BASIN OR BE EQUIPPED WITH A GREASE TRAP/INTERCEPTOR. MUST PROVIDE BY RE-INSPECTION. | 51. PLUMBING INSTALLED; PROPER BACKFLOW DEVICES - Comments: OBSERVED A SLIGHT LEAK FROM A PIPE INSIDE THE UTILITY ROOM BY THE DELI. MUST REPAIR AND MAINTAIN. | 55. PHYSICAL FACILITIES INSTALLED, MAINTAINED & CLEAN - Comments: MUST DETAIL CLEAN THE FOLLOWING AREAS: INSIDE THE WALK IN FROZEN GOODS FREEZER, THE CONDENSER UNIT OF THE WALK IN FROZEN GOODS FREEZER, THE FLOOR INSIDE THE MILK DISPLAY AREA, AND UNDER ALL SHELVING IN THE GROCERY SHOPPING AREAS. ALONG THE FLOOR OF THE ENTIRE BACK AREA. ALONG THE FLOOR OF THE ENTIRE UPSTAIRS AREA.  | 55. PHYSICAL FACILITIES INSTALLED, MAINTAINED & CLEAN - Comments: MUST REPLACE FAN COVER IN THE MEAT WALK IN COOLER. MUST REPAIR THE FANS IN THE DELI WALK IN COOLER. MUST REPLACE MISSING CEILING TILE IN THE BAKERY. MUST SEAL ANY GAPS OR OPENINGS BY PIPES AND IN THE WALLS. | 57. ALL FOOD EMPLOYEES HAVE FOOD HANDLER TRAINING - Comments: MUST PROVIDE FOOD HANDLER'S TRAINING CERTIFICATES | 59. PREVIOUS PRIORITY FOUNDATION VIOLATION CORRECTED - Comments: OBSERVED PRIORITY FOUNDATION VIOLATION#: 7-38-020(A) NOT CORRECTED FROM THE LAST INSPECTION ON 7/31/18. VIOLATION STATES: 'OBSERVED EVIDENCE OF PEST ACTIVITY ON SITE AT TIME OF INSPECTION. OBSERVED APROX 60 RODENT DROPPINGS ON THE FLOOR ALONG THE WALLS AND ON THE SHELVES IN THE BACK NONFOOD DRY GOODS AREA, APROX 100 DROPPINGS ON THE FLOOR ALONG THE WALLS AND ON THE SHELVES IN THE BACK DRY FOOD STORAGE AREA, APROX 25 DROPPINGS ON THE FLOOR BY THE HOT WATER TANK, APROX 60 DROPPINGS ON THE FLOOR ALONG THE WALLS AND ON THE SHELVES IN THE UPSTAIRS AREA, AND APROX 35 DROPPINGS UNDER THE SHELVES OF THE CEREAL, SNACK FOODS (CHIPS) AND DOG/CAT/BIRD FOOD AREAS, APROX 100 DROPPINGS ALONG THE WALL OF THE DOG FOOD AND TOILET PAPER SHELVES. APROX 25 DROPPINGS IN THE BAKERY AREA. COULD NOT OBSERVE ADDITIONAL EVIDENCE DUE TO EXCESSIVE EQUIPMENT AND ARTICLES BLOCKING ACCESS. OBSERVED AN ACCUMULATION OF APROX 10 FLIES THROUGHOUT FOOD ESTABLISHMENT.   OBSERVED EXCESSIVE DIRT/FOOD DEBRIS ON THE FLOOR THROUGHOUT THE AREAS WHERE EVIDENCE OF PEST ACTIVITY WAS FOUND.   MUST REMOVE ALL DROPPINGS AND FOOD/DIRT DEBRIS, CLEAN, SANITIZE AND MAINTAIN AREAS. FACILITY HAS BEEN ADVISED TO CONTACT THE PEST CONTROL PROVIDER FOR FURTHER SERVICE.   PRIORITY VIOLATION#: 7-42-090",
      "latitude": "41.90976452703277",
      "longitude": "-87.74337629570627",
      "location": "(-87.74337629570627, 41.90976452703277)"
    },
    {
      "inspection_id": "657322",
      "name": "TILL",
      "aka_name": "TILL (NORTH BLDG)",
      "facility_type": "School",
      "risk": "Risk 3 (Low)",
      "address": "6543 S Champlain (635E) ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60637",
      "date": "11/01/2011",
      "inspection_type": "Canvass",
      "results": "Pass w/ Conditions",
      "violations": "26. ADEQUATE NUMBER, CONVENIENT, ACCESSIBLE, PROPERLY DESIGNED AND INSTALLED - Comments: FOUND GIRLS AND BOYS USING 1ST. FLOOR TOILET ROOM FACILITIES WITH NO SOAP TO PROPERLY WASH HANDS PER CITY CODE. ALSO, NO SOAP AND PAPER TOWELS IN PRE-K TOILET ROOM. INSTRUCTED TO PROVIDE SOAP AND PAPER TOWELS AT ALL TIMES FOR STUDENTS TO PROPERLY WASH HANDS. MAINTAINENCE EMPLOYEE PROVIDED SOAP AND PAPER TOWELS AT THIS TIME. SERIOUS 7-38-030. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: The floors shall be constructed per code, be smooth and easily cleaned, and be kept clean and in good repair.    PROVIDE FLOOR TILES FOR MISSING SECTIONS BEHIND GREASE TRAP IN KITCHEN. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: CLEAN FAN GUARDS INSIDE UPRIGHT REFRIGERATION UNITS IN KITCHEN AND VENT IN PRE K TOILET ROOM. CLEAN SPILLS AND STAINS AT CEILING AND WINDOW LEDGES IN LUNCHROOM. REPAIR CEILING SECTION IN GIRLS TOILET ROOM ON 1ST. FLOOR. | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: NO COLD WATER IN TEACHER STAFF TOILET ROOM ON 1ST. FLOOR. INSTRUCTED TO REPAIR. LOW HOT WATER PRESSURE AT FAUCET AT THIRD COMPARTMENT OF THREE COMPARTMENT SINK. INSTRUCTED TO INCREASE HOT WATER PRESSURE. | 40. REFRIGERATION AND METAL STEM THERMOMETERS PROVIDED AND CONSPICUOUS - Comments: PROVIDE INTERNAL THERMOMETER FOR DAIRY COOLER IN KITCHEN.",
      "latitude": "41.77544062472892",
      "longitude": "-87.60932094741847",
      "location": "(-87.60932094741847, 41.775440624728915)"
    },
    {
      "inspection_id": "2082000",
      "name": "BNL's PIZZA & POKE",
      "aka_name": "BNL's PIZZA & POKE",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "926 W DIVERSEY PKWY ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60614",
      "date": "09/13/2017",
      "inspection_type": "License",
      "results": "Fail",
      "violations": "19. OUTSIDE GARBAGE WASTE GREASE AND STORAGE AREA; CLEAN, RODENT PROOF, ALL CONTAINERS COVERED - Comments: NO OUTSIDE GARBAGE DUMPSTER OR PROOF OF DUMPSTER SERVICE FOR BUSINESS. INSTRUCTED TO PROVIDE DUMPSTER AND PROOF OF SERVICE. SERIOUS VIOLATION 7-38-020. | 22. DISH MACHINES: PROVIDED WITH ACCURATE THERMOMETERS, CHEMICAL TEST KITS AND SUITABLE GAUGE COCK - Comments: NO SANITIZING TEST KIT ON SITE. INSTRUCTED TO KEEP TEST KIT ON SITE AT ALL TIMES TO TEST SANITIZER IN 3-COMP SINK. SERIOUS VIOLATION 7-38-030. | 32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: MUST REMOVE RUST FROM EXTERIOR OF GREASE TRAP UNDER 3-COMP SINK IN REAR PREP AREA. INSTRUCTED TO MAINTAIN. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: MUST DETAIL CLEAN FLOORS UNDER 3-COMP SINK AND AROUND MOP SINK IN REAR PREP AREA. CLEAN DEBRIS FROM FLOOR IN REAR OFFICE. INSTRUCTED TO MAINTAIN. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: MUST REPAIR/REPLACE STAINED CEILING TILES IN REAR PREP. DETAIL CLEAN DRIED FOOD FROM WALLS IN REAR PREP. CLEAN DUST ACCUMULATION FROM FAN GUARDS IN WALK IN COOLER. INSTRUCTED TO MAINTAIN. | 36. LIGHTING: REQUIRED MINIMUM FOOT-CANDLES OF LIGHT PROVIDED, FIXTURES SHIELDED - Comments: MUST CLEAN UNKNOWN DEBRIS FROM LIGHT SHIELDS IN REAR PREP AREA. INSTRUCTED TO MAINTAIN. | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: FOUL ODOR FROM FLOOR DRAIN IN REAR PREP AREA. INSTRUCTED TO CLEAN, AND HAVE DRAIN (PLUMBING) SERVICED. INSTRUCTED TO MAINTAIN.",
      "latitude": "41.93277107333041",
      "longitude": "-87.6525056472966",
      "location": "(-87.65250564729659, 41.93277107333041)"
    },
    {
      "inspection_id": "2321090",
      "name": "POPEYES",
      "aka_name": "POPEYES",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "5353 N HARLEM AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60656",
      "date": "11/05/2019",
      "inspection_type": "Complaint",
      "results": "Fail",
      "violations": "38. INSECTS, RODENTS, & ANIMALS NOT PRESENT - Comments: FOUND EVIDENCE OF COCKROACH ACTIVITY IN THE FOLLOWING AREAS (1) LIVE COCKROACH CRAWLING ON FLOOR UNDERNEATH THE FREEZER UNIT AND (1) LIVE COCKROACH BEHIND THE HOT HOLDING UNIT AT REAR FOOD PREP AREA AND 1 LIVE COCKROACH CRAWLING UNDERNEATH THE REAR HOT WATER TANK UNIT SHOWED MANAGER ALSO,APPROXIMATELY 20 LIVE FRUIT FLIES WERE OBSERVED ON THE WALLS, CEILING IN CUSTOMER AREA NEAR THE WASHROOMS.INSTRUCTED TO DETAIL CLEAN AND SANITIZE ALL AFFECTED AREAS AND PEST CONTROL SERVICE IS NOW RECCOMENDED.PRIORITY FOUNDATION VIOLATION 7-38-020(A),CITATION ISSUED.  | 47. FOOD & NON-FOOD CONTACT SURFACES CLEANABLE, PROPERLY DESIGNED, CONSTRUCTED & USED - Comments: FOUND TORN DOOR GASKET INSIDE OF THE PREP COOLER AT FRONT CHICKEN HOT HOLDING STATION. MANAGEMENT INSTRUCTED TO REPLACE THE TORN DOOR GASKET AND TO MAINTAIN. | 49. NON-FOOD/FOOD CONTACT SURFACES CLEAN - Comments: INSTRUCTED TO DETAIL CLEAN SIDES OF HOT COOKING EQUIPMENTS AND CHICKEN COLD HOLDING UNITS AND KITCHEN STORAGE SHELFS ALSO,SIDES OF DEEP FRYERS TO REMOVE DRIED UP FOOD SPLASHED DEBRIS SHOWED MANAGER AND TO MAINTAIN. | 51. PLUMBING INSTALLED; PROPER BACKFLOW DEVICES - Comments: FOUND SMALL WATER LEAK AT DRAIN PIPE UNDERNEATH THE HAND SINK AT FRONT FOOD PREP AREA AND SLOW DRAINING HAND SINK AT MENS WASHROOM.INSTRUCTED TO REPAIR PLUMBING ISSUES AND TO MAINTAIN. | 54. GARBAGE & REFUSE PROPERLY DISPOSED; FACILITIES MAINTAINED - Comments: FOUND OUTSIDE GARBAGE DUMPSTER OVERFLOWING WITH BAGS OF FOOD WASTE AND  PREVENTING PROPER LID CLOSURES. INSTRUCTED TO ALWAYS HAVE DUMPSTER LID CLOSED TO PREVENT FOOD SOURCE FOR PESTS. PRIORITY FOUNDATION VIOLATION 7-38-020(B),CITATION ISSUED. | 55. PHYSICAL FACILITIES INSTALLED, MAINTAINED & CLEAN - Comments: INSTRUCTED TO DETAIL CLEAN AND ORGANIZE REAR DRY STORAGE AREA AND REMOVE UNNECESSARY ARTICLES UNDER MENTIONED SHELFS DUE TO POTENTIAL PEST HARBORAGE ALSO,EMPLOYEE BELONGINGS MUST BE STORED IN A DESIGNATED AREA NOT ON DRY STORAGE SHELF AND BLUE PEPSI RACKS MUST NOT BE USED FOR STORING OF FOOD STOCK SUPPLIES. MUST PROVIDE PROPER RAISED SHELFS AT LEAST 6' INCHES OFF THE FLOOR FOR EASIER CLEANING.  | 55. PHYSICAL FACILITIES INSTALLED, MAINTAINED & CLEAN - Comments: INSTRUCTED TO REMOVE DUSTS ACCUMULATIONS ON MONITOR MENU BOARDS AT FRONT PREP AREA  AND DETAIL CLEAN WALLS AND CEILINGS INSIDE THE WALK-IN-COOLER TO REMOVE DUSTS AND FOOD DEBRIS SPILLAGES SHOWED MANAGER AND TO MAINTAIN. | 55. PHYSICAL FACILITIES INSTALLED, MAINTAINED & CLEAN - Comments: FOUND EXCESSIVE FOOD DEBRIS ETC. UNDERNEATH THE CHICKEN HOT HOLDING STATION AT FRONT FOOD PREP AREA.MUST CLEAN FLOORS IN DETAIL AND MAINTAIN. | 55. PHYSICAL FACILITIES INSTALLED, MAINTAINED & CLEAN - Comments: FOUND MISSING COVING WALL TILE ALONG WALL BASE UNDERNEATH THE CHICKEN COLD HOLDING UNIT AT REAR FOOD PREP AREA AND LOOSE WALL TILES UNDERNEATH THE 3 COMPARTMENT SINK AREA ALSO,NOTICEABLE OPENINGS AROUND THE ELECTRICAL PIPES AT CEILING REAR FOOD PREP AREA AND THE REAR DISH WASHING 3 COMPARTMENT SINK AREA/DRY STORAGE AREA SHOWED MANAGER.MUST REPAIR AND MAINTAIN. | 56. ADEQUATE VENTILATION & LIGHTING; DESIGNATED AREAS USED - Comments: FOUND MECHANICAL VENTILATION INSIDE THE WOMENS WASHROOM NOT WORKING.MUST REPAIR AND MAINTAIN. | 56. ADEQUATE VENTILATION & LIGHTING; DESIGNATED AREAS USED - Comments: INSTRUCTED TO CLEAN AND SANITIZE INTERIORS OF LIGHT SHIELDS IN REAR FOOD PREP AREA TO REMOVE DEAD INSECTS AND TO MAINTAIN. | 56. ADEQUATE VENTILATION & LIGHTING; DESIGNATED AREAS USED - Comments: FOUND BURNT OUT LIGHT BULBS AT REAR OVER THE 3 COMPARTMENT SINK AREA.INSTRUCTED TO REPLACE BURNT-OUT LIGHT BULBS SHOWED MANAGER AND MAINTAIN ADEQUATE LIGHTING AT ALL TIMES.",
      "latitude": "41.97862919293747",
      "longitude": "-87.80684493423499",
      "location": "(-87.80684493423499, 41.97862919293747)"
    },
    {
      "inspection_id": "1146498",
      "name": "PIZZA HUT #405192",
      "aka_name": "PIZZA HUT #405192",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "1601 N WESTERN AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60647",
      "date": "08/20/2013",
      "inspection_type": "Canvass",
      "results": "Pass w/ Conditions",
      "violations": "16. FOOD PROTECTED DURING STORAGE, PREPARATION, DISPLAY, SERVICE AND TRANSPORTATION - Comments: OBSERVED EXECESSIVE AMOUNTS OF BLACK SLIMY SUBSTANCE INSIDE THE ICE MACHINE WHERE ICE IS BEING MADE ,MACHINE WILL BE TAGED MUST FAX A LETTER FOR TAG REMOVAL WHEN UNIT IS CLEANED AND SANITIZED FAX# 312 746-4240 ATTENTION,SUPERVISOR CITATION ISSUED 7-38-005(A) | 36. LIGHTING: REQUIRED MINIMUM FOOT-CANDLES OF LIGHT PROVIDED, FIXTURES SHIELDED - Comments: SOME LIGHT SHIELD COVERS ARE MISSING IN THE PREP AREA,MUST INSTALL | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: CLEAN THE VENTS INSIDE WASHROOMS OF DUST BUILD-UP | 40. REFRIGERATION AND METAL STEM THERMOMETERS PROVIDED AND CONSPICUOUS - Comments: MUST PROVIDE A THERMOMETER INSIDE THE WALK-IN COOLER IN REAR OF PREMISES",
      "latitude": "41.91041383474296",
      "longitude": "-87.68707644099922",
      "location": "(-87.68707644099922, 41.910413834742954)"
    },
    {
      "inspection_id": "2060096",
      "name": "MCCORMICK & SCHMICK'S SEAFOOD RESTAURANT",
      "aka_name": "MCCORMICK & SCHMICK'S SEAFOOD RESTAURANT",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "41 E CHESTNUT ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60611",
      "date": "06/12/2017",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "31. CLEAN MULTI-USE UTENSILS AND SINGLE SERVICE ARTICLES PROPERLY STORED: NO REUSE OF SINGLE SERVICE ARTICLES - Comments: CLEAN CUTTING BOARD STORED ON FLOOR, UTENSILS STORED IN A STANDING WATER, INSTRUCTED TO KEEP AT A DRY CLEAN SURFACE. | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: SODA GUN DISPENSERS AT BAR NOT CLEAN INSIDE, INSTRUCTED TO CLEAN AND MAINTAIN. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: STANDING WATER AT 2ND FLOOR  KITCHEN, INSTRUCTED TO KEEP DRY AS POSSIBLE. | 36. LIGHTING: REQUIRED MINIMUM FOOT-CANDLES OF LIGHT PROVIDED, FIXTURES SHIELDED - Comments: MISSING A LIGHT SHIELD AT CEILING LIGHT FIXTURE AT 1ST FL KITCHEN, INSTRUCTED TO INSTALL.",
      "latitude": "41.89824130050376",
      "longitude": "-87.62663176178728",
      "location": "(-87.62663176178728, 41.898241300503756)"
    },
    {
      "inspection_id": "2282476",
      "name": "LA FLOR DE MEXICO RESTARANT",
      "aka_name": "LA FLOR DE MEXICO RESTARANT",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "2156 W 23RD ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60608",
      "date": "04/02/2019",
      "inspection_type": "Canvass",
      "results": "No Entry",
      "violations": "",
      "latitude": "41.85040047811208",
      "longitude": "-87.68049568523732",
      "location": "(-87.68049568523732, 41.85040047811208)"
    },
    {
      "inspection_id": "1464436",
      "name": "EGANS TAVERN",
      "aka_name": "EGANS TAVERN",
      "facility_type": "",
      "risk": "Risk 3 (Low)",
      "address": "6001 N PAULINA ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60660",
      "date": "08/26/2014",
      "inspection_type": "Canvass",
      "results": "Out of Business",
      "violations": "",
      "latitude": "41.99087180479504",
      "longitude": "-87.67163250929615",
      "location": "(-87.67163250929616, 41.990871804795034)"
    },
    {
      "inspection_id": "1419119",
      "name": "FROYO CHICAGO CORPORATION",
      "aka_name": "FROYO",
      "facility_type": "Restaurant",
      "risk": "Risk 2 (Medium)",
      "address": "233 N MICHIGAN AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60601",
      "date": "10/22/2015",
      "inspection_type": "Canvass Re-Inspection",
      "results": "Pass",
      "violations": "34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: MUST ALWAYS MAINTAIN FLOORS CLEAN AND DRY AT ALL TIMES. FOUND PUDDLING WATER UNDER THE YOGURT MACHINES IN THE REAR AREA. ALSO FOUND FLOOR DIRTY AT ABOVE STATED AREAS. MUST CLEAN AND SANITIZE TO PREVENT PEST BREEDING.   | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments:  MUST REPAIR LEAKING WATER LINES THE MIDDLE THREE YOGURT MACHINES CAUSING WATER LEAKS AND SPILLS ON THE FLOOR IN THE REAR AREA.",
      "latitude": "41.886567370886944",
      "longitude": "-87.62438467059714",
      "location": "(-87.62438467059714, 41.886567370886944)"
    },
    {
      "inspection_id": "2213668",
      "name": "CAKE SWEEK FOOD CHICAGO - THE HOUSE CAFE",
      "aka_name": "THE HOUSE CAFE",
      "facility_type": "Restaurant",
      "risk": "Risk 2 (Medium)",
      "address": "3208 N SHEFFIELD AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60657",
      "date": "08/29/2018",
      "inspection_type": "Canvass",
      "results": "Out of Business",
      "violations": "",
      "latitude": "41.94022813675411",
      "longitude": "-87.65426348817664",
      "location": "(-87.65426348817662, 41.94022813675411)"
    },
    {
      "inspection_id": "2370289",
      "name": "SLTAN'S",
      "aka_name": "SULTAN'S MARKET",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "2521 N CLARK ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60614",
      "date": "08/12/2013",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: RUSTY SHELVING INSIDE FRONT PREP COOLERS MUST REPAINT OR REPLACE. | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: REPAIR LEAKY HANDLE AT 3-COMPARTMENT SINK IN BASEMENT FOOD PREP AREA. | 40. REFRIGERATION AND METAL STEM THERMOMETERS PROVIDED AND CONSPICUOUS - Comments: MUST PROVIDE VISIBLE AND WORKING THERMOMETERS IN ALL COOLERS.",
      "latitude": "41.92843345875714",
      "longitude": "-87.6420123691349",
      "location": "(-87.6420123691349, 41.92843345875714)"
    },
    {
      "inspection_id": "2289029",
      "name": "KIDDIE KARE PRE SCHOOL",
      "aka_name": "KIDDIE KARE PRE SCHOOL",
      "facility_type": "Children's Services Facility",
      "risk": "Risk 1 (High)",
      "address": "4444-46 S KEDZIE AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60632",
      "date": "05/17/2019",
      "inspection_type": "License",
      "results": "Pass w/ Conditions",
      "violations": "5. PROCEDURES FOR RESPONDING TO VOMITING AND DIARRHEAL EVENTS - Comments: OBSERVED INCOMPLETE VOMIT/DIARRHEA CLEAN UP KIT. INSTRUCTED MUST PROVIDE A DISINFECTANT EFFECTIVE AGAINST NOROVIRUS. PRIORITY FOUNDATION VIOLATION. NO CITATION ISSUED. ",
      "latitude": "41.81228309980601",
      "longitude": "-87.70428564664036",
      "location": "(-87.70428564664036, 41.81228309980601)"
    },
    {
      "inspection_id": "2370284",
      "name": "CHICAGO'S HOME OF CHICKEN & WAFFLES",
      "aka_name": "CHICAGO'S HOME OF CHICKEN & WAFFLES",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "3947 S  MARTIN LUTHER KING JR",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60653",
      "date": "09/01/2016",
      "inspection_type": "Canvass Re-Inspection",
      "results": "Pass",
      "violations": "33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: MUST CLEAN AND MAINTAIN THE FOLLOWING EQUIPMENT: INTERIORS OF REFRIGERATION UNITS, EXTERIOR SURFACES OF COOKING EQUIPMENT, INTERIORS OF FRYERS TO REMOVE GREASE, ETC. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: MUST KEEP FLOORS DRY IN PREP AREAS. STANDING WATER OBSERVED IN VARIOUS AREAS UNDER AND AROUND EQUIPMENT. MUST CLEAN FLOOR DRAINS TO REMOVE BUILD UP. CLEAN FLOORS AROUND AND BEHIND ALL EQUIPMENT IN KITCHEN, BEVERAGE STATION AND STORAGE AREAS. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: MUST CLEAN WALLS AROUND AND BEHIND EQUIPMENT WHERE NEEDED AND LIGHT SHIELDS IN KITCHEN AND DISHWASHING AREA.",
      "latitude": "41.82254785730014",
      "longitude": "-87.61681561837467",
      "location": "(-87.61681561837467, 41.82254785730014)"
    },
    {
      "inspection_id": "2370288",
      "name": "BUTTERFLY SUSHI BAR AND THAI CUISINE ON MADISON ST",
      "aka_name": "BUTTERFLY SUSHI BAR",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "1131 MADISON ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60607",
      "date": "12/01/2016",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "",
      "latitude": "41.88153575239758",
      "longitude": "-87.65558048597315",
      "location": "(-87.65558048597315, 41.881535752397575)"
    },
    {
      "inspection_id": "2223191",
      "name": "SD LIQUOR INC.",
      "aka_name": "SD LIQUOR INC.",
      "facility_type": "Liquor",
      "risk": "Risk 3 (Low)",
      "address": "8058 S RACINE AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60620",
      "date": "10/01/2018",
      "inspection_type": "Short Form Complaint",
      "results": "Fail",
      "violations": "10. ADEQUATE HANDWASHING SINKS PROPERLY SUPPLIED AND ACCESSIBLE - Comments: 5-202.12 NO HOT WATER AT HAND SINK AT WASHROOM. HOT WATER IMPROPER TEMPERATURE 80.F INSTRUCTED THAT HOT WATER TEMPERATURE MUST BE 100.F. INSTRUCTED TO REPAIR. PRIORITY FOUNDATION 7-38-030(C)",
      "latitude": "41.746947565686405",
      "longitude": "-87.65378788890766",
      "location": "(-87.65378788890766, 41.74694756568641)"
    },
    {
      "inspection_id": "1305440",
      "name": "7-ELEVEN",
      "aka_name": "7-ELEVEN",
      "facility_type": "Grocery Store",
      "risk": "Risk 2 (Medium)",
      "address": "5953 W 63RD ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60638",
      "date": "10/10/2013",
      "inspection_type": "Short Form Complaint",
      "results": "Pass",
      "violations": "33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: REPAIR LEAKING SYRUP DISPENSER IN REAR.",
      "latitude": "41.77775753872336",
      "longitude": "-87.77119396819958",
      "location": "(-87.77119396819958, 41.77775753872336)"
    },
    {
      "inspection_id": "1386092",
      "name": "MC DONALDS",
      "aka_name": "MC DONALDS",
      "facility_type": "Restaurant",
      "risk": "Risk 2 (Medium)",
      "address": "7900 S DR MARTIN LUTHER KING JR DR ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60619",
      "date": "04/16/2015",
      "inspection_type": "Complaint Re-Inspection",
      "results": "Pass",
      "violations": "",
      "latitude": "41.75102047068192",
      "longitude": "-87.615102245534",
      "location": "(-87.615102245534, 41.751020470681915)"
    },
    {
      "inspection_id": "2170182",
      "name": "PUNTA CANA RESTAURANT INC.",
      "aka_name": "PUNTA CANA RESTAURANT INC.",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "2200 N KIMBALL AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60647",
      "date": "05/23/2018",
      "inspection_type": "Complaint",
      "results": "Fail",
      "violations": "18. NO EVIDENCE OF RODENT OR INSECT OUTER OPENINGS PROTECTED/RODENT PROOFED, A WRITTEN LOG SHALL BE MAINTAINED AVAILABLE TO THE INSPECTORS - Comments: Observed 20 mouse droppings along both sides of the basement wall that separates the side behind the freezers and the side near the walk in cooler. Also found 15 mouse droppings in the first floor furnace closet. Instructed facility to remove all pests and evidence, clean affected areas, and maintain. Recommended to contact a licensed pest control provider for service. Serious violation 7-38-020. | 29. PREVIOUS MINOR VIOLATION(S) CORRECTED 7-42-090 - Comments: Previous minor violation not corrected from report # 2082020, dated 9-13-17: Violation 38- 'EXPOSED HAND WASHING SINK NEEDED IN FRONT KITCHEN PREP AREA. MUST INSTALL SINK WITH HOT AND COLD RUNNING WATER.' Instructed to comply and maintain. Serious violation 7-42-090. | 32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: Observed deep, dark grooves in the large square cutting board on the rolling cart in the rear prep area. Instructed facility to replace/repair and maintain.  Observed torn refrigeration gaskets on the tall 2 door cooler in the rear prep area. Instructed facility to replace and maintain. | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: Observed dirt accumulated in the refrigeration gaskets at the front prep 2 door cooler. Instructed facility to clean and maintain. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: Observed dirt and food debris on the floors throughout facility: under and around equipment and along wall bases. Instructed facility to clean and maintain. | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: Observed clutter in the basement near the 2 chest freezers. Instructed facility to remove any unnecessary items, organize remaining, and maintain at least six inches off floors and walls.",
      "latitude": "41.921045051664414",
      "longitude": "-87.71214152490884",
      "location": "(-87.71214152490884, 41.921045051664414)"
    },
    {
      "inspection_id": "2051068",
      "name": "DUNKIN DONUTS",
      "aka_name": "DUNKIN DONUTS",
      "facility_type": "Restaurant",
      "risk": "Risk 2 (Medium)",
      "address": "27 E LAKE ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60601",
      "date": "05/25/2017",
      "inspection_type": "Complaint",
      "results": "Fail",
      "violations": "18. NO EVIDENCE OF RODENT OR INSECT OUTER OPENINGS PROTECTED/RODENT PROOFED, A WRITTEN LOG SHALL BE MAINTAINED AVAILABLE TO THE INSPECTORS - Comments: OBSERVED 10 SMALL HOUSE FLIES AND 1 LARGE HOUSE FLY ON THE CEILING LOCATED IN THE CUSTOMER DINING AREA. INSTRUCTED TO CLEAN AND SANITIZE AFFECTED AREAS AND RECOMMENDED CONTACTING PEST CONTROL FOR SERVICE. SERIOUS VIOLATION 7-38-020. | 32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: OBSERVED CUTTING BOARDS WITH DARK GROOVES ATTACHED TO THE PREP COOLER LOCATED IN THE FOOD PREP AREA. INSTRUCTED TO REPLACE AND MAINTAIN. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: OBSERVED MINOR ACCUMULATED DEBRIS ALONG THE WALLS AND IN ALL CORNERS LOCATED IN THE REAR. OBSERVED FLOOR DRAINS WITH MINOR DEBRIS. INSTRUCTED TO CLEAN ALL SAID AREAS AND MAINTAIN.",
      "latitude": "41.885642587591036",
      "longitude": "-87.62693002456233",
      "location": "(-87.62693002456231, 41.88564258759103)"
    },
    {
      "inspection_id": "1229344",
      "name": "BUTCHER & THE BURGER",
      "aka_name": "BUTCHER & THE BURGER",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "1021 W ARMITAGE AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60614",
      "date": "06/04/2012",
      "inspection_type": "Canvass",
      "results": "Pass w/ Conditions",
      "violations": "3. POTENTIALLY HAZARDOUS FOOD MEETS TEMPERATURE REQUIREMENT DURING STORAGE, PREPARATION DISPLAY AND SERVICE - Comments: POTENTIALLY HAZARDOUS FOODS STORED AT IMPROPER TEMPERATURES.  OBSERVED THE FOLLOWING ITEMS AT IMPROPER TEMPERATURES INSIDE OF THE DELI COOLER AND WALK-IN COOLER: GOAT SAUSAGE AT 44.7F, CHEESES AT 44.0-45.6F, PASTA SALAD AT 48.3F, MAYONNAISE AT 43.5F, HOUSE BURGER MIX AT 43.1F, PORK AT 43.8F, RAW BACON AT 44.9F, BLUE CHEESE AT 44.7F, COOKIE DOUGH AT 45.3F.  MANAGEMENT VOLUNTARILY DISCARDED 290# OF FOOD WORTH $1,300.  CRITICAL VIOLATION 7-38-005A. | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: MUST REPAIR THE DIPPER WELL FOR HAND SCOOPED ICE CREAM. | 42. APPROPRIATE METHOD OF HANDLING OF FOOD (ICE) HAIR RESTRAINTS AND CLEAN APPAREL WORN - Comments: MUST STORE THE ICE SCOOP IN A CONTAINER IN THE BASEMENT INSTEAD OF ON TOP OF THE ICE MACHINE.",
      "latitude": "41.917981293152046",
      "longitude": "-87.65434085172942",
      "location": "(-87.6543408517294, 41.917981293152046)"
    },
    {
      "inspection_id": "2261376",
      "name": "JEWEL FOOD STORE #3082",
      "aka_name": "JEWEL FOOD STORE #3082",
      "facility_type": "Grocery Store",
      "risk": "Risk 1 (High)",
      "address": "6014 S COTTAGE GROVE AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60637",
      "date": "02/01/2019",
      "inspection_type": "License",
      "results": "Pass w/ Conditions",
      "violations": "3. MANAGEMENT, FOOD EMPLOYEE AND CONDITIONAL EMPLOYEE; KNOWLEDGE, RESPONSIBILITIES AND REPORTING - Comments: OBSERVED NO POLICY IN PLACE FOR EMPLOYEE HEALTH. MUST PROVIDE. PRIORITY FOUNDATION VIOLATION 7-38-010. NO CITATION ISSUED. GIVEN 90 DAYS TO COMPLY. | 5. PROCEDURES FOR RESPONDING TO VOMITING AND DIARRHEAL EVENTS - Comments: NO PROCEDURES FOR RESPONDING TO VOMITING AND DIARRHEA EVENTS. MUST PROVIDE. PRIORITY FOUNDATION VIOLATION 7-38-005. NO CITATION ISSUED. GIVEN 90 DAYS TO COMPLY. | 55. PHYSICAL FACILITIES INSTALLED, MAINTAINED & CLEAN - Comments: REMOVE ALL CONSTRUCTION MATERIALS, CARDBOARD, TOOLS AND UNNECESSARY EQUIPMENT AND ARTICLES THROUGHOUT FRONT AND BACK STORAGE AREAS. ORGANIZE AND MAINTAIN AT ALL TIMES. | 57. ALL FOOD EMPLOYEES HAVE FOOD HANDLER TRAINING - Comments: MUST PROVIDE PROOF OF FOOD HANDLERS CERTIFICATES.",
      "latitude": "41.78538744495878",
      "longitude": "-87.60618376100805",
      "location": "(-87.60618376100804, 41.78538744495878)"
    },
    {
      "inspection_id": "1418282",
      "name": "JET'S PIZZA",
      "aka_name": "JET'S PIZZA",
      "facility_type": "Restaurant",
      "risk": "Risk 2 (Medium)",
      "address": "2811 N ASHLAND AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60657",
      "date": "05/02/2014",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: MUST REPAIR GASKETS AT BOTH DRAWERS AT THE COLD HOLDING UNIT ACROSS FROM THE COCA-COLA. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: MUST CLEAN AND SANITIZE FLOOR DRAINS THROUGHOUT PREMISES. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: MUST CLEAN/REPLACE EXHAUST HOOD VENTS ABOVE PIZZA OVEN AREA. | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: MUST REPAIR LEAKY COLD WATER FAUCET HANDLE AT THE 3COMP SINK AREA.",
      "latitude": "41.93276573571165",
      "longitude": "-87.66826200882875",
      "location": "(-87.66826200882875, 41.93276573571165)"
    },
    {
      "inspection_id": "2369316",
      "name": "SENOR PAN CAFE",
      "aka_name": "SENOR PAN CAFE",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "4612 W FULLERTON AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60639",
      "date": "04/16/2020",
      "inspection_type": "Canvass",
      "results": "Fail",
      "violations": "10. ADEQUATE HANDWASHING SINKS PROPERLY SUPPLIED AND ACCESSIBLE - Comments: OBSERVED EMPTY HAND SOAP DISPENSER ABOVE THE HAND WASHING SINK AT REAR FOOD PREP AREA WHILE EMPLOYEE ACTIVELY PREPPING FOODS DURING THIS INSPECTION.HAND SOAP  MUST BE AVAILABLE AND MAINTAIN HAND SINKS EQUIPPED AT ALL TIMES. PRIORITY FOUNDATION VIOLATION 7-38-030(C),(MANAGER PROVIDED HAND SOAP TO MENTIONED HAND SINK BY THE END OF INSPECTION.)CORRECTED ON SITE(COS),NO CITATION ISSUED. | 10. ADEQUATE HANDWASHING SINKS PROPERLY SUPPLIED AND ACCESSIBLE - Comments: OBSERVED PAPER TOWEL DISPENSER EMPTY ABOVE HAND WASHING SINK AT REAR FOOD PREP AREA WHILE EMPLOYEE ACTIVELY PREPPING FOODS DURING THIS INSPECTION. PAPER TOWELS MUST BE AVAILABLE AND MAINTAIN HAND SINK EQUIPPED AT ALL TIMES.PRIORITY FOUNDATION VIOLATION 7-38-030(C),(MANAGER PROVIDED HAND PAPER TOWELS TO MENTIONED HAND SINK BY THE END OF INSPECTION.)CORRECTED ON SITE(COS). CONSOLIDATED WITH ABOVE VIOLATION,NO CITATION ISSUED. | 22. PROPER COLD HOLDING TEMPERATURES - Comments: OBSERVED IMPROPER COLD HOLDING TEMPERATURES OF (TCS FOODS): OBSERVED RAW CHICKEN STORED UNDERNEATH SHELVE IN KITCHEN FOOD PREP AREA AT 55.7 F. MANAGEMENT VOLUNTARILY DISCARDED APPROXIMATELY 8 #'S OF FOOD WORTH $20.00. PRIORITY VIOLATION 7-38-005.CORRECTED ON SITE(COS),NO CITATION ISSUED. | 38. INSECTS, RODENTS, & ANIMALS NOT PRESENT - Comments: FOUND NO LICENSED PEST CONTROL LOG BOOK ON PREMISES. INSTRUCTED TO PROVIDE A PEST CONTROL LOG BOOK WITH ALL REQUIRED DOCUMENTS(CONTRACT/SERVICE AGREEMENT, SERVICE REPORT,IDPH LICENSE, CHEMICALS USED ETC.) AND MAINTAIN ON SITE FOR INSPECTION REVIEW. PRIORITY FOUNDATION VIOLATION 7-38-020 (C), NO CITATION ISSUED. - | 47. FOOD & NON-FOOD CONTACT SURFACES CLEANABLE, PROPERLY DESIGNED, CONSTRUCTED & USED - Comments: INSTRUCTED TO PROVIDE AND MAINTAIN 3 ADEQUATE WORKING SINK STOPPERS FOR THE DISH WASHING 3-COMPARTMENT SINK. | 49. NON-FOOD/FOOD CONTACT SURFACES CLEAN - Comments: CLEAN THE DUST FROM THE WIRE STORAGE RACK IN THE CORNER OF THE PREP AREA NEXT TO THE HOT HOLDING UNIT. | 55. PHYSICAL FACILITIES INSTALLED, MAINTAINED & CLEAN - Comments: OBSERVED DIRTY FLOORS WITH DEBRIS UNDER AND AROUND THE BAR AREA AND UNDERNEATH THE DISH WASHING MACHINE IN KITCHEN AREA.MUST CLEAN FLOORS IN DETAIL AND MAINTAIN. | 55. PHYSICAL FACILITIES INSTALLED, MAINTAINED & CLEAN - Comments: INSTRUCTED TO DETAIL CLEAN AND ORGANIZE REAR DRY LINEN STORAGE AREA AND REMOVE UNNECESSARY ARTICLES DUE TO POTENTIAL PEST HARBORAGE AND PROPERLY STORE CLEANING EQUIPMENTS/HANG-UP MOPS/BROOMS ETC. IN SAME AREA. | 56. ADEQUATE VENTILATION & LIGHTING; DESIGNATED AREAS USED - Comments: CLEAN THE EXCESSIVE GREASE ON THE VENTILATION HOOD AND FILTERS.",
      "latitude": "41.92440234177882",
      "longitude": "-87.74231825957612",
      "location": "(-87.74231825957612, 41.92440234177882)"
    },
    {
      "inspection_id": "2071992",
      "name": "CHIPOTLE MEXICAN GRILL",
      "aka_name": "CHIPOTLE MEXICAN GRILL",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "2000 N CLYBOURN AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60614",
      "date": "08/07/2017",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: MUST CLEAN DEAD BUGS FROM FRONT WINDOW SILL. CLEAN FOOD DEBRIS FROM INTERIOR CONTACT SURFACE OF STORAGE COMPARTMENTS BELOW FRONT  COUNTER. INSTRUCTED TO MAINTAIN. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: MUST CLEAN FOOD DEBRIS FROM FLOORS IN THE FRONT AND REAR PREP AREAS, AND IN THE CUSTOMER SEATING AREA. INSTRUCTED TO MAINTAIN. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: MUST CLEAN DRIED FOOD DEBRIS FROM SOUTH WALL IN FRONT PREP AREA. ALSO, SEAL SMALL HOLES IN CEILING TILES ABOVE 4-COMP SINK IN REAR PREP AREA. INSTRUCTED TO MAINTAIN.",
      "latitude": "41.91758179156386",
      "longitude": "-87.6590228976662",
      "location": "(-87.6590228976662, 41.91758179156386)"
    },
    {
      "inspection_id": "2320766",
      "name": "XSPORT FITNESS",
      "aka_name": "XSPORT FITNESS",
      "facility_type": "Restaurant",
      "risk": "Risk 2 (Medium)",
      "address": "3030 N BROADWAY ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60657",
      "date": "10/30/2019",
      "inspection_type": "Canvass",
      "results": "Pass w/ Conditions",
      "violations": "1. PERSON IN CHARGE PRESENT, DEMONSTRATES KNOWLEDGE, AND PERFORMS DUTIES - Comments: PERSON IN CHARGE AT THE TIME OF INSPECTION DOES NOT HAVE A CITY OF CHICAGO SANITATION CERTIFICATE. PRIORITY FOUNDATION VIOLATION. NO CITATION ISSUED | 2. CITY OF CHICAGO FOOD SERVICE SANITATION CERTIFICATE - Comments: NO ORIGINAL AND VALID CITY OF CHICAGO FOOD SERVICE SANITATION CERTIFICATE POSTED NOR PROVIDED ON SITE. INSTRUCTED TO PROVIDE. A LEAST ONE CERTIFIED FOOD MANAGER MUST BE ON SITE WHEN FOOD IS HANDLED.  PRIORITY FOUNDATION: 7-38-012, CITATION ISSUED. | 3. MANAGEMENT, FOOD EMPLOYEE AND CONDITIONAL EMPLOYEE; KNOWLEDGE, RESPONSIBILITIES AND REPORTING - Comments: - FOUND NO EMPLOYEE HEALTH POLICY/TRAINING ON SITE. INSTRUCTED FACILITY TO ESTABLISH AN APPROPRIATE EMPLOYEE HEALTH POLICY/TRAINING SYSTEM AND MAINTAIN WITH VERIFIABLE DOCUMENTS ON SITE. PRIORITY FOUNDATION VIOLATION 7-38-012. NO CITATION ISSUED. - | 5. PROCEDURES FOR RESPONDING TO VOMITING AND DIARRHEAL EVENTS - Comments: FOUND NO PROCEDURE/PLAN FOR RESPONDING TO VOMITING AND DIARRHEAL EVENTS. INSTRUCTED FACILITY TO DEVELOP AND MAINTAIN A PROCEDURE/PLAN AND TO MAINTAIN ANY APPROPRIATE SUPPLIES ON SITE. PRIORITY FOUNDATION VIOLATION 7-38-005. NO CITATION ISSUED - | 10. ADEQUATE HANDWASHING SINKS PROPERLY SUPPLIED AND ACCESSIBLE - Comments: HAND WASHING SINK AT SMOOTHIES'S AREA BY THREE COMPARTMENT SINK NOT ACCESSIBLE FOR HAND WASHING.WE OBSERVED INSIDE HANDWASHING SINK BOTTLE OF WATER,FOOD CONTAINERS WITH LID AND UTENSILS INSIDE THE CONTAINER A USED JAR WITH STRAW AND FOOD LIQUID INSIDE.UPON MY REQUEST MANAGER ON DUTY REMOVED ITEMS AND DISCARDED. INSTRUCTED TO KEEP SAID SINK AVAILABLE AT ALL TIMES FOR PROPER HAND WASHING PRIORITY FOUNDATION VIOLATION:7-38-030(C),CITATION ISSUED | 16. FOOD-CONTACT SURFACES: CLEANED & SANITIZED - Comments:  WE OBSERVED SLIGHTLY BLACK SUBSTANCE AT  INTERIOR PANEL OF ICE BIN OF THE ICE MACHINE IN THE SMOOTHIES AREA,INSTRUCTED TO CLEAN AND MAINTAIN | 47. FOOD & NON-FOOD CONTACT SURFACES CLEANABLE, PROPERLY DESIGNED, CONSTRUCTED & USED - Comments: OBSERVED NO STOPPERS AT THREE COMPARTMENT SINK,A COFFEE PLASTIC SCOOP IS USED FOR STOPPER,INSTRUCTED TO PROVIDE THREE STOPPERS AT SAID SINK | 47. FOOD & NON-FOOD CONTACT SURFACES CLEANABLE, PROPERLY DESIGNED, CONSTRUCTED & USED - Comments: OBSERVED  WHITE CUTTING BOARD STORED BEHIND THE FAUCET OF HANDWASHING  SINK TO DRY.INSTRUCTED TO REMOVE AND RELOCATE SAID ITEM IN A SANITARY METHOD.MANAGER REMOVED ITEM.",
      "latitude": "41.937338437309435",
      "longitude": "-87.64445647150518",
      "location": "(-87.64445647150518, 41.93733843730944)"
    },
    {
      "inspection_id": "1961239",
      "name": "ABBOTT  PARK GOLDEN DINER",
      "aka_name": "ABBOTT PARK GOLDEN DINER",
      "facility_type": "Golden Diner",
      "risk": "Risk 1 (High)",
      "address": "49 E 95TH ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60619",
      "date": "11/29/2018",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "",
      "latitude": "41.721652387049076",
      "longitude": "-87.621752171201",
      "location": "(-87.621752171201, 41.72165238704908)"
    },
    {
      "inspection_id": "1946570",
      "name": "HILDA'S KITCHEN INC.",
      "aka_name": "HILDA'S KITCHEN INC.",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "2603 W 71ST ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60629",
      "date": "07/14/2016",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "31. CLEAN MULTI-USE UTENSILS AND SINGLE SERVICE ARTICLES PROPERLY STORED: NO REUSE OF SINGLE SERVICE ARTICLES - Comments: ALL MULTI USE ATRICLES IE... ALUMINUM PANS AND FOIL TOPS MUST BE DISCARDED AFTER EACH USE.  CORRECT AND MAINTAIN.  | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: ALL FOOD PRODUCTS MUST BE UP OFF THE FLOOR. MUST CORRECT AND MAINTAIN.  | 36. LIGHTING: REQUIRED MINIMUM FOOT-CANDLES OF LIGHT PROVIDED, FIXTURES SHIELDED - Comments: LIGHTS IN THE FRONT AND REAR PREP AREA IN NEED OF PROPER SHIELDS. LIGHT IN LADIES ROOM IN NEED OF REPAIR. MUST CORRECT AND MAINTAIN AT ALL TIMES.  | 37. TOILET ROOM DOORS SELF CLOSING: DRESSING ROOMS WITH LOCKERS PROVIDED: COMPLETE SEPARATION FROM LIVING/SLEEPING QUARTERS - Comments: MENS TOILET ROOM IN NEED OF CLEANING. MUST CORRECT AND MAINTAIN.  | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: FAUCET IN LADIES ROOM IN NEED OF REPAIR. WATER SPLATTERS DIPPER WELL MUST BE INSTALLED NEAR ICE CREAM. MUST CORRECT AND MAINTAIN. | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: ALL UNNECESSARY CLUTTER MUST BE REMOVED OR ORGANIZED. CORRECT AND MAINTAIN. ",
      "latitude": "41.764505727563616",
      "longitude": "-87.68828540892099",
      "location": "(-87.68828540892099, 41.76450572756362)"
    },
    {
      "inspection_id": "2010118",
      "name": "ADRIANS FOOD  MARKET",
      "aka_name": "ADRIANS FOOD MARKET",
      "facility_type": "Grocery Store",
      "risk": "Risk 1 (High)",
      "address": "3700 W DIVERSEY AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60647",
      "date": "04/11/2017",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: OBSERVED DIRT AND DEBRIS ON FLOOR UNDER AROUND AND BEHIND ALL REFRIGERATION UNITS FRONT AND REAR OF PREMISES. MUST CLEAN AND MAINTAIN. | 36. LIGHTING: REQUIRED MINIMUM FOOT-CANDLES OF LIGHT PROVIDED, FIXTURES SHIELDED - Comments: INSTRUCTED TO PROVIDE LIGHT SHIELDS ABOVE CUTTING PRODUCE TABLES IN REAR AREA. MUST PROVIDE AND MAINTAIN. | 39. LINEN: CLEAN AND SOILED PROPERLY STORED - Comments: STEM THERMOMETER NEEDED TO MONITOR FOOD TEMPERATURES. MUST PROVIDE AND MAINTAIN. | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: OBSERVED FOOD ITEMS INSIDE WALK-IN COOLER NOT ELEVATED 6INCHES OFF THE FLOOR. MUST ELEVATE ITEMS AND MAINTAIN.",
      "latitude": "41.931989422908",
      "longitude": "-87.71969926512013",
      "location": "(-87.71969926512013, 41.93198942290801)"
    },
    {
      "inspection_id": "114286",
      "name": "LEVY(EVENTS)LIMITED PARTNERSHIP",
      "aka_name": "CATERING KITCHEN",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "315 N LA SALLE DR ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60654",
      "date": "01/19/2010",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: The walls and ceilings shall be in good repair and easily cleaned.    Observed holes in ceiling tile at dry storage area. Must replace damaged ceiling tile. | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: Ventilation: All plumbing fixtures, such as toilets, sinks, washbasins, etc., must be adequately trapped, vented, and re-vented and properly connected to the sewer in accordance with the plumbing chapter of the Municipal Code of Chicago and the Rules and Regulations of the Board of Health.    Mens employees washroom handwash bowl draining slowly. Must repair and maintain plumbing.",
      "latitude": "41.887920731996346",
      "longitude": "-87.63235953008896",
      "location": "(-87.63235953008895, 41.887920731996346)"
    },
    {
      "inspection_id": "2301204",
      "name": "LAKE JUNCTION FISH & CHICKEN",
      "aka_name": "LAKE JUNCTION FISH & CHICKEN",
      "facility_type": "Restaurant",
      "risk": "Risk 2 (Medium)",
      "address": "345 N CENTRAL AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60644",
      "date": "07/16/2019",
      "inspection_type": "Canvass",
      "results": "Out of Business",
      "violations": "",
      "latitude": "41.88708768190208",
      "longitude": "-87.7649572507278",
      "location": "(-87.76495725072779, 41.88708768190208)"
    },
    {
      "inspection_id": "1631773",
      "name": "RUTH KAPLAN",
      "aka_name": "SAM'S RED  HOT",
      "facility_type": "Restaurant",
      "risk": "Risk 2 (Medium)",
      "address": "2345 W ARMITAGE AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60647",
      "date": "02/17/2016",
      "inspection_type": "Complaint Re-Inspection",
      "results": "Pass w/ Conditions",
      "violations": "29. PREVIOUS MINOR VIOLATION(S) CORRECTED 7-42-090 - Comments: MINOR VIOLATION NOT CORRECTED FROM 2-4-16,REPORT #1631348.  #45FOOD HANDLER REQUIREMENTS NOT MET. NO LOGS,RECORS ON SITE AS REQUIRED. INSTRUTED TO PROVIDE. TODAY WE(MANAGER/OWNER AND I )  OBSERVED SAME VIOLATION.  SERIOUS VIOLATION:7-42-090 | 32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: OBSERVED DIRTY GREASY RAGS BETWEEN THE HOOD AND THE DUCT OF THE HOOD,INSTRUCTED TO REMOVE AND PROPERLY SEAL OPENING WITH A SMOOTH,CLEANABLE AND NON-ABSORBENT SURFACE. INSIDE OF THE CABINET UNDER THE EXPOSED HAND SINK WITH ECCESS SPIDER WEBS ALSO THE WALL WITH EXCESS DEBRIS .INSTRUCTED TO CLEAN/PAINT AND MAINTAIN.   | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: BROKEN CEMENT FLOOR UNDER THE COCA-COLA POP DISPENSER ACROSS FROM STEAM TABLE.OBSERVED BROKEN CEMENT,BRICKS WOOD,INSTRUCTED TO REMOVE REPLACE BROKEN FLOOR WITH A SMOOTH,CLEANABLE AND NON-ABSORBENT SURFACE.BROKEN FLOOR TILE IN FRON TOF THE THREE COMPARTMENT SINK COVERED WITH CARDBOARDS,INSTRUCYED TO REPLACE FLOOR TILES AND REMOVE CARDBOARDS FROM ESTABLISHEMENT.FLOOR INSIDE THE WALK-IN COOLER PARTIALLY BROKEN AROUND THE SOUTH BASEBOARD WALL,IN THE MIDDLE STEP ,AND AROUND THE BASEBPARD WALL BY THE DOOR OF THE UNIT MENTIONED.   | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: BLACK SLIME SUBSTANCE ON REPAIRED WALLS INSIDE THE WALK-IN COOLER,SOUTH WALL,PECIES OF WOOD NAILD TO WALL,UNVEN,WITH OPENINGS AND SURFACE IS NOT SMOOTH AND CLEANABLE.INSTRUCTED TO REMOVE WOOD,AND PROVIDE SURACE THAT IS SMOOTH,CLEANABLE AND NON-ABSORBENT SURFACE HOLES ON WALL UNDER THE STEAM TABLE / SERVING TRAYLINE AT NORTH EAST WALL,INSTRUCTED TO SEAL WITH A SMOOTH CLEANABLE AND NON-ABSORBENT SURFACE | 36. LIGHTING: REQUIRED MINIMUM FOOT-CANDLES OF LIGHT PROVIDED, FIXTURES SHIELDED - Comments: NO LIGHT SHIELD PROVIDED AT LIGHT ABOVE THE STEAM TABLE/SERVING AREA,INSTRUCTED TO PROVIDE LIGHT SHIELD WITH END CAPS OR SHATTER-PROOF BULBS ARE ACCEPTABLE   | 45. FOOD HANDLER REQUIREMENTS MET - Comments:  VIOLATION REMAINS ON VIOLATION #29",
      "latitude": "41.91746648068976",
      "longitude": "-87.68681623688606",
      "location": "(-87.68681623688606, 41.917466480689754)"
    },
    {
      "inspection_id": "1106553",
      "name": "PANERA BREAD",
      "aka_name": "PANERA BREAD",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "6059 N LINCOLN AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60659",
      "date": "05/15/2013",
      "inspection_type": "Canvass",
      "results": "Pass w/ Conditions",
      "violations": "9. WATER SOURCE: SAFE, HOT & COLD UNDER CITY PRESSURE - Comments: NO HOT WATER PROVIDED  THROUGHOUT THE PREMISES. PRESENTLY HOT WATER TANK NOT ABLE TO PROVIDE HOT WATER.PRESENT WATER TEMPERATURE THROUGHOUT IS 59.1F TO 68F.  PREMISES IN FULL OPERATION: PREPARING FOOD AND SERVING TO CUSTOMERS.  A TECHNICIAN/PLUMBER WAS CALLED TO SERVICE HOT WATER TANK.  CRITICAL VIOLATION:7-38-030.    AT 10:55 AM PLUMBER REPORTED ON PREMISES,FIXED THE PROBLEM AND HOT WATER WAS RESTORED THROUGHOUT THE PREMISES, HOT WATER TEMP OF 120F AND ABOVE. | 16. FOOD PROTECTED DURING STORAGE, PREPARATION, DISPLAY, SERVICE AND TRANSPORTATION - Comments: FOOD(ICE) NOT PROTECTED DURING STORAGE.OBSERVED  INTERIOR OF ICE MACHINE WATER RESERVOIR AND INTERIOR PANELS  WITH BLACK SUBSTANCE.INSTRUCTED TO CLEAN AND SANITIZE UNIT.  SERIOUS VIOLATION: 7-38-005(A)    ICE MACHINE PRESENTLY CLEANED AND SANITIZED. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: OBSERVED FOOD DEBRIS AND ACCUMULATION OF DUST UNDER THE EQUIPMENT, ALONG WALL AND CORNERS THROUGHOUT THE PREMISES, INSTRUCTED TO CLEAN AND MAINTAIN. | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: OBSERVED DUST BUILD-UP ON VENT COVERS ABOVE PREP COOLER OF SOUP/PANINI STATION.",
      "latitude": "41.99191947239194",
      "longitude": "-87.70963133440333",
      "location": "(-87.70963133440333, 41.99191947239194)"
    },
    {
      "inspection_id": "1955530",
      "name": "LA CAZUELA RESTAURANT",
      "aka_name": "LA CAZUELA RESTAURANT",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "6922 N CLARK ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60626",
      "date": "02/28/2017",
      "inspection_type": "Canvass",
      "results": "Out of Business",
      "violations": "",
      "latitude": "42.00727086038087",
      "longitude": "-87.67371086236922",
      "location": "(-87.67371086236922, 42.007270860380864)"
    },
    {
      "inspection_id": "1271223",
      "name": "DOUGH ON THE GO",
      "aka_name": "DOUGH ON THE GO",
      "facility_type": "Bakery",
      "risk": "Risk 2 (Medium)",
      "address": "5512 W LAWRENCE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60630",
      "date": "06/14/2012",
      "inspection_type": "License Re-Inspection",
      "results": "Pass",
      "violations": "38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: Above violation still remaining(must provide mop sink to premises).",
      "latitude": "41.967916399152",
      "longitude": "-87.76556381813036",
      "location": "(-87.76556381813036, 41.967916399152)"
    },
    {
      "inspection_id": "1345721",
      "name": "SUBWAY",
      "aka_name": "SUBWAY",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "166 N WABASH AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60601",
      "date": "12/05/2013",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: MUST TIGHTEN BASE AT THE FAUCET OF THE 3-COMP SINK TO REPAIR LEAK.",
      "latitude": "41.88502983462608",
      "longitude": "-87.6264083476607",
      "location": "(-87.6264083476607, 41.88502983462608)"
    },
    {
      "inspection_id": "1989829",
      "name": "TAYLOR ELEMENTARY SCHOOL",
      "aka_name": "TAYLOR ELEMENTARY SCHOOL",
      "facility_type": "School",
      "risk": "Risk 1 (High)",
      "address": "9912 S Avenue H (3732E) ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60617",
      "date": "02/28/2017",
      "inspection_type": "Canvass",
      "results": "Fail",
      "violations": "26. ADEQUATE NUMBER, CONVENIENT, ACCESSIBLE, PROPERLY DESIGNED AND INSTALLED - Comments: MUST PROVIDE HOT OR TEMPERED WATER INSIDE THE GIRLS AND BOYS WASHROOM AT THE WASHBOWLS ON THE 1ST FLOOR,INSTRUCTED TO PROVIDE HOT OR TEMPERED WATER | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: MUST CLEAN FLOORS IN THE STORAGE AREA,ALONG WALL BASE AND CORNERS | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: MUST REMOVE CHIP PAINT FROM WALL INSIDE THE JANITORS CLOSET IN KITCHEN AREA,INSTRUCTED TO REMOVE CHIP PAINT",
      "latitude": "41.715445889813275",
      "longitude": "-87.53300739538533",
      "location": "(-87.53300739538533, 41.71544588981327)"
    },
    {
      "inspection_id": "1206288",
      "name": "FatPour",
      "aka_name": "FatPour Tap works",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "2005-2007 W DIVISION ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60622",
      "date": "08/28/2012",
      "inspection_type": "License",
      "results": "Fail",
      "violations": "2. FACILITIES TO MAINTAIN PROPER TEMPERATURE - Comments: Walk in cooling unit  46.7f must be capable of maintaining 40f or below at all times.critical violation 7-38-005(a).no citation issued  | 18. NO EVIDENCE OF RODENT OR INSECT OUTER OPENINGS PROTECTED/RODENT PROOFED, A WRITTEN LOG SHALL BE MAINTAINED AVAILABLE TO THE INSPECTORS - Comments: Rear kitchen door is not rodent-proofed at right bottom corner.Serious violation 7-38-020.  | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: WALLS BEHIND BARS EXPOSED BRICK MUST BE SMOOTH,EASILY CLEANABLE SURFACE AND SEAL HOLES ON BRICK WALL AT DJ AREAS.  | 36. LIGHTING: REQUIRED MINIMUM FOOT-CANDLES OF LIGHT PROVIDED, FIXTURES SHIELDED - Comments: LIGHTS ABOVE FIREPLACE PREP AREA MUST BE SHIELDED.  | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: REMOVE UNNECESSARY ARTICLES THROGHOUT THE PREMISES INCLUDING BUILDING MATERIALS STORED AT OUTSIDE REAR AREAS. ",
      "latitude": "41.903076748534474",
      "longitude": "-87.6775278241922",
      "location": "(-87.67752782419221, 41.903076748534474)"
    },
    {
      "inspection_id": "1591883",
      "name": "JIMMY G'S",
      "aka_name": "JIMMY G'S",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "307 S KEDZIE AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60612",
      "date": "12/17/2015",
      "inspection_type": "Short Form Complaint",
      "results": "Fail",
      "violations": "12. HAND WASHING FACILITIES: WITH SOAP AND SANITARY HAND DRYING DEVICES, CONVENIENT AND ACCESSIBLE TO FOOD PREP AREA - Comments: NO PAPER TOWELS WERE PROVIDED AT THE HANDWASHING SINKS IN THE WASHROOM, AND EXPOSED HANDWASHING SINK IN THE DISHROOM.  MANAGEMENT INSTRUCTED TO PROVIDE SOAP AND PAPER TOWELS AT ALL TIMES AT ALL HANDWASHING SINKS.  ALSO, NO TOILET PAPER WAS PROVIDED IN THE WASHROOM.  MANAGEMENT PROVIDE PAPER TOWELS AND TOILET PAPER AT ALL HANDSINKS AND WASHROOMS AT MY REQUEST.  CRITICAL VIOLATION 7-38-030.   | 18. NO EVIDENCE OF RODENT OR INSECT OUTER OPENINGS PROTECTED/RODENT PROOFED, A WRITTEN LOG SHALL BE MAINTAINED AVAILABLE TO THE INSPECTORS - Comments: OBSERVED A LIVE COCKROACH ON THE WALL IN THE DISHROOM AND APPROXIMATELY 30 LIVE FRUIT FLIES ON THE WALLS OF THE REAR FOOD PREP AREA AND DISHROOM.  ADDITIONAL PEST CONTROL SERVICE IS NEEDED TO MINIMIZE OR ELIMINATE THE PEST ACTIVITY.  SERIOUS VIOLATION 7-38-020.",
      "latitude": "41.87707753773826",
      "longitude": "-87.7058603003517",
      "location": "(-87.70586030035169, 41.87707753773826)"
    },
    {
      "inspection_id": "74325",
      "name": "DAVIS HOUSE",
      "aka_name": "DAVIS HOUSE",
      "facility_type": "Long Term Care",
      "risk": "Risk 1 (High)",
      "address": "4237 S INDIANA AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60653",
      "date": "03/04/2010",
      "inspection_type": "Canvass",
      "results": "Fail",
      "violations": "8. SANITIZING RINSE FOR EQUIPMENT AND UTENSILS:  CLEAN, PROPER TEMPERATURE, CONCENTRATION, EXPOSURE TIME - Comments: Equipment and utensils should get proper exposure to the sanitizing solution during the rinse cycle.  Bactericidal treatment shall consist of exposure of all dish and utensil surfaces to a rinse of clean water at a temperature of not less than 180F.  UNABLE TO SANTIZE DISHES AT THE REQUIRED TEMPERATURE OF 180F, DISH MACHINES ONLY REACHES TEMPS OF 108.0F AND 105.0F - FINAL RINSE MUST BE 180.F OR HIGHER. | 30. FOOD IN ORIGINAL CONTAINER, PROPERLY LABELED: CUSTOMER ADVISORY POSTED AS NEEDED - Comments: All food not stored in the original container shall be stored in properly labeled containers.   | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: The floors shall be constructed per code, be smooth and easily cleaned, and be kept clean and in good repair.  DETAIL CLEAN ALL FLOORS AND CORNERS THROUGHOUT, UNDER ALL STORAGE SHELVES.  REPLACE ALL COVING THROUGHOUT PREMISES, PREVENTING ANY INSECT/RODENT ENTRANCE AND HORBAGE. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: The walls and ceilings shall be in good repair and easily cleaned.  all walls must be smooth,clean light in color, with no holes,cracks, or opening throughout.  some decorating ongoing. | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: The flow of air discharged from kitchen fans shall always be through a duct to a point above the roofline.  detail clean all air vents throughout.",
      "latitude": "41.8172708464385",
      "longitude": "-87.62127870437384",
      "location": "(-87.62127870437384, 41.81727084643849)"
    },
    {
      "inspection_id": "1296575",
      "name": "GOLDEN HORSE CARRIAGE CAFE",
      "aka_name": "GOLDEN HORSE CARRIAGE CAFE",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "2826 S WENTWORTH AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60616",
      "date": "09/16/2013",
      "inspection_type": "Canvass Re-Inspection",
      "results": "Pass",
      "violations": "",
      "latitude": "41.84178222092744",
      "longitude": "-87.63191972662558",
      "location": "(-87.63191972662558, 41.84178222092744)"
    },
    {
      "inspection_id": "1583755",
      "name": "JMJ CHOICE",
      "aka_name": "JMJ CHOICE",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "2650 W 69TH ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60629",
      "date": "10/30/2015",
      "inspection_type": "Canvass",
      "results": "Out of Business",
      "violations": "",
      "latitude": "41.76833318810723",
      "longitude": "-87.69027927259165",
      "location": "(-87.69027927259164, 41.76833318810723)"
    },
    {
      "inspection_id": "612304",
      "name": "SUBWAY",
      "aka_name": "SUBWAY",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "447 N STATE ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60654",
      "date": "06/24/2011",
      "inspection_type": "Canvass",
      "results": "Fail",
      "violations": "29. PREVIOUS MINOR VIOLATION(S) CORRECTED 7-42-090 - Comments: A separate and distinct offense shall be deemed to have been committed for each Minor violation that is not corrected upon re-inspection by the health authority.  PREVIOUS MINOR VIOLATIONS FROM REPORT #250515 ON 6/3/10 NOT CORRECTED: 37/01- Toilet rooms shall be completely enclosed and shall be vented to the outside air or mechanically ventilated.     Mens washroom door not self closing. Must provide and install self closing device for washroom door.     40/01- All food establishments that display, prepare, or store potentially hazardous foods shall have calibrated metal stem thermometers, provided and conspicuous, for refrigerated and hot food units.     Must provide thermometer for reserve prep cooler (at front prep line).   SERIOUS VIOLATION 7-42-090 | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: All food and non-food contact surfaces of equipment and all food storage utensils shall be thoroughly cleaned and sanitized daily.  DETAIL CLEAN THE WIRE RACKS ABOVE THE PREP TABLE, CABINETS BELOW THE FRONT HANDSINK AND FOUNTAIN POP MACHINE. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: The walls and ceilings shall be in good repair and easily cleaned.  DETAIL CLEAN THE WALL BEHIND THE PREP TABLE AND CEILING TILES IN THE REAR PREP AREA. | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: REPAIR 3 COMPARTMENT SINK SO THAT HOT AND COLD WATER CAN BE USED SEPARATELY.",
      "latitude": "41.89068474385759",
      "longitude": "-87.62788499743118",
      "location": "(-87.62788499743118, 41.89068474385759)"
    },
    {
      "inspection_id": "1324888",
      "name": "CAFE CORNER",
      "aka_name": "CAFE CORNER",
      "facility_type": "Restaurant",
      "risk": "Risk 2 (Medium)",
      "address": "2144 W VAN BUREN ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60612",
      "date": "02/04/2014",
      "inspection_type": "Canvass",
      "results": "Pass w/ Conditions",
      "violations": "21. * CERTIFIED FOOD MANAGER ON SITE WHEN POTENTIALLY HAZARDOUS FOODS ARE  PREPARED AND SERVED - Comments: NO CITY FOOODSERVICE SANITATION CERTIFICATE POSTED AS REQUIRED. | 30. FOOD IN ORIGINAL CONTAINER, PROPERLY LABELED: CUSTOMER ADVISORY POSTED AS NEEDED - Comments: MUST LABEL BULK STORAGE CONTAINER WITH NAME OF ITEM. | 37. TOILET ROOM DOORS SELF CLOSING: DRESSING ROOMS WITH LOCKERS PROVIDED: COMPLETE SEPARATION FROM LIVING/SLEEPING QUARTERS - Comments: NOTED BATHROOM DOOR NOT SELF CLOSING. MUST PROVIDE AND MAINTAIN SELF CLOSING DEVICE.",
      "latitude": "41.876270654869145",
      "longitude": "-87.68074933778185",
      "location": "(-87.68074933778185, 41.87627065486915)"
    },
    {
      "inspection_id": "1512303",
      "name": "PENNY'S NOODLES SHOP",
      "aka_name": "PENNY'S NOODLES SHOP",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "1542 N DAMEN AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60622",
      "date": "11/25/2014",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: CLEAN INTERIOR OF ICE MACHINE AND FRYER CABINETS. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: CLEAN LIGHT SHIELDS IN DISH WASHING AREA AND FAN UNITS IN WALK-IN COOLER. | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: ELEVATE ALL STOCK OFF FLOOR IN BASEMENT STORAGE AREA.",
      "latitude": "41.90942674415946",
      "longitude": "-87.67758328415117",
      "location": "(-87.67758328415117, 41.90942674415946)"
    },
    {
      "inspection_id": "88675",
      "name": "SUBWAY SANDWICHES & SALADS",
      "aka_name": "SUBWAY SANDWICHES & SALADS",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "5050 N CICERO AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60630",
      "date": "02/16/2011",
      "inspection_type": "Complaint",
      "results": "Pass",
      "violations": "32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: All food and non-food contact equipment and utensils shall be smooth, easily cleanable, and durable, and shall be in good repair.Walk in cooler shelving/racks that had rust, peeling paint shall be repair/replaced.Caulk by 3 compartment sink in state of disrepair, shall be replaced. | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: All food and non-food contact surfaces of equipment and all food storage utensils shall be thoroughly cleaned and sanitized daily.Non food contact surfaces of walk in cooler shelving, racks not clean need detailed cleaning(crevices), storage shelving of front cabinets need cleaning, rear storage racks not clean need detailed cleaning(crevices). | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: The floors shall be constructed per code, be smooth and easily cleaned, and be kept clean and in good repair.Floor under heavy equipment, storage shelving, 3 compartment sink need detailed cleaning(corners). | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: The walls and ceilings shall be in good repair and easily cleaned.Walls in rear prep area by prep table not clean need cleaning, missing ceiling tiles in rear storage areas, shall be provided. | 36. LIGHTING: REQUIRED MINIMUM FOOT-CANDLES OF LIGHT PROVIDED, FIXTURES SHIELDED - Comments: All rooms in which food or drink is prepared, or in which utensils are washed, shall be lighted so that a minimum of 50-foot candles of light is available on all work surfaces. Shielding to protect against broken glass falling into food shall be provided for all artificial lighting sources in preparation, service, and display facilities.Light shields in prep areas, need cleaning. | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: The flow of air discharged from kitchen fans shall always be through a duct to a point above the roofline. Ventilation: All plumbing fixtures, such as toilets, sinks, washbasins, etc., must be adequately trapped, vented, and re-vented and properly connected to the sewer in accordance with the plumbing chapter of the Municipal Code of Chicago and the Rules and Regulations of the Board of Health.Exhaust vents(ventilation)in prep areas,need cleaning, exhaust vent in bathroom needs cleaning.",
      "latitude": "41.97290824123571",
      "longitude": "-87.74806177870752",
      "location": "(-87.74806177870751, 41.9729082412357)"
    },
    {
      "inspection_id": "2252539",
      "name": "COUNTRY CLUB",
      "aka_name": "COUNTRY CLUB",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "3462 N CLARK ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60657",
      "date": "01/14/2019",
      "inspection_type": "Canvass",
      "results": "No Entry",
      "violations": "",
      "latitude": "41.94504968089368",
      "longitude": "-87.65495322178364",
      "location": "(-87.65495322178364, 41.945049680893675)"
    },
    {
      "inspection_id": "1471356",
      "name": "DUNKIN DONUTS / BASKIN ROBBINS",
      "aka_name": "DUNKIN DONUTS / BASKIN ROBBINS",
      "facility_type": "Restaurant",
      "risk": "Risk 2 (Medium)",
      "address": "6408 W IRVING PARK RD ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60634",
      "date": "07/03/2014",
      "inspection_type": "Canvass Re-Inspection",
      "results": "Pass",
      "violations": "41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: Above violation still remaining(Stock items must be stored six inches off of floor to prevent pest harborage).  ",
      "latitude": "41.953021362778074",
      "longitude": "-87.7869561311957",
      "location": "(-87.7869561311957, 41.95302136277807)"
    },
    {
      "inspection_id": "1982829",
      "name": "VIRGIN HOTELS CHICAGO LLC",
      "aka_name": "LOWER LEVEL KITCHEN",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "203 N WABASH AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60601",
      "date": "02/08/2017",
      "inspection_type": "Canvass",
      "results": "Fail",
      "violations": "22. DISH MACHINES: PROVIDED WITH ACCURATE THERMOMETERS, CHEMICAL TEST KITS AND SUITABLE GAUGE COCK - Comments: OBSERVED GAUGES FOR DISH MACHINE IN POOR REPAIR NOT PROVIDING ACCURATE WASH AND FINAL RINSE TEMPERATURES. INSTRUCTED TO REPAIR AND MAINTAIN. SERIOUS VIOLATION 7-38-030. | 31. CLEAN MULTI-USE UTENSILS AND SINGLE SERVICE ARTICLES PROPERLY STORED: NO REUSE OF SINGLE SERVICE ARTICLES - Comments: OBSERVED FOOD BOWLS AND PLATES BEING STORED IMPROPERLY. INSTRUCTED TO INVERT ALL MULTI-USE BOWLS AND PLATES AND MAINTAIN. | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: OBSERVED MOP HEADS BEING STORED IN THE UTILITY SINK. INSTRUCTED TO STORE ALL MOP HEADS UPRIGHT AND MAINTAIN. OBSERVED DOG ACCESSORIES (BOWL, TOYS, BED, DOG GATE IN DOORWAY) BEING STORED FOOD EMPLOYEE'S OFFICE. INSTRUCTED TO REMOVE DOG ACCESSORIES.",
      "latitude": "41.88582829280234",
      "longitude": "-87.62613826248786",
      "location": "(-87.62613826248786, 41.885828292802344)"
    },
    {
      "inspection_id": "1976410",
      "name": "AZTECA de ORO MEXICAN GRILL",
      "aka_name": "AZTECA de ORO MEXICAN GRILL",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "3731 N CLARK ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60613",
      "date": "12/02/2016",
      "inspection_type": "Complaint",
      "results": "Pass",
      "violations": "32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: OBSERVED RUSTY FOOD STORAGE SHELVING INSIDE WALK-IN COOLER. MUST REPAINT AND MAINTAIN. | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: OBSERVED EXPOSED HAND WASHING SINK IN FRONT PREP AREA DRAINING SLOW. MUST REPAIR AND MAINTAIN. | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: OBSERVED RUSTY FOOD STORAGE SHELVING INSIDE WALK-IN COOLER. MUST REPAINT AND MAINTAIN.",
      "latitude": "41.94980428345102",
      "longitude": "-87.65843709178974",
      "location": "(-87.65843709178974, 41.94980428345102)"
    },
    {
      "inspection_id": "1134548",
      "name": "METROPOLITAN CLUB",
      "aka_name": "METROPOLITAN CLUB",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "233 S WACKER DR ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60606",
      "date": "09/13/2012",
      "inspection_type": "Canvass",
      "results": "Pass w/ Conditions",
      "violations": "8. SANITIZING RINSE FOR EQUIPMENT AND UTENSILS:  CLEAN, PROPER TEMPERATURE, CONCENTRATION, EXPOSURE TIME - Comments: (7-38-030)  OBSERVED A RACK FULL OF GLASSES INSIDE THE LOW-TEMPERATURE DISHMACHINE AT THE BAR, THAT WAS DISPENSING 0-PPM  SANITIZER (CHLORINE CONTAINER), AT THIS VISIT. INSTRUCTED TO USE THE HIGH-TEMP. DISHMACHINE OR 3-COMP. SINK IN MAIN KITCHEN UNTIL UNIT IS FIXED. INSTRUCTED TO MAINTAIN & MONITOR THE CHLORINE SANITIZER AT 50-100-PPM. (UNIT TAGGED.) | 30. FOOD IN ORIGINAL CONTAINER, PROPERLY LABELED: CUSTOMER ADVISORY POSTED AS NEEDED - Comments: BULK FOOD CONTAINERS MUST BE LABELED; ALL FOODS STORED IN COOLERS MUST BE DATED ALSO. | 32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: CUTTING BOARDS WITH DEEP, DARK GROOVES MUST BE REPLACED. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: CEILING TILES ABOVE THE  LEFT SIDE OF THE DISHMACHINE SHOW EVIDENCE OF RUST, WATER STAINS (FROM STEAM) OR MILDEW, MUST ADDRESS/REPLACE TILES. | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: FOLLOWING PLUMBING ISSUES MUST BE ADDERESSED: LEAKS AT THE HOT WATER FAUCET KNOBS OF THE 3-COMP. SINK & HANDSINK IN THE 66TH FLOOR KITCHEN, THE COLD WATER LINE BELOW THE HANDSINK (SAME FLOOR), & UNDER THE RIGHT SIDE OF A 2-COMP. SINK AT 67TH FLOOR MAIN KITCHEN. | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: MILK CRATES USED FOR DRY OR COLD STORAGE RACKS MUST BE REPLACED WITH REGULAR SHELVINGS, FOR EASY ACCESS TO CLEANING/PEST MONITORING.",
      "latitude": "41.87856015362371",
      "longitude": "-87.63652387205532",
      "location": "(-87.63652387205532, 41.87856015362371)"
    },
    {
      "inspection_id": "2288242",
      "name": "Tortuga's Cantina",
      "aka_name": "Tortuga's Cantina",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "3220-3224 W LAWRENCE AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60625",
      "date": "05/03/2019",
      "inspection_type": "Canvass",
      "results": "Pass w/ Conditions",
      "violations": "3. MANAGEMENT, FOOD EMPLOYEE AND CONDITIONAL EMPLOYEE; KNOWLEDGE, RESPONSIBILITIES AND REPORTING - Comments: FOUND NO EMPLOYEE HEALTH POLICY/TRAINING ON SITE. INSTRUCTED TO PROVIDE. PRIORITY FOUNDATION VIOLATION 7-38-010, NO CITATION ISSUED. - | 5. PROCEDURES FOR RESPONDING TO VOMITING AND DIARRHEAL EVENTS - Comments: FOUND NO PROCEDURE/PLAN FOR RESPONDING TO VOMITING AND DIARRHEAL EVENTS. INSTRUCTED TO PROVIDE AND MAINTAIN APPROPRIATE SUPPLIES OR KIT. PRIORITY FOUNDATION VIOLATION 7-38-005, NO CITATION ISSUED.  | 10. ADEQUATE HANDWASHING SINKS PROPERLY SUPPLIED AND ACCESSIBLE - Comments: OBSERVED NO HAND WASHING SIGNAGE AT BAR HAND WASHING SINK.INSTRUCTED TO PROVIDE PROPER SIGNAGE AND TO MAINTAIN. - | 23. PROPER DATE MARKING AND DISPOSITION - Comments: OBSERVED READY-TO-EAT, TCS FOODS HELD FOR MORE THAN 24 HOURS (RICE ETC) NOT DATE MARKED TO INDICATE THE DATE IN WHICH THE FOOD MUST BE CONSUMED OR DISCARDED. MANAGEMENT INSTRUCTED TO DATE MARK ALL READY-TO-EAT, TCS FOODS HELD MORE THAN 24 HOURS. PRIORITY FOUNDATION 7-38-005,NO CITATION ISSUED.  | 25. CONSUMER ADVISORY PROVIDED FOR RAW/UNDERCOOKED FOOD - Comments: OBSERVED NO CONSUMER ADVISORY DISCLOSURE AND REMINDER STATEMENT ON THE MENU. MANAGEMENT INSTRUCTED TO DISCLOSE WHICH FOODS CAN BE ORDERED RAW OR UNDER COOKED AND LINK THOSE FOODS WITH AN ASTERISK * TO A REMINDER STATEMENT THAT STATES THAT  EATING RAW OR UNDER COOKED FOODS CAN INCREASE YOUR RISK OF FOOD BORNE ILLNESS. PRIORITY FOUNDATION 7-38-005,NO CITATION ISSUED. | 36. THERMOMETERS PROVIDED & ACCURATE - Comments: FOUND NO THERMOMETER INSIDE THE 2 DOOR KITCHEN FOOD PREP COOLER.INSTRUCTED TO PROVIDE A VISIBLE THERMOMETER IN MENTIONED COOLER AND TO MAINTAIN  | 49. NON-FOOD/FOOD CONTACT SURFACES CLEAN - Comments: INSTRUCTED TO DETAIL CLEAN SIDES OF ICE BIN AND BAR GUNS AND HOUSINGS ATTACHED AT BAR AREA TO REMOVE FOOD DEBRIS SPILLAGE AND TO MAINTAIN. | 51. PLUMBING INSTALLED; PROPER BACKFLOW DEVICES - Comments: BACK FLOW PREVENTION DEVICE NOT LOCATED AT UTILITY MOP SINK.INSTRUCTED TO INSTALL SO THAT IT CAN BE LOCATED TO BE SERVICED AND MAINTAINED. | 51. PLUMBING INSTALLED; PROPER BACKFLOW DEVICES - Comments: OBSERVED WATER LEAKS AT BASE OF FAUCET OF THE BAR 3 COMPARTMENT SINK.INSTRUCTED TO REPAIR PLUMBING LEAKS AND TO MAINTAIN. | 53. TOILET FACILITIES: PROPERLY CONSTRUCTED, SUPPLIED, & CLEANED - Comments: INSTRUCTED TO REPAIR AND MAINTAIN SELF CLOSING DEVICE FOR MENS WASH ROOM DOOR. | 55. PHYSICAL FACILITIES INSTALLED, MAINTAINED & CLEAN - Comments: INSTRUCTED TO REPLACE WATER STAINED CEILING TILES IN KITCHEN FOOD PREP AND IN ICE MACHINE STORAGE ROOM AND FLOORS ALONG WALLS AND IN ALL CORNERS THROUGHOUT THE KITCHEN AND BAR AREAS IN NEED FOR FURTHER CLEANING AND TO MAINTAIN.",
      "latitude": "41.96855261492736",
      "longitude": "-87.70938107470327",
      "location": "(-87.70938107470327, 41.96855261492736)"
    },
    {
      "inspection_id": "429000",
      "name": "AMANDA'S GROCERY & FAST FOOD",
      "aka_name": "AMANDA'S GROCERY & FAST FOOD",
      "facility_type": "Grocery Store",
      "risk": "Risk 2 (Medium)",
      "address": "10659 S WENTWORTH AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60628",
      "date": "11/03/2010",
      "inspection_type": "Canvass",
      "results": "Fail",
      "violations": "6. HANDS WASHED AND CLEANED, GOOD HYGIENIC PRACTICES; NO BARE HAND CONTACT WITH READY-TO-EAT FOODS. - Comments: All employees who handle food shall wash their hands as often as necessary to maintain a high degree of personal cleanliness and should conform to hygienic practices prescribed by the Board of Health. OBSERVED FOOD HANDLER USING POOR HYIGENIC PRATICES,NOT WASHING HANDS,PUTTING ON GLOVES INSTEAD TO PREPARE SANDWICHES. HANDLING BREAD,CHEESES. INSTRUCTED FOOD HANDLER TO WASH HANDS.- CDI.CITATION ISSUED CRITICAL | 9. WATER SOURCE: SAFE, HOT & COLD UNDER CITY PRESSURE - Comments: All food establishments shall be provided with an adequate supply of hot and cold water under pressure properly connected to the city water supply. OBSERVED PREMISES WITH NO HOT WATER ON PREMISES. CITATION ISSUED CRITICAL. | 18. NO EVIDENCE OF RODENT OR INSECT OUTER OPENINGS PROTECTED/RODENT PROOFED, A WRITTEN LOG SHALL BE MAINTAINED AVAILABLE TO THE INSPECTORS - Comments: All necessary control measures shall be used to effectively minimize or eliminate the presence of rodents, roaches, and other vermin and insects on the premises of all food establishments, in food-transporting vehicles, and in vending machines. OBSERVED FRONT ENTRY DOOR NOT RODENT PROOF AT INSIDE RIGHT BOTTOM. APPROX 1/4 INCH AREA ACCESSIBLE. MUST REPAIR. ALSO EVIDENCE OF RODENT DROPPING ON PREMISES IN OFFICE ,INSIDE BRICK STORAGE AREA, AND TOP OF BASEMENT STAIRS.MUST CLEAN/SANITIZE AREAS.SERIOUS CITATION ISSUED. | 21. * CERTIFIED FOOD MANAGER ON SITE WHEN POTENTIALLY HAZARDOUS FOODS ARE  PREPARED AND SERVED - Comments: A certified food service manager must be present in all establishments at which potentially hazardous food is prepared or served. OBSERVED NO CITY FOOD SANITATION CERTIFICATE POSTED OR CERTIFIED FOOD MANAGER ON PREMISES WHEN POTENTIALLY HAZARDOUS FOODS ARE PREPARED AND SERVED. CITATION ISSUED SERIOUS. | 24. DISH WASHING FACILITIES: PROPERLY DESIGNED, CONSTRUCTED, MAINTAINED, INSTALLED, LOCATED AND OPERATED - Comments: All dishwashing machines must be of a type that complies with all requirements of the plumbing section of the Municipal Code of Chicago and Rules and Regulation of the Board of Health. OBSERVED DISH WASHING FACILITIES NOT MAINTAINED,(IE HOT WATER HANDLE MISSING ON 2ND FAUCET OF 3-COMP SINK (HOT WATER HANDLE). MUST INSTALL. SERIOUS CITATION ISSUED. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: The floors shall be constructed per code, be smooth and easily cleaned, and be kept clean and in good repair. MUST CLEAN/SANITIZE FLOORS BEHIND COOKING EQUIPMENT AND BASEMENT FLOORS. | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: All parts of the food establishment and all parts of the property used in connection with the operation of the establishment shall be kept neat and clean and should not produce any offensive odors. MUST REMOVE CLUTTER IN BASEMENT FLOORS AND OFFICE AND ORGANIZE STORAGE OFF FLOORS TO PREVENT PEST HARBORAGE AREAS.",
      "latitude": "41.69986166478915",
      "longitude": "-87.62794266900995",
      "location": "(-87.62794266900995, 41.699861664789154)"
    },
    {
      "inspection_id": "463268",
      "name": "CURRENTS ON THE RIVER",
      "aka_name": "CURRENTS ON THE RIVER",
      "facility_type": "Restaurant",
      "risk": "Risk 3 (Low)",
      "address": "200 S WACKER DR ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60606",
      "date": "12/14/2010",
      "inspection_type": "License Re-Inspection",
      "results": "Pass",
      "violations": "",
      "latitude": "41.87928363996397",
      "longitude": "-87.63710070443777",
      "location": "(-87.63710070443776, 41.87928363996398)"
    },
    {
      "inspection_id": "2169302",
      "name": "SKY LOBBY",
      "aka_name": "SKY LOBBY",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "5700 S MARYLAND AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60637",
      "date": "05/08/2018",
      "inspection_type": "Canvass",
      "results": "Pass w/ Conditions",
      "violations": "2. FACILITIES TO MAINTAIN PROPER TEMPERATURE - Comments: OBSERVED REACH-IN COOLER NOT MAINTAINING PROPER TEMPERATURE 47.2F INSTRUCTED MANAGER TO REPAIR. COOLER MUST MAINTAIN 40F OR BELOW. COOLER IS TAGGED HELD FOR INSPECTION AND MUST NOT BE USED UNTIL REINSPECTED BY CHICAGO DEPARTMENT OF HEALTH. CRITICAL VIOLATION 7-38-005A. | 3. POTENTIALLY HAZARDOUS FOOD MEETS TEMPERATURE REQUIREMENT DURING STORAGE, PREPARATION DISPLAY AND SERVICE - Comments: OBSERVED COOKED TURKEY SAUSAGE 95.2F AND PORK SAUSAGE 102.3F-105F DISPLAYED FOR SERVICE AT IMPROPER TEMPERATURE ON STEAM TABLE. OBSERVED CREAM CHEESE 45.1F STORED AT IMPROPER TEMPERATURE IN REACH-IN COOLER. INSTRUCTED MANAGER TO DISCARD. ALL HOT FOOD MUST MAINTAIN 140F OR ABOVE AND COLD FOOD 40F OR BELOW DURING STORAGE, PREPARATION, DISPLAY AND SERVICE. CRITICAL VIOLATION 7-38-005A | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: CLEAN FLOORS UNDER AND BETWEEN ALL EQUIPMENT ALONG WALLS AND IN CORNERS IN SERVING LINE, KITCHEN, AND DISH WASHING AREAS. | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: OBSERVED WATER DRAINING ON FLOOR IN DISH WASHING AREA, INSTRUCTED MANAGER TO EXTEND WASTE LINE TO FLOOR DRAIN. | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: REMOVE ALL FOOD (CHOCOLATE SYRUP) FROM CLEANING EQUIPMENT IN COFFEE PREP AREA.",
      "latitude": "41.791260617835505",
      "longitude": "-87.60508491200588",
      "location": "(-87.60508491200589, 41.79126061783551)"
    },
    {
      "inspection_id": "1951069",
      "name": "A TASTE OF HEAVEN",
      "aka_name": "A TASTE OF HEAVEN",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "5401 N CLARK ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60640",
      "date": "08/23/2016",
      "inspection_type": "Canvass Re-Inspection",
      "results": "Pass",
      "violations": "30. FOOD IN ORIGINAL CONTAINER, PROPERLY LABELED: CUSTOMER ADVISORY POSTED AS NEEDED - Comments: LABEL ALL DRY BULK FOOD CONTAINERS UNDER THE PREP TABLE AND MAINTAIN. ALL PASTRIES WRAPPED INDIVIDUALLY FOR SALE NEEDS A LABEL, NAME OF THE COMPANY, ADDRESS, ZIP CODE, INGREDIENTS, AND NOTED FOOD ALLERGENS INGREDIENTS. | 31. CLEAN MULTI-USE UTENSILS AND SINGLE SERVICE ARTICLES PROPERLY STORED: NO REUSE OF SINGLE SERVICE ARTICLES - Comments: ALL CLEAN UTENSILS, POTS,PANS, FOOD CONTAINERS MUST BE STORED UPSIDE,DOWN/INVERTED TO PREVENT POSSIBLE CONTAMINATION AND DUST BUILD-UP. | 32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: INSTALL A SPLASH GUARD BETWEEN THE EXPOSED HAND SINK AND THE PREP COOLER IN THE FRONT SERVING AREA. RIPPED OFF RUBBER GASKET ALONG THE DOORS OF THE 2 DOOR REACH IN COOLER. MUST REPAIR AND MAINTAIN. | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: CLEAN THE FAN GUARD OF THE 2 DOOR REACH IN COOLER WITH DUST BUILD-UP AND MAINTAIN.  | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: HOOD/FILTER WITH DUST/GREASE BUILD-UP. MUST CLEAN REMOVE DUST AND GREASE AND MAINTAIN.",
      "latitude": "41.9798953557881",
      "longitude": "-87.66813564252394",
      "location": "(-87.66813564252394, 41.9798953557881)"
    },
    {
      "inspection_id": "679734",
      "name": "SAN MIGUELL II PRIVATE SCHOOL",
      "aka_name": "SAN MIGUELL II PRIVATE SCHOOL",
      "facility_type": "School",
      "risk": "Risk 1 (High)",
      "address": "819 N LEAMINGTON ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60651",
      "date": "03/22/2012",
      "inspection_type": "Canvass Re-Inspection",
      "results": "Pass w/ Conditions",
      "violations": "14. PREVIOUS SERIOUS VIOLATION CORRECTED, 7-42-090 - Comments: A separate and distinct offense shall be deemed to have been committed for each Serious violation that is not corrected upon re-inspection by the health authority.PREVIOUS SERIOUS VIOLATION FROM REPORT #167470 3/14/12 #18 STILL OBSERVED A INCOMPLETE PEST CONTROL LOG BOOK (NO LICENSE)PROVIDED IN LOG BOOK.A COPY OF LICENSE WAS FAXED FROM ANDERSON PEST CONTROL DURING THE INSPECTION.MUST PROVIDE & MAINTAIN AT ALL TIMES.(CRITICAL 7-42-090)CITATION ISSUED. | 18. NO EVIDENCE OF RODENT OR INSECT OUTER OPENINGS PROTECTED/RODENT PROOFED, A WRITTEN LOG SHALL BE MAINTAINED AVAILABLE TO THE INSPECTORS - Comments: All necessary control measures shall be used to effectively minimize or eliminate the presence of rodents, roaches, and other vermin and insects on the premises of all food establishments, in food-transporting vehicles, and in vending machines.VIOLATION NOT CORRECTED.SEE VIOLATION #14. | 32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: All food and non-food contact equipment and utensils shall be smoMUST PROVIDE SIGN ON 2ND FL. BOY'S TOILET ROOM.MUST REPAIR OR REPLACE WORN DOOR GASKET ON REACH IN COOLER.  oth, easily cleanable, and durable, and shall be in good repair. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: Inspector Comments: The floors shall be constructed per code, be smooth and easily cleaned, and be kept clean and in good repair.MUST CLEAN FLOORS ALONG WALL BASES IN MFD ROOM,1ST FL. HALL CLOSETS,BASEMENT,1ST FL. JANITOR CLOSET,1ST.FL. STAFF TOILET ROOM STORAGE CLOSET.MUST REMOVE WATER FROM FLOOR IN 1ST FL. STAFF TOILET ROOM CLOSET.MUST REPAIR OR REPLACE MISSING & DAMAGED FLOOR TILES IN 1ST & 2ND FL.BOY'S | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: Inspector Comments: The walls and ceilings shall be in good repair and easily cleaned.MUST REPAIR OR REPLACE MISSING & DAMAGED WALL TILES IN 2ND FL. BOY'S TOILET ROOM | 36. LIGHTING: REQUIRED MINIMUM FOOT-CANDLES OF LIGHT PROVIDED, FIXTURES SHIELDED - Comments: Inspector Comments: Shielding to protect against broken glass falling into food shall be provided for all artificial lighting sources in preparation, service, and display facilities.MUST PROVIDE LIGHT SHIELDS IN FOOD PREP AREA.   | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: Inspector Comments: Ventilation: All plumbing fixtures, such as toilets, sinks, washbasins, etc., must be adequately trapped, vented, and re-vented and properly connected to the sewer in accordance with the plumbing chapter of the Municipal Code of Chicago and the Rules and Regulations of the Board of Health.MUST REPAIR OR REPLACE MISSING FAUCET HANDLES AT HAND SINKS IN 1ST FL. GIRL'S,2ND FL. BOY'S & LEAKY FAUCET IN 1ST FL. STAFF TOILET ROOM MOP SINK CLOSET.NO RUNNING WATER AT 1 OF 2 HAND SINKS IN 1ST FL. BOY'S,1ST FL.GIRL'S & GIRL'S | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: Inspector Comments: All parts of the food establishment and all parts of the property used in connection with the operation of the establishment shall be kept neat and clean and should not produce any offensive odors.MUST ELEVATE & ORGANIZE ARTICLES OFF OF FLOOR & AWAY FROM WALLS IN 1ST FL. HALL CLOSET,JANITOR'S CLOSET,BASEMENT.",
      "latitude": "41.895567589301145",
      "longitude": "-87.75424731559194",
      "location": "(-87.75424731559195, 41.895567589301145)"
    },
    {
      "inspection_id": "1734333",
      "name": "HP TACO STATION CO.",
      "aka_name": "HYDE PARK TACO STATION",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "5300 S DORCHESTER AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60615",
      "date": "03/17/2016",
      "inspection_type": "License",
      "results": "Pass",
      "violations": "31. CLEAN MULTI-USE UTENSILS AND SINGLE SERVICE ARTICLES PROPERLY STORED: NO REUSE OF SINGLE SERVICE ARTICLES - Comments: MUST INVERT ALL MULTI-USE CONTAINERS.   | 32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: MUST SEAL OPENINGS IN THE EXPOSED BRICK WALLS IN THE BASEMENT STORAGE AREA.  MUST ALSO SEAL THE EXPOSED BRICK WALLS IN THE BASEMENT STORAGE AREA.   | 41. PREMISES MAINTAINED FREE OF LITTER, UNNECESSARY ARTICLES, CLEANING  EQUIPMENT PROPERLY STORED - Comments: MUST MINIMIZE CLUTTER IN THE REAR SECTION OF THE BASEMENT STORAGE AREA.  MUST PROVIDE ADDITIONAL STORAGE RACKS AS NEEDED. STORE ALL ITEMS 6 INCHES OFF THE FLOOR.  ",
      "latitude": "41.79945686102498",
      "longitude": "-87.59193171135288",
      "location": "(-87.59193171135287, 41.79945686102498)"
    },
    {
      "inspection_id": "1345782",
      "name": "Yuki Hana",
      "aka_name": "SAKAE",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "2918-2920 N Clark ST ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60657",
      "date": "01/07/2014",
      "inspection_type": "License",
      "results": "Fail",
      "violations": "",
      "latitude": "41.93528683052736",
      "longitude": "-87.64707246891297",
      "location": "(-87.64707246891297, 41.93528683052736)"
    },
    {
      "inspection_id": "2252265",
      "name": "BEANS & BAGEL",
      "aka_name": "BEANS & BAGEL",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "2601 W LELAND AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60625",
      "date": "01/09/2019",
      "inspection_type": "Canvass",
      "results": "Pass w/ Conditions",
      "violations": "3. MANAGEMENT, FOOD EMPLOYEE AND CONDITIONAL EMPLOYEE; KNOWLEDGE, RESPONSIBILITIES AND REPORTING - Comments: OBSERVED NO EMPLOYEE HEALTH POLICY ON SITE.INSTRUCTED MANAGEMENT TO CREATE A EMPLOYEE HEALTH POLICY' PRIORITY FOUNDATION VIOLATION 7-38-010 NO CITATION ISSUED. | 5. PROCEDURES FOR RESPONDING TO VOMITING AND DIARRHEAL EVENTS - Comments: OBSERVED NO CLEAN UP POLICY/KIT ON SITE.INSTRUCTED MANAGEMENT TO CREATE A CLEAN UP POLICY/KIT. PRIORITY FOUNDATION VIOLATION 7-38-005 NO CITATION ISSUED | 39. CONTAMINATION PREVENTED DURING FOOD PREPARATION, STORAGE & DISPLAY - Comments: OBSERVED NO BARRIER PREVENTING NON FOOD PERSONS FROM ENTERING FRONT AND REAR FOOD PREP AREAS.INSTRUCTED MANAGEMENT TO PUT UP A BARRIER PREVENTING NON FOOD PERSONS FROM ENTERING. CORE VIOLATION | 55. PHYSICAL FACILITIES INSTALLED, MAINTAINED & CLEAN - Comments: OBSERVED OPENINGS IN THE CEILING IN BASEMENT OVER DESK.INSTRUCTED MANAGEMENT TO SEAL ALL HOLES AT CEILING IN BASEMENT. CORE VIOLATION | 55. PHYSICAL FACILITIES INSTALLED, MAINTAINED & CLEAN - Comments:  FLOORS IN BASEMENT DIRTY AT BASE OF WALL.INSTRUCTED MANAGEMENT TO CLEAN FLOORS IN BASEMENT. CORE VIOLATION",
      "latitude": "41.966634464642866",
      "longitude": "-87.69380644969819",
      "location": "(-87.69380644969819, 41.96663446464287)"
    },
    {
      "inspection_id": "604423",
      "name": "CHICAGO PIZZERIA, INC.",
      "aka_name": "CHICAGO PIZZERIA",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "6149 N MILWAUKEE AVE ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60646",
      "date": "09/16/2011",
      "inspection_type": "License",
      "results": "Fail",
      "violations": "32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: Cooler shelving that had peeling paint/rust shall be repair, sealed or replaced. | 35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: Hole on wall behind prep counter, rear corner shall be repair/sealed,stained ceiling tiles shall be repair/replaced, rear door frame of kitchen prep area door had exposed raw wood, shall be repair/sealed. | 36. LIGHTING: REQUIRED MINIMUM FOOT-CANDLES OF LIGHT PROVIDED, FIXTURES SHIELDED - Comments: Missing Light shields in kitchen prep area shall be provided. | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: Mop sink faucet in state of disrepair(leaking), shall be repair/replaced, exhaust vents(ventilation) in bathrooms, dining areas, and hallway not clean need cleaning.",
      "latitude": "41.993494958245506",
      "longitude": "-87.7840277442041",
      "location": "(-87.78402774420411, 41.993494958245506)"
    },
    {
      "inspection_id": "1938219",
      "name": "Yango's Grill",
      "aka_name": "Yango's Grill",
      "facility_type": "Restaurant",
      "risk": "Risk 1 (High)",
      "address": "2845 N Broadway ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60657",
      "date": "06/21/2016",
      "inspection_type": "Canvass",
      "results": "Pass w/ Conditions",
      "violations": "21. * CERTIFIED FOOD MANAGER ON SITE WHEN POTENTIALLY HAZARDOUS FOODS ARE  PREPARED AND SERVED - Comments: NO CITY OF CHICAGO CERTIFIED FOOD MANAGER ON SITE NOR CITY OF CHICAGO CERTIFICATE POSTED ON PREMISES WHILE POTENTIALLY HAZARDOUS FOODS ARE BEING PREPARED AND SERVED SUCH AS ITALIAN SAUSAGES, GRILL CHICKEN SANDWICHES, FISH SANDWICHES ETC. INSTRUCTED TO OPERATE WITH CITY OF CHICAGO CERTIFIED FOOD MANAGER AT ALL TIMES POTENTIALLY HAZARDOUS FOODS ARE PREPARED AND SERVED. INSTRUCTED TO ENROLL PROVIDE CITY OF CHICAGO CERTIFICATE. SERIOUS VIOLATION 7-38-012(a) | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: OBSERVED GREASE BUILDUP ON VENTILATION HOOD AND FILTERS ABOVE COOKING EQUIPMENT. MUST CLEAN AND MAINTAIN. | 40. REFRIGERATION AND METAL STEM THERMOMETERS PROVIDED AND CONSPICUOUS - Comments: MUST PROVIDE WORKING THERMOMETER AT THE UPRIGHT REFRIGERATOR IN REAR PREP AREA.",
      "latitude": "41.933981414324045",
      "longitude": "-87.6442622020541",
      "location": "(-87.6442622020541, 41.93398141432405)"
    },
    {
      "inspection_id": "250566",
      "name": "PAN BAGUETTE BAKERY",
      "aka_name": "PAN BAGUETTE BAKERY",
      "facility_type": "Bakery",
      "risk": "Risk 2 (Medium)",
      "address": "8325 S PULASKI RD ",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60652",
      "date": "06/04/2010",
      "inspection_type": "Canvass",
      "results": "Pass",
      "violations": "32. FOOD AND NON-FOOD CONTACT SURFACES PROPERLY DESIGNED, CONSTRUCTED AND MAINTAINED - Comments: IMPROPER STOPPERS FOR 3-COMPARTMENT SINK. PROVIDE SAME. | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: FLOOR TILES MISSING IN REAR. REPLACE SAME. | 38. VENTILATION: ROOMS AND EQUIPMENT VENTED AS REQUIRED: PLUMBING: INSTALLED AND MAINTAINED - Comments: PROVIDE PROPER VENTILATION ABOVE CONVECTION OVENS.",
      "latitude": "41.74143279323668",
      "longitude": "-87.72150847137915",
      "location": "(-87.72150847137914, 41.741432793236676)"
    },
    {
      "inspection_id": "2370291",
      "name": "3JJJ'S BETTER TASTE JAMAICAN JERK RESTAURANT",
      "aka_name": "3JJJ'S BETTER TASTE JAMAICAN JERK RESTAURANT",
      "facility_type": "Mobile Food Dispenser",
      "risk": "Risk 3 (Low)",
      "address": "409 E 103 ST",
      "city": "CHICAGO",
      "state": "IL",
      "zip": "60628",
      "date": "09/13/2017",
      "inspection_type": "License Re-Inspection",
      "results": "Fail",
      "violations": "11. ADEQUATE NUMBER, CONVENIENT, ACCESSIBLE, DESIGNED, AND MAINTAINED - Comments: FAUCET HAS BEEN REMOVED AND HOT AND COLD WATER IS NOT COMBINED. MUST REPLACE FAUCET AT HAND SINK. REPAIR WATER PRESSURE AT HAND SINK FOR ADEQUATE HAND WASHING. CRITICAL VIOLATION 7-38-030",
      "latitude": "41.70721220021213",
      "longitude": "-87.61336681197594",
      "location": "(-87.61336681197594, 41.707212200212126)"
    }
  ]
}